Omzlaw/iot-based-industrial-energy-monitoring-and-predictive-load-management-system/MSc Project/Arduino/esp32_digital_twin_controller/esp32_digital_twin_controller.ino
/*
  ESP32 WROOM Industrial Digital Twin Controller (Modular)
  ---------------------------------------------------------
  Hardware modeled:
    - 2x Motors: relay + PWM MOSFET + hall current sensor
    - 2x Lights: relay + PWM MOSFET + hall current sensor
    - 2x Heaters: relay + current sensor (no PWM pin, duty is emulated in software)
    - 2x DS18B20 water temperature sensors (tank1 + tank2 on one OneWire bus)
    - 1x DHT22 ambient sensor
    - 2x analog voltage sensors (load voltage + extra voltage channel)

  MQTT behavior:
    - Publishes telemetry to: dt/<plant_id>/telemetry
    - Subscribes commands from: dt/<plant_id>/cmd
    - Subscribes predictor output: dt/<plant_id>/prediction
    - Publishes command ack to: dt/<plant_id>/cmd_ack

  Control logic:
    - Mirrors simulator style rules:
      * Policy-driven load management with per-load override
      * Mode + season application
      * Overload / peak-risk / restore rules
      * Process/tank-temperature driven heating phases
      * Ambient heater rules

  Required libraries (Arduino Library Manager):
    - ArduinoJson
    - PubSubClient
    - DallasTemperature
    - OneWire
    - DHT sensor library for ESPx (DHTesp)
*/

#include <WiFi.h>
#include <WiFiClientSecure.h>
#include <ArduinoOTA.h>
#include <Wire.h>
#include <PubSubClient.h>
#include <ArduinoJson.h>
#include <OneWire.h>
#include <DallasTemperature.h>
#include <DHTesp.h>
#include <Adafruit_INA219.h>
#include <Preferences.h>
#include <time.h>
#include <esp_wifi.h>
#if __has_include(<esp_eap_client.h>)
#include <esp_eap_client.h>
#define DT_HAS_WIFI_EAP_CLIENT 1
#elif __has_include(<esp_wpa2.h>)
#include <esp_wpa2.h>
#define DT_HAS_WIFI_WPA2_ENTERPRISE 1
#endif
#if __has_include(<esp_arduino_version.h>)
#include <esp_arduino_version.h>
#include "esp_task_wdt.h"
#endif
#if __has_include("secrets.h")
#include "secrets.h"
#endif

#ifndef ESP_ARDUINO_VERSION_MAJOR
#define ESP_ARDUINO_VERSION_MAJOR 2
#endif
#ifndef DT_HAS_WIFI_EAP_CLIENT
#define DT_HAS_WIFI_EAP_CLIENT 0
#endif
#ifndef DT_HAS_WIFI_WPA2_ENTERPRISE
#define DT_HAS_WIFI_WPA2_ENTERPRISE 0
#endif

// Forward declaration for Arduino auto-generated prototypes that use LoadChannel*.
struct LoadChannel;
LoadChannel* findLoadByName(const String& name);

// -----------------------------
// Network / MQTT configuration
// -----------------------------
#ifndef DT_WIFI_SSID
#define DT_WIFI_SSID "YOUR_WIFI_SSID"
#endif
#ifndef DT_WIFI_PASSWORD
#define DT_WIFI_PASSWORD "YOUR_WIFI_PASSWORD"
#endif
#ifndef DT_WIFI_USE_ENTERPRISE
#define DT_WIFI_USE_ENTERPRISE 0
#endif
#ifndef DT_WIFI_EAP_IDENTITY
#define DT_WIFI_EAP_IDENTITY ""
#endif
#ifndef DT_WIFI_EAP_USERNAME
#define DT_WIFI_EAP_USERNAME ""
#endif
#ifndef DT_WIFI_EAP_PASSWORD
#define DT_WIFI_EAP_PASSWORD ""
#endif
#ifndef DT_WIFI_FALLBACK_SSID
#define DT_WIFI_FALLBACK_SSID ""
#endif
#ifndef DT_WIFI_FALLBACK_PASSWORD
#define DT_WIFI_FALLBACK_PASSWORD ""
#endif
#ifndef DT_WIFI_FALLBACK_USE_ENTERPRISE
#define DT_WIFI_FALLBACK_USE_ENTERPRISE 0
#endif
#ifndef DT_WIFI_FALLBACK_EAP_IDENTITY
#define DT_WIFI_FALLBACK_EAP_IDENTITY ""
#endif
#ifndef DT_WIFI_FALLBACK_EAP_USERNAME
#define DT_WIFI_FALLBACK_EAP_USERNAME ""
#endif
#ifndef DT_WIFI_FALLBACK_EAP_PASSWORD
#define DT_WIFI_FALLBACK_EAP_PASSWORD ""
#endif
#ifndef DT_MQTT_BROKER_HOST
#define DT_MQTT_BROKER_HOST "YOUR_MQTT_BROKER_HOST"
#endif
#ifndef DT_MQTT_BROKER_PORT
#define DT_MQTT_BROKER_PORT 8883
#endif
#ifndef DT_MQTT_USERNAME
#define DT_MQTT_USERNAME "YOUR_MQTT_USERNAME"
#endif
#ifndef DT_MQTT_PASSWORD
#define DT_MQTT_PASSWORD "YOUR_MQTT_PASSWORD"
#endif
#ifndef DT_PLANT_IDENTIFIER
#define DT_PLANT_IDENTIFIER "YOUR_PLANT_IDENTIFIER"
#endif
#ifndef DT_OTA_HOSTNAME
#define DT_OTA_HOSTNAME "YOUR_OTA_HOSTNAME"
#endif
#ifndef DT_OTA_PASSWORD
#define DT_OTA_PASSWORD ""
#endif

static const char* DEFAULT_WIFI_SSID = DT_WIFI_SSID;
static const char* DEFAULT_WIFI_PASSWORD = DT_WIFI_PASSWORD;
static const bool WIFI_USE_ENTERPRISE = (DT_WIFI_USE_ENTERPRISE != 0);
static const char* DEFAULT_WIFI_EAP_IDENTITY = DT_WIFI_EAP_IDENTITY;
static const char* DEFAULT_WIFI_EAP_USERNAME = DT_WIFI_EAP_USERNAME;
static const char* DEFAULT_WIFI_EAP_PASSWORD = DT_WIFI_EAP_PASSWORD;
static const char* FALLBACK_WIFI_SSID = DT_WIFI_FALLBACK_SSID;
static const char* FALLBACK_WIFI_PASSWORD = DT_WIFI_FALLBACK_PASSWORD;
static const bool WIFI_FALLBACK_USE_ENTERPRISE = (DT_WIFI_FALLBACK_USE_ENTERPRISE != 0);
static const char* FALLBACK_WIFI_EAP_IDENTITY = DT_WIFI_FALLBACK_EAP_IDENTITY;
static const char* FALLBACK_WIFI_EAP_USERNAME = DT_WIFI_FALLBACK_EAP_USERNAME;
static const char* FALLBACK_WIFI_EAP_PASSWORD = DT_WIFI_FALLBACK_EAP_PASSWORD;
static const char* DEFAULT_MQTT_BROKER_HOST = DT_MQTT_BROKER_HOST;
static const uint16_t DEFAULT_MQTT_BROKER_PORT = DT_MQTT_BROKER_PORT;
static const char* DEFAULT_MQTT_USERNAME = DT_MQTT_USERNAME;
static const char* DEFAULT_MQTT_PASSWORD = DT_MQTT_PASSWORD;

static const unsigned long STARTUP_CONFIG_WINDOW_MS = 8000;
static const unsigned long SERIAL_INPUT_TIMEOUT_MS = 120000;
static const unsigned long WIFI_CONNECT_TIMEOUT_MS = 20000;
static const unsigned long WIFI_RETRY_BACKOFF_MS = 5000;
static const char* PREFERENCES_NAMESPACE = "dtctrl";

static const char* PLANT_IDENTIFIER = DT_PLANT_IDENTIFIER;
static const char* OTA_HOSTNAME = DT_OTA_HOSTNAME;
static const char* OTA_PASSWORD = DT_OTA_PASSWORD;

struct RuntimeConfig {
  String wifiSsid;
  String wifiPassword;
  String mqttHost;
  uint16_t mqttPort = DEFAULT_MQTT_BROKER_PORT;
  String mqttUsername;
  String mqttPassword;
};

RuntimeConfig runtimeConfig;
Preferences preferences;

String topicTelemetry;
String topicCommand;
String topicStatus;
String topicPrediction;
String topicPredictionLong;
String topicPredictionLongLstm;
String topicCommandAck;

// Set true for quick testing. For production, use setCACert with broker root CA.
static const bool USE_INSECURE_TLS = true;

// -----------------------------
// Timing configuration
// -----------------------------
float SAMPLE_INTERVAL_SEC = 1.0f;
unsigned long sampleIntervalMs = 1000;
unsigned long lastSampleMs = 0;

