Omzlaw/iot-based-industrial-energy-monitoring-and-predictive-load-management-system/MSc Project/Arduino/esp32_digital_twin_controller/esp32_digital_twin_controller.ino
// -----------------------------
// Energy window tracking
// -----------------------------
// Keep per-minute buckets for up to 24h so we can compute rolling windows efficiently.
static const int ENERGY_BUCKETS_PER_DAY = 24 * 60;
float energyMinuteBucketsWh[ENERGY_BUCKETS_PER_DAY] = {0};
int energyBucketHead = 0;
int energyBucketCount = 0;
float currentMinuteBucketWh = 0.0f;
unsigned long currentMinuteBucketStartMs = 0;
float cumulativeEnergyWh = 0.0f;
float currentGoalWindowWh = 0.0f;
unsigned long energyGoalWindowStartMs = 0;
unsigned long energyGoalWindowResetCount = 0;
float energyGoalWindowConfigWh = -1.0f;
float energyGoalWindowConfigDurationSec = -1.0f;
float energyGoalWindowConfigPowerCapW = -1.0f;
char energyGoalWindowResetReason[32] = "startup";

// -----------------------------
// Sensor conversion constants
// -----------------------------
static const float ADC_REFERENCE_V = 3.3f;
static const float ADC_MAX_COUNTS = 4095.0f;

// INA219 current sensing via TCA9548A I2C multiplexer
static const bool USE_INA219 = true;
static const bool USE_TCA9548A = true; // mux connected
static const uint8_t I2C_SDA_PIN = 32;
static const uint8_t I2C_SCL_PIN = 33;
static const uint8_t TCA9548A_ADDR = 0x70;
static const uint8_t INA219_ADDR = 0x40;
static const uint8_t INA219_CHANNELS[6] = {0, 1, 4, 5, 2, 3}; // load order: motor1, motor2, heater1, heater2, light1, light2
static const float INA219_CURRENT_GAIN[6] = {1.0f, 1.0f, 1.0f, 1.0f, 1.0f, 1.0f};
static const float INA219_CURRENT_DEADBAND_A = 0.015f;
static const float INA219_CURRENT_FILTER_ALPHA = 0.35f;
static const float INA219_OFFSET_TRACK_ALPHA = 0.02f;
static const float INA219_OFFSET_TRACK_MAX_A = 0.12f;
static const uint8_t INA219_ZERO_CAL_SAMPLES = 40;

// Hall current sensor defaults (adjust per sensor model):
// ACS712 30A => ~0.066 V/A at sensor output, zero-current offset near Vcc/2.
// If the sensor is powered at 5V and the signal is divided down to 3.3V ADC,
// set the divider ratio so the ADC sees a safe scaled value.
static const float CURRENT_SENSOR_SUPPLY_V = 5.0f;
static const float CURRENT_SIGNAL_DIVIDER_RATIO = 10.0f / (10.0f + 5.1f); // V_adc / V_sensor_out (10k to GND, 5.1k to sensor)
static const float CURRENT_SENSOR_SENS_V_PER_A = 0.066f;       // sensor output sensitivity
static const float DEFAULT_CURRENT_ZERO_V = (CURRENT_SENSOR_SUPPLY_V * 0.5f) * CURRENT_SIGNAL_DIVIDER_RATIO;
static const float DEFAULT_CURRENT_SENS_V_PER_A = CURRENT_SENSOR_SENS_V_PER_A * CURRENT_SIGNAL_DIVIDER_RATIO;
static const float CURRENT_DEADBAND_A = 0.05f;
static const uint8_t CURRENT_ZERO_CAL_SAMPLES = 32;
static const float CURRENT_ZERO_TRACK_ALPHA = 0.02f;
static const float CURRENT_ZERO_FORCE_A = 0.08f;
static const unsigned long CURRENT_ZERO_SETTLE_MS = 250;
static const bool SIMULATE_TANK_TEMPS_WHEN_SENSOR_MISSING = false;

// Temperature calibration / filtering.
static const float TANK1_TEMP_OFFSET_C = 0.0f;
static const float TANK2_TEMP_OFFSET_C = 0.0f;
static const float DHT_TEMP_OFFSET_C = 0.0f;
static const float DHT_HUM_OFFSET_PCT = 0.0f;
static const float TANK_TEMP_FILTER_ALPHA = 0.30f;
static const float AMBIENT_TEMP_FILTER_ALPHA = 0.30f;
static const float AMBIENT_HUM_FILTER_ALPHA = 0.25f;
static const float TANK_TEMP_MAX_STEP_C = 3.0f;
static const float PROCESS_TEMP_REACHED_TOL_C = 0.25f; // avoid getting stuck due to display-rounding/filter lag
static const float AMBIENT_TEMP_MAX_STEP_C = 4.0f;
static const float AMBIENT_HUM_MAX_STEP_PCT = 10.0f;
static const uint8_t TEMP_INVALID_MAX_HOLD = 4;

// Voltage sensor divider multipliers (adjust to your module calibration)
static const float VOLTAGE_SENSOR_1_RATIO = 12.0f / 2.2f;
static const float VOLTAGE_SENSOR_2_RATIO = 3.3f / 0.5f;

// -----------------------------
// Control settings
// -----------------------------
float MAX_TOTAL_POWER_W = 15.0f;
// Energy goal defaults: 100 Wh cap over a 24h window.
float MAX_ENERGY_CONSUMPTION_FOR_THR_DAY_WH = 100.0f;
float ENERGY_GOAL_DURATION_SEC = 24.0f * 60.0f * 60.0f;
// Undervoltage protection (set threshold <= 0 to disable)
float UNDERVOLTAGE_THRESHOLD_V = 0.0f;
unsigned long UNDERVOLTAGE_TRIP_DELAY_MS = 500;
unsigned long UNDERVOLTAGE_CLEAR_DELAY_MS = 500;
float UNDERVOLTAGE_RESTORE_MARGIN_V = 0.30f;
// Overvoltage protection (set threshold <= 0 to disable)
float OVERVOLTAGE_THRESHOLD_V = 0.0f;
unsigned long OVERVOLTAGE_TRIP_DELAY_MS = 500;
unsigned long OVERVOLTAGE_CLEAR_DELAY_MS = 500;
float OVERVOLTAGE_RESTORE_MARGIN_V = 0.30f;
float RESTORE_POWER_RATIO = 0.80f;
float CONTROL_COOLDOWN_SEC = 5.0f;
float MIN_DEVICE_DUTY = 0.30f;
float DUTY_STEP_SIZE = 0.10f;
float DUTY_RAMP_RATE_PER_SEC = 0.5f;
float CRITICAL_MIN_DEVICE_DUTY = 0.80f;
float HEATER_WARM_TEMP_C = 25.0f;
float HEATER_DUTY_STEP_SIZE = 0.10f;
float HEATER_HOT_OFF_TEMP_C = 30.0f;
bool emergencyStopActive = false;
bool undervoltageActive = false;
unsigned long undervoltageLowSinceMs = 0;
unsigned long undervoltageRecoverSinceMs = 0;
bool overvoltageActive = false;
unsigned long overvoltageHighSinceMs = 0;
unsigned long overvoltageRecoverSinceMs = 0;

enum VoltageInjectionMode { VOLTAGE_INJECTION_NONE, VOLTAGE_INJECTION_UNDERVOLTAGE, VOLTAGE_INJECTION_OVERVOLTAGE };
VoltageInjectionMode voltageInjectionMode = VOLTAGE_INJECTION_NONE;
float voltageInjectionMagnitudeV = 0.0f;
float loadBusVoltageRawV = NAN;
float auxVoltageRawV = NAN;

// Overcurrent protection (per-load)
float LOAD_OVERCURRENT_LIMIT_A = 2.0f;
unsigned long OVERCURRENT_TRIP_DELAY_MS = 100;
unsigned long OVERCURRENT_CLEAR_DELAY_MS = 1000;

// -----------------------------
// Pin map (ESP32 WROOM)
// -----------------------------
// Guide used: ESP32 DevKit/WROOM pinout in your screenshot.
// Strategy:
//   - Current sensing is via INA219 + TCA9548A (I2C), no ADC pins needed.
//   - Use ADC1 pins for voltage sensing to avoid ADC2/WiFi conflicts.

struct DevicePins {
  uint8_t relayPin;
  int8_t pwmPin;      // -1 for no PWM hardware
  uint8_t currentPin; // analog pin
};

// Relay modules are often active-LOW. Set false if your relay turns ON with HIGH.
static const bool RELAY_ACTIVE_LOW = true;
static inline void writeRelayState(uint8_t pin, bool on);

