Omzlaw/iot-based-industrial-energy-monitoring-and-predictive-load-management-system/MSc Project/Arduino/esp32_digital_twin_controller/esp32_digital_twin_controller.ino
// Motors (relay + PWM + current)
static const DevicePins MOTOR1_PINS = {16, 13, 32};
static const DevicePins MOTOR2_PINS = {17, 26, 33};
// Lights (relay + PWM + current)
static const DevicePins LIGHT1_PINS = {5, 27, 34};
static const DevicePins LIGHT2_PINS = {18, 14, 35};
// Heaters (relay + current only)
static const DevicePins HEATER1_PINS = {19, -1, 36};
static const DevicePins HEATER2_PINS = {21, -1, 39};

// Voltage sensor analog pins (ADC1)
static const uint8_t VOLTAGE_SENSOR_1_PIN = 34; // across loads
static const uint8_t VOLTAGE_SENSOR_2_PIN = 35; // secondary voltage channel

// I2C pins for TCA9548A + INA219
static const uint8_t I2C_SDA_RUNTIME_PIN = I2C_SDA_PIN;
static const uint8_t I2C_SCL_RUNTIME_PIN = I2C_SCL_PIN;

// Temperature sensors
static const uint8_t DS18B20_ONEWIRE_PIN = 23; // OneWire bus for both water DS18B20 sensors
static const uint8_t DHT22_PIN = 22;            // Ambient DHT22 data pin

// Ultrasonic level sensors (echo pins moved to input-only GPIO36/39 to free PWM pins).
static const uint8_t ULTRASONIC_TANK1_TRIG_PIN = 25;  // trigger for tank1
// Use a dedicated trigger line for tank2 to avoid cross-talk between sensors.
static const uint8_t ULTRASONIC_TANK2_TRIG_PIN = 4;   // trigger for tank2
// Tank1 echo moved off GPIO36 to avoid shared-ADC line conflicts in mixed sensor wiring.
static const uint8_t ULTRASONIC_TANK1_ECHO_PIN = 15;  // echo for tank1
static const uint8_t ULTRASONIC_TANK2_ECHO_PIN = 39;  // echo for tank2 (input-only)
// Set true for standard TRIG-high pulse. Set false if TRIG is driven via NPN pull-up (active-low).
static const bool ULTRASONIC_TRIG_ACTIVE_HIGH = true;
static const uint16_t ULTRASONIC_TRIG_PULSE_US = 80; // RCWL-1670 behaves more reliably with a longer trigger pulse
static const uint16_t ULTRASONIC_TRIG_PREPULSE_US = 2;
static const uint8_t ULTRASONIC_RETRY_COUNT = 5;
static const uint16_t ULTRASONIC_RETRY_DELAY_MS = 50;
static const uint16_t ULTRASONIC_INTER_SENSOR_DELAY_MS = 90;
static const unsigned long ULTRASONIC_ECHO_TIMEOUT_US = 35000UL; // sized for <= 4.5m to reduce blocking
static const float ULTRASONIC_MIN_CM = 2.0f;
static const float ULTRASONIC_MAX_CM = 450.0f;
static const float ULTRASONIC_EMA_ALPHA = 0.50f;
static const float ULTRASONIC_FAST_ALPHA = 0.78f;
static const float ULTRASONIC_FAST_DELTA_CM = 1.0f;
static const float ULTRASONIC_JITTER_BAND_CM = 0.20f;
static const float ULTRASONIC_MAX_STEP_CM = 18.0f;
static const uint8_t ULTRASONIC_MAX_CONSECUTIVE_MISSES = 3;
static const uint8_t ULTRASONIC_POST_MEDIAN_WINDOW = 5;
static const float ULTRASONIC_TRANSFER_JITTER_BAND_CM = 0.35f;
// During transfer, allow a small reverse movement band but heavily damp it.
static const float ULTRASONIC_TRANSFER_REVERSE_TOL_CM = 0.6f;
static const float ULTRASONIC_TRANSFER_MAX_REVERSE_STEP_CM = 0.2f;
static const float ULTRASONIC_TRANSFER_ALPHA_FORWARD = 0.45f;
static const float ULTRASONIC_TRANSFER_ALPHA_REVERSE = 0.08f;
static const float ULTRASONIC_HEIGHT_MARGIN_CM = 4.0f;
static const float ULTRASONIC_MAX_RATE_IDLE_CM_PER_SEC = 2.0f;
static const float ULTRASONIC_MAX_RATE_TRANSFER_CM_PER_SEC = 5.0f;
static const unsigned long ULTRASONIC_PUMP_SETTLE_MS = 700;
// SR04M-2 / JSN-SR04T UART mode (set true if your sensor is UART-only).
static const bool ULTRASONIC_UART_MODE = false;
static const uint32_t ULTRASONIC_UART_BAUD = 9600;
static const int8_t ULTRASONIC1_UART_RX_PIN = 36;
static const int8_t ULTRASONIC2_UART_RX_PIN = 39;
static const int8_t ULTRASONIC_UART_TX_PIN = -1; // not required for JSN-SR04T (sensor TX only)

// Tank geometry + production process thresholds
float TANK1_HEIGHT_CM = 19.8f;
float TANK2_HEIGHT_CM = 19.8f;
float TANK1_LOW_LEVEL_PCT = 15.0f;
float TANK2_LOW_LEVEL_PCT = 15.0f;
float TANK1_HIGH_LEVEL_PCT = 90.0f;
float TANK2_HIGH_LEVEL_PCT = 90.0f;
float TANK1_LEVEL_TARGET_PCT = 70.0f;
float TANK2_LEVEL_TARGET_PCT = 70.0f;
float TANK1_TEMP_TARGET_C = 30.0f;
float TANK2_TEMP_TARGET_C = 30.0f;
float PROCESS_TEMP_TARGET_STEP_PER_CYCLE_C = 1.0f;
float TANK_HEAT_RATE_C_PER_SEC = 0.10f;
float TANK_COOL_RATE_PER_SEC = 0.012f;
uint32_t PRODUCTION_GOAL_CYCLES = 4;

// -----------------------------
// Controller state
// -----------------------------
enum ControlPolicy { POLICY_RULE_ONLY, POLICY_HYBRID, POLICY_AI_PREFERRED, POLICY_NO_ENERGY_MANAGEMENT };
enum PlantMode { PLANT_NORMAL, PLANT_HIGH_PROD, PLANT_LOW_PROD, PLANT_ENERGY_SAVING };
enum SeasonMode { SEASON_DEFAULT, SEASON_SUMMER, SEASON_WINTER, SEASON_SPRING, SEASON_AUTUMN };
enum LoadClass { CLASS_CRITICAL, CLASS_ESSENTIAL, CLASS_IMPORTANT, CLASS_SECONDARY, CLASS_NON_ESSENTIAL };

ControlPolicy controlPolicy = POLICY_HYBRID;
PlantMode plantMode = PLANT_NORMAL;
SeasonMode seasonMode = SEASON_DEFAULT;
bool peakEvent = false;
String tariffState = "OFFPEAK";

// Scene automation: drives repeatable production phases for policy comparison.
bool sceneEnabled = false;
String sceneName = "OFF";
float sceneDurationSec = 0.0f;
bool sceneLoop = true;
unsigned long sceneStartMs = 0;
bool sceneLockActive = false;
float sceneTargetTempC = NAN;
float sceneTargetHumidityPct = NAN;
bool sceneOverrideModeEnabled = false;
PlantMode sceneOverrideMode = PLANT_NORMAL;
bool sceneOverrideSeasonEnabled = false;
SeasonMode sceneOverrideSeason = SEASON_DEFAULT;
bool sceneOverridePolicyEnabled = false;
ControlPolicy sceneOverridePolicy = POLICY_HYBRID;
bool sceneOverrideTariffEnabled = false;
String sceneOverrideTariffState = "OFFPEAK";
bool sceneOverridePeakEnabled = false;
bool sceneOverridePeakEvent = false;
bool sceneOverrideTempEnabled = false;
float sceneOverrideTempC = NAN;
bool sceneOverrideHumidityEnabled = false;
float sceneOverrideHumidityPct = NAN;

// Production goal process (two tanks): HEAT1 -> TRANSFER 1->2 -> HEAT2 -> TRANSFER 2->1.
enum ProductionState { PROCESS_IDLE, PROCESS_HEAT_TANK1, PROCESS_TRANSFER_1_TO_2, PROCESS_HEAT_TANK2, PROCESS_TRANSFER_2_TO_1 };
bool productionProcessEnabled = false;
bool processLockActive = false;
ProductionState productionState = PROCESS_IDLE;
unsigned long processStartMs = 0;
uint32_t processCycleCount = 0;
String predictorMode = "ONLINE";
bool predictorModeSet = true;
bool processConfigGoalCyclesSet = false;
bool processConfigTank1LevelSet = false;
bool processConfigTank2LevelSet = false;
bool processConfigTank1TempSet = false;
bool processConfigTank2TempSet = false;

float tank1LevelPct = 0.0f;
float tank2LevelPct = 0.0f;
float tank1DistanceCm = NAN;
float tank2DistanceCm = NAN;
float tank1RawDistanceCm = NAN;
float tank2RawDistanceCm = NAN;
float lastTank1DistanceCm = NAN;
float lastTank2DistanceCm = NAN;
float tank1DistanceMedianBuf[ULTRASONIC_POST_MEDIAN_WINDOW] = {NAN, NAN, NAN, NAN, NAN};
float tank2DistanceMedianBuf[ULTRASONIC_POST_MEDIAN_WINDOW] = {NAN, NAN, NAN, NAN, NAN};
uint8_t tank1DistanceMedianCount = 0;
uint8_t tank2DistanceMedianCount = 0;
bool tank1LevelValid = false;
bool tank2LevelValid = false;
uint8_t tank1UltrasonicMissCount = 0;
uint8_t tank2UltrasonicMissCount = 0;
unsigned long tank1LastDistanceAcceptedMs = 0;
unsigned long tank2LastDistanceAcceptedMs = 0;
unsigned long ultrasonicPumpSettleUntilMs = 0;
bool ultrasonicPumpStateInitialized = false;
bool ultrasonicLastPump12On = false;
bool ultrasonicLastPump21On = false;
float tank1TempC = 24.0f;
float tank2TempC = 24.0f;

// Predictor signal cache
enum PredictionInputSource { PRED_SRC_SHORT, PRED_SRC_LONG_RF, PRED_SRC_LONG_LSTM };
bool predictorPeakRisk = false;
String predictorRiskLevel = "LOW";
float predictorPowerW = 0.0f;
float predictorHorizonSec = 0.0f;
double predictorSourceTimestampSec = 0.0;
String predictorSourceMode = "FUSED";
bool predictorSourceModelReady = false;
unsigned long predictorLastAppliedMs = 0;
float predictionApplyDelaySec = 0.0f;
static const unsigned long AI_DYNAMIC_PREDICTION_STALE_MS = 15000UL;

// Evaluation counters
unsigned long totalControlActions = 0;
unsigned long sheddingEventCount = 0;
unsigned long curtailEventCount = 0;
unsigned long restoreEventCount = 0;
unsigned long overloadEventCount = 0;
float maxOvershootW = 0.0f;
float overshootEnergyWs = 0.0f;
bool wasOverloadedLastTick = false;
unsigned long loadToggleCount = 0;
bool lastOnState[6] = {true, true, true, true, true, true};

