Omzlaw/iot-based-industrial-energy-monitoring-and-predictive-load-management-system/MSc Project/Arduino/esp32_digital_twin_controller/esp32_digital_twin_controller.ino
// Peak-risk settling tracker
bool peakRiskActive = false;
unsigned long peakRiskStartMs = 0;
float lastPeakSettlingSec = 0.0f;

struct AISuggestion {
  String deviceName;
  bool hasOn = false;
  bool onValue = true;
  bool hasDuty = false;
  float dutyValue = 1.0f;
  bool hasProcessMode = false;
  ProductionState processMode = PROCESS_IDLE;
};
static const int MAX_AI_SUGGESTIONS = 8;
AISuggestion aiSuggestions[MAX_AI_SUGGESTIONS];
int aiSuggestionCount = 0;

struct PredictionChannelState {
  bool applied = false;
  bool pendingReady = false;
  bool peakRisk = false;
  String riskLevel = "LOW";
  float powerW = 0.0f;
  float horizonSec = 0.0f;
  double sourceTimestampSec = 0.0;
  String sourceMode = "UNSET";
  bool sourceModelReady = false;
  unsigned long lastAppliedMs = 0;
  unsigned long pendingApplyAtMs = 0;
  bool pendingPeakRisk = false;
  String pendingRiskLevel = "LOW";
  float pendingPowerW = 0.0f;
  float pendingHorizonSec = 0.0f;
  double pendingSourceTimestampSec = 0.0;
  String pendingSourceMode = "UNSET";
  bool pendingSourceModelReady = false;
  AISuggestion suggestions[MAX_AI_SUGGESTIONS];
  int suggestionCount = 0;
  AISuggestion pendingSuggestions[MAX_AI_SUGGESTIONS];
  int pendingSuggestionCount = 0;
};

static const int PREDICTION_SOURCE_COUNT = 3;
PredictionChannelState predictionStateBySource[PREDICTION_SOURCE_COUNT];

unsigned long lastControlActionMs = 0;

// -----------------------------
// Hardware clients
// -----------------------------
WiFiClientSecure secureClient;
PubSubClient mqttClient(secureClient);
bool otaStarted = false;
OneWire oneWire(DS18B20_ONEWIRE_PIN);
DallasTemperature ds18b20(&oneWire);
DHTesp dht22;
HardwareSerial UltrasonicSerial1(1);
HardwareSerial UltrasonicSerial2(2);
Adafruit_INA219 ina219(INA219_ADDR);
static const size_t INA219_SENSOR_COUNT = 6;
bool ina219Present[INA219_SENSOR_COUNT] = {false, false, false, false, false, false};

// -----------------------------
// PWM compatibility (ESP32 core v2 vs v3)
// -----------------------------
static const uint32_t PWM_FREQUENCY_HZ = 20000;
static const uint8_t PWM_RESOLUTION_BITS = 8;

static void pwmChannelBegin(uint8_t pin, uint8_t channel) {
#if ESP_ARDUINO_VERSION_MAJOR >= 3
  ledcAttachChannel(pin, PWM_FREQUENCY_HZ, PWM_RESOLUTION_BITS, channel);
  ledcWrite(pin, 0);
#else
  ledcSetup(channel, PWM_FREQUENCY_HZ, PWM_RESOLUTION_BITS);
  ledcAttachPin(pin, channel);
  ledcWrite(channel, 0);
#endif
}

static void pwmChannelWrite(uint8_t pin, uint8_t channel, uint8_t duty) {
#if ESP_ARDUINO_VERSION_MAJOR >= 3
  (void)channel;
  ledcWrite(pin, duty);
#else
  (void)pin;
  ledcWrite(channel, duty);
#endif
}

static unsigned long pulseInStable(uint8_t pin, uint8_t state, unsigned long timeoutUs) {
  const uint32_t start = micros();

  // Wait for any previous pulse to end
  while (digitalRead(pin) == state) {
    if ((micros() - start) >= timeoutUs) return 0;
    // keep RTOS/WiFi happy
    if (((micros() - start) & 0x3FFF) == 0) { yield(); }
  }

  // Wait for pulse to start
  while (digitalRead(pin) != state) {
    if ((micros() - start) >= timeoutUs) return 0;
    if (((micros() - start) & 0x3FFF) == 0) { yield(); }
  }

  const uint32_t pulseStart = micros();

  // Measure pulse width
  while (digitalRead(pin) == state) {
    if ((micros() - start) >= timeoutUs) return 0;
    if (((micros() - start) & 0x3FFF) == 0) { yield(); }
  }

  return (unsigned long)(micros() - pulseStart);
}

// -----------------------------
// Device model
// -----------------------------
struct LoadChannel {
  String name;
  DevicePins pins;
  uint8_t pwmChannel;
  bool hasPwm;

  // State
  bool on = true;
  float duty = 1.0f;        // 0..1
  float loadFactor = 1.0f;  // motor-specific usage
  float activityProb = 0.08f; // kept for compatibility (not used for random behavior on hardware)
  LoadClass loadClass = CLASS_IMPORTANT;
  uint8_t priority = 3;

  // Telemetry
  float currentA = 0.0f;
  float powerW = 0.0f;
  float voltageV = 0.0f;
  float tempC = NAN; // used by motors
  float goalWindowEnergyWh = 0.0f;
  String health = "OK";
  String faultCode = "NONE";

  // Calibration
  float currentZeroV = DEFAULT_CURRENT_ZERO_V;
  float currentSensitivityVPerA = DEFAULT_CURRENT_SENS_V_PER_A;
  float currentOffsetA = 0.0f;
  float currentGain = 1.0f;
  float filteredCurrentA = 0.0f;
  bool currentFilterInitialized = false;
  float ratedVoltageV = 12.0f; // overwritten by measured supply at runtime
  float lastDuty = 1.0f;
  float appliedDuty = 0.0f;
  unsigned long lastDutyUpdateMs = 0;
  bool smoothDuty = true;
  float faultInjectA = 0.0f;
  float lastActivePowerW = 0.0f;
  float lastActiveDuty = 1.0f;
  bool policyOverride = false; // exclude this load from policy AI/rule actions
  bool controlReduced = false;
  unsigned long lastAutoCurtailMs = 0;
  unsigned long lastAutoRestoreMs = 0;
  unsigned long restoreBlockedUntilMs = 0;

  // Fault protection
  bool faultActive = false;
  bool faultWasOn = false;
  bool faultLatched = false;
  unsigned long overcurrentStartMs = 0;
  unsigned long faultClearStartMs = 0;
  bool restorePending = false;
  unsigned long restoreAtMs = 0;
  float faultLimitA = LOAD_OVERCURRENT_LIMIT_A;
  unsigned long faultTripDelayMs = OVERCURRENT_TRIP_DELAY_MS;
  unsigned long faultClearDelayMs = OVERCURRENT_CLEAR_DELAY_MS;
  unsigned long faultRestoreDelayMs = OVERCURRENT_CLEAR_DELAY_MS;

  void begin() {
    pinMode(pins.relayPin, OUTPUT);
    writeRelayState(pins.relayPin, false);

    if (hasPwm && pins.pwmPin >= 0) {
      pwmChannelBegin((uint8_t)pins.pwmPin, pwmChannel);
    }

    // When INA219 is used, do not touch the analog current pins (GPIO32/33 are I2C).
    if (!USE_INA219) {
      pinMode(pins.currentPin, INPUT);
    }
  }

  float resolveAppliedDuty(unsigned long nowMs) {
    if (!smoothDuty) {
      appliedDuty = constrain(duty, 0.0f, 1.0f);
      lastDutyUpdateMs = nowMs;
      return appliedDuty;
    }
    if (DUTY_RAMP_RATE_PER_SEC <= 0.0f) {
      appliedDuty = constrain(duty, 0.0f, 1.0f);
      lastDutyUpdateMs = nowMs;
      return appliedDuty;
    }
    if (!on || faultActive) {
      appliedDuty = 0.0f;
      lastDutyUpdateMs = nowMs;
      return 0.0f;
    }
    if (lastDutyUpdateMs == 0) {
      lastDutyUpdateMs = nowMs;
    }
    float dtSec = (nowMs - lastDutyUpdateMs) / 1000.0f;
    if (dtSec <= 0.0f) {
      return appliedDuty;
    }
    lastDutyUpdateMs = nowMs;
    float target = constrain(duty, 0.0f, 1.0f);
    float step = DUTY_RAMP_RATE_PER_SEC * dtSec;
    float diff = target - appliedDuty;
    if (fabs(diff) <= step) appliedDuty = target;
    else appliedDuty += (diff > 0.0f ? step : -step);
    return appliedDuty;
  }

  void applyHardware(unsigned long nowMs) {
    const bool effectiveOn = on && !faultActive;
    if (!hasPwm) {
      duty = effectiveOn ? 1.0f : 0.0f;
      appliedDuty = duty;
      lastDutyUpdateMs = nowMs;
      writeRelayState(pins.relayPin, effectiveOn);
      return;
    }

    float effectiveDuty = constrain(duty, 0.0f, 1.0f);
    if (smoothDuty) {
      effectiveDuty = resolveAppliedDuty(nowMs);
    } else {
      if (!effectiveOn) {
        appliedDuty = 0.0f;
        lastDutyUpdateMs = nowMs;
        effectiveDuty = 0.0f;
      } else {
        appliedDuty = effectiveDuty;
        lastDutyUpdateMs = nowMs;
      }
    }
    writeRelayState(pins.relayPin, effectiveOn);

    if (hasPwm && pins.pwmPin >= 0) {
      uint8_t pwm = effectiveOn ? (uint8_t)(constrain(effectiveDuty, 0.0f, 1.0f) * 255.0f) : 0;
      pwmChannelWrite((uint8_t)pins.pwmPin, pwmChannel, pwm);
    }
  }

  float readCurrentA() {
    if (USE_INA219) {
      currentA = 0.0f;
      return currentA;
    }
    int raw = analogRead(pins.currentPin);
    float voltage = (raw / ADC_MAX_COUNTS) * ADC_REFERENCE_V;
    if (!on) {
      currentZeroV = (currentZeroV * (1.0f - CURRENT_ZERO_TRACK_ALPHA)) + (voltage * CURRENT_ZERO_TRACK_ALPHA);
    }
    float amps = (voltage - currentZeroV) / currentSensitivityVPerA;
    // Suppress near-zero sensor jitter
    if (fabs(amps) < CURRENT_DEADBAND_A) amps = 0.0f;
    float absA = fabs(amps);
    if (!on && absA < CURRENT_ZERO_FORCE_A) absA = 0.0f;
    currentA = absA;
    return currentA;
  }

  void updateElectricalTelemetry(float measuredSupplyVoltageV) {
    ratedVoltageV = measuredSupplyVoltageV;
    readCurrentA();
    voltageV = measuredSupplyVoltageV;
    powerW = max(0.0f, fabs(currentA) * voltageV);
  }
};

LoadChannel motor1 = {"motor1", MOTOR1_PINS, 0, true};
LoadChannel motor2 = {"motor2", MOTOR2_PINS, 1, true};
LoadChannel light1 = {"lighting1", LIGHT1_PINS, 2, true};
LoadChannel light2 = {"lighting2", LIGHT2_PINS, 3, true};
LoadChannel heater1 = {"heater1", HEATER1_PINS, 255, false};
LoadChannel heater2 = {"heater2", HEATER2_PINS, 255, false};

