Omzlaw/iot-based-industrial-energy-monitoring-and-predictive-load-management-system/MSc Project/Arduino/esp32_digital_twin_controller/esp32_digital_twin_controller.ino
LoadChannel* loads[] = {&motor1, &motor2, &heater1, &heater2, &light1, &light2};
const size_t LOAD_COUNT = sizeof(loads) / sizeof(loads[0]);

// -----------------------------
// Ambient / sensor state
// -----------------------------
float ambientTempC = 24.0f;
float ambientHumidity = 55.0f;
float seasonTempOffsetC = 0.0f;
float seasonHumidityOffset = 0.0f;
bool ambientTempInitialized = false;
bool ambientHumidityInitialized = false;
bool tank1TempInitialized = false;
bool tank2TempInitialized = false;
uint8_t tank1TempInvalidCount = 0;
uint8_t tank2TempInvalidCount = 0;
static const unsigned long DHT_READ_INTERVAL_MS = 2000;
unsigned long lastDhtReadMs = 0;

float loadBusVoltageV = 11.9f;
float auxVoltageV = 0.0f;

DeviceAddress tankTempAddress1, tankTempAddress2;
bool tankTempSensor1Found = false;
bool tankTempSensor2Found = false;

// -----------------------------
// Utility
// -----------------------------
static inline void writeRelayState(uint8_t pin, bool on) {
  digitalWrite(pin, (on ^ RELAY_ACTIVE_LOW) ? HIGH : LOW);
}

static inline float clampf(float x, float lo, float hi) {
  return max(lo, min(hi, x));
}

const char* voltageInjectionModeToString(VoltageInjectionMode mode) {
  switch (mode) {
    case VOLTAGE_INJECTION_UNDERVOLTAGE: return "UNDERVOLTAGE";
    case VOLTAGE_INJECTION_OVERVOLTAGE: return "OVERVOLTAGE";
    default: return "NONE";
  }
}

bool parseVoltageInjectionMode(const String& input, VoltageInjectionMode& out) {
  String s = input;
  s.trim();
  s.toUpperCase();
  if (s == "UNDERVOLTAGE" || s == "UV" || s == "UNDER") {
    out = VOLTAGE_INJECTION_UNDERVOLTAGE;
    return true;
  }
  if (s == "OVERVOLTAGE" || s == "OV" || s == "OVER") {
    out = VOLTAGE_INJECTION_OVERVOLTAGE;
    return true;
  }
  if (s == "NONE" || s == "CLEAR" || s == "OFF") {
    out = VOLTAGE_INJECTION_NONE;
    return true;
  }
  return false;
}

static void clearVoltageInjection() {
  voltageInjectionMode = VOLTAGE_INJECTION_NONE;
  voltageInjectionMagnitudeV = 0.0f;
}

static float applyInjectedVoltageScenario(float measuredVoltageV) {
  if (isnan(measuredVoltageV)) return measuredVoltageV;
  const float magnitudeV = max(0.0f, voltageInjectionMagnitudeV);
  if (voltageInjectionMode == VOLTAGE_INJECTION_NONE || magnitudeV <= 0.0f) {
    return measuredVoltageV;
  }
  if (voltageInjectionMode == VOLTAGE_INJECTION_UNDERVOLTAGE) {
    return max(0.0f, measuredVoltageV - magnitudeV);
  }
  return measuredVoltageV + magnitudeV;
}

static inline float smoothBounded(float previous, float target, float alpha, float maxStep) {
  if (isnan(target)) return previous;
  if (isnan(previous)) return target;
  float bounded = target;
  if (maxStep > 0.0f) {
    bounded = clampf(target, previous - maxStep, previous + maxStep);
  }
  return previous + (bounded - previous) * clampf(alpha, 0.0f, 1.0f);
}

static inline bool isValidDs18Sample(float t) {
  if (isnan(t)) return false;
  if (t <= -126.0f || t >= 125.0f) return false; // disconnected/invalid markers
  if (fabs(t - 85.0f) < 0.05f) return false;     // DS18B20 power-on default
  return true;
}

static inline bool hasReachedTempTarget(float measuredC, float targetC) {
  if (isnan(measuredC) || isnan(targetC)) return false;
  return measuredC >= max(0.0f, targetC - PROCESS_TEMP_REACHED_TOL_C);
}

static inline float effectiveProcessTempTargetC(float baseTargetC) {
  const float cycleOffsetC = productionProcessEnabled
    ? ((float)processCycleCount * PROCESS_TEMP_TARGET_STEP_PER_CYCLE_C)
    : 0.0f;
  return clampf(baseTargetC + cycleOffsetC, 0.0f, 95.0f);
}

static inline float tank1EffectiveTempTargetC() {
  return effectiveProcessTempTargetC(TANK1_TEMP_TARGET_C);
}

static inline float tank2EffectiveTempTargetC() {
  return effectiveProcessTempTargetC(TANK2_TEMP_TARGET_C);
}

static inline float maxHighPctForHeight(float heightCm) {
  if (heightCm <= 0.0f) return 98.0f;
  const float blindPct = (ULTRASONIC_MIN_CM / heightCm) * 100.0f;
  return clampf(100.0f - blindPct, 20.0f, 98.0f);
}

static inline float clampLowPctForHeight(float lowPct, float heightCm) {
  const float maxBound = min(80.0f, maxHighPctForHeight(heightCm));
  return clampf(lowPct, 0.0f, maxBound);
}

static inline float clampHighPctForHeight(float highPct, float heightCm, float lowPct) {
  const float maxBound = maxHighPctForHeight(heightCm);
  const float minBound = max(20.0f, lowPct);
  return clampf(highPct, minBound, maxBound);
}

static bool processDemandsLoad(const LoadChannel* ld) {
  if (ld == nullptr || !productionProcessEnabled) return false;
  if (productionState == PROCESS_HEAT_TANK1) return ld == &heater1;
  if (productionState == PROCESS_TRANSFER_1_TO_2) return ld == &motor1;
  if (productionState == PROCESS_HEAT_TANK2) return ld == &heater2;
  if (productionState == PROCESS_TRANSFER_2_TO_1) return ld == &motor2;
  return false;
}

static bool isPolicyManagedLoad(const LoadChannel* ld) {
  return ld != nullptr && !ld->policyOverride;
}

void updateUndervoltageProtectionState(unsigned long nowMs) {
  if (UNDERVOLTAGE_THRESHOLD_V <= 0.0f || isnan(loadBusVoltageV)) {
    undervoltageActive = false;
    undervoltageLowSinceMs = 0;
    undervoltageRecoverSinceMs = 0;
    return;
  }

  const bool lowNow = loadBusVoltageV < UNDERVOLTAGE_THRESHOLD_V;
  const float restoreThresholdV = UNDERVOLTAGE_THRESHOLD_V + max(0.05f, UNDERVOLTAGE_RESTORE_MARGIN_V);

  if (lowNow) {
    undervoltageRecoverSinceMs = 0;
    if (undervoltageLowSinceMs == 0) undervoltageLowSinceMs = nowMs;
    if (!undervoltageActive && (nowMs - undervoltageLowSinceMs >= UNDERVOLTAGE_TRIP_DELAY_MS)) {
      undervoltageActive = true;
    }
    return;
  }

  undervoltageLowSinceMs = 0;
  if (!undervoltageActive) return;

  if (loadBusVoltageV >= restoreThresholdV) {
    if (undervoltageRecoverSinceMs == 0) undervoltageRecoverSinceMs = nowMs;
    if (nowMs - undervoltageRecoverSinceMs >= UNDERVOLTAGE_CLEAR_DELAY_MS) {
      undervoltageActive = false;
      undervoltageRecoverSinceMs = 0;
    }
  } else {
    undervoltageRecoverSinceMs = 0;
  }
}

void updateOvervoltageProtectionState(unsigned long nowMs) {
  if (OVERVOLTAGE_THRESHOLD_V <= 0.0f || isnan(loadBusVoltageV)) {
    overvoltageActive = false;
    overvoltageHighSinceMs = 0;
    overvoltageRecoverSinceMs = 0;
    return;
  }

  const bool highNow = loadBusVoltageV > OVERVOLTAGE_THRESHOLD_V;
  const float recoverThresholdV = OVERVOLTAGE_THRESHOLD_V - max(0.05f, OVERVOLTAGE_RESTORE_MARGIN_V);

