Omzlaw/iot-based-industrial-energy-monitoring-and-predictive-load-management-system/MSc Project/Arduino/esp32_digital_twin_controller/esp32_digital_twin_controller.ino
  if (highNow) {
    overvoltageRecoverSinceMs = 0;
    if (overvoltageHighSinceMs == 0) overvoltageHighSinceMs = nowMs;
    if (!overvoltageActive && (nowMs - overvoltageHighSinceMs >= OVERVOLTAGE_TRIP_DELAY_MS)) {
      overvoltageActive = true;
    }
    return;
  }

  overvoltageHighSinceMs = 0;
  if (!overvoltageActive) return;

  if (loadBusVoltageV <= recoverThresholdV) {
    if (overvoltageRecoverSinceMs == 0) overvoltageRecoverSinceMs = nowMs;
    if (nowMs - overvoltageRecoverSinceMs >= OVERVOLTAGE_CLEAR_DELAY_MS) {
      overvoltageActive = false;
      overvoltageRecoverSinceMs = 0;
    }
  } else {
    overvoltageRecoverSinceMs = 0;
  }
}

void updateOvercurrentFault(LoadChannel* ld, unsigned long nowMs) {
  if (ld == nullptr) return;
  const float currentA = ld->currentA;
  const float limitA = (ld->faultLimitA > 0.0f) ? ld->faultLimitA : LOAD_OVERCURRENT_LIMIT_A;
  const unsigned long tripDelayMs = (ld->faultTripDelayMs > 0) ? ld->faultTripDelayMs : OVERCURRENT_TRIP_DELAY_MS;
  const unsigned long clearDelayMs = (ld->faultClearDelayMs > 0) ? ld->faultClearDelayMs : OVERCURRENT_CLEAR_DELAY_MS;
  const unsigned long restoreDelayMs = (ld->faultRestoreDelayMs > 0) ? ld->faultRestoreDelayMs : OVERCURRENT_CLEAR_DELAY_MS;
  if (currentA >= limitA) {
    if (ld->overcurrentStartMs == 0) {
      ld->overcurrentStartMs = nowMs;
    }
    if (!ld->faultActive && (nowMs - ld->overcurrentStartMs >= tripDelayMs)) {
      ld->faultActive = true;
      ld->faultWasOn = ld->on;
      ld->faultLatched = false;
      ld->restorePending = false;
      ld->faultCode = "OVERCURRENT";
      ld->health = "FAULT";
      if (ld->on) {
        rememberDutyBeforeOff(ld);
      }
      ld->on = false;
      ld->duty = 0.0f;
      ld->appliedDuty = 0.0f;
      ld->lastDutyUpdateMs = nowMs;
      ld->applyHardware(nowMs);
      ld->faultClearStartMs = 0;
    }
  } else {
    ld->overcurrentStartMs = 0;
    if (ld->faultActive) {
      if (ld->faultLatched) {
        ld->faultClearStartMs = 0;
        return;
      }
      if (ld->faultInjectA > 0.0f) {
        ld->faultClearStartMs = 0;
        return;
      }
      if (ld->faultClearStartMs == 0) {
        ld->faultClearStartMs = nowMs;
      }
      if (nowMs - ld->faultClearStartMs >= clearDelayMs) {
        ld->faultActive = false;
        ld->faultCode = "NONE";
        ld->health = "OK";
        ld->faultClearStartMs = 0;
        const bool processDemand = (productionProcessEnabled && processDemandsLoad(ld));
        const bool allowRestore = (ld->faultWasOn || processDemand);
        if ((ld->faultWasOn || processDemand) && allowRestore) {
          ld->restorePending = true;
          ld->restoreAtMs = nowMs + restoreDelayMs;
          ld->on = false;
          ld->duty = 0.0f;
          ld->appliedDuty = 0.0f;
          ld->lastDutyUpdateMs = nowMs;
        } else {
          ld->restorePending = false;
          ld->on = false;
          ld->duty = 0.0f;
          ld->appliedDuty = 0.0f;
          ld->lastDutyUpdateMs = nowMs;
        }
      }
    } else {
      ld->faultClearStartMs = 0;
    }
  }

  if (!ld->faultActive && ld->restorePending && nowMs >= ld->restoreAtMs) {
    const bool processDemand = (productionProcessEnabled && processDemandsLoad(ld));
    const bool allowRestore = (ld->faultWasOn || processDemand);
    const float limitA = (ld->faultLimitA > 0.0f) ? ld->faultLimitA : LOAD_OVERCURRENT_LIMIT_A;
    const float predictedCurrentA = estimateRestoreCurrentA(ld);
    if (ld->faultInjectA > 0.0f) {
      ld->restoreAtMs = nowMs + 500;
      return;
    }
    if (limitA > 0.0f && predictedCurrentA >= limitA) {
      ld->restoreAtMs = nowMs + 1000;
      return;
    }
    if ((ld->faultWasOn || processDemand) && allowRestore) {
      ld->on = true;
      restoreDutyOn(ld);
    }
    ld->restorePending = false;
  }
}

static bool processConfigReady() {
  return processConfigGoalCyclesSet
    && processConfigTank1LevelSet
    && processConfigTank2LevelSet
    && processConfigTank1TempSet
    && processConfigTank2TempSet
    && predictorModeSet;
}

static String processConfigMissing() {
  String missing = "";
  if (!processConfigGoalCyclesSet) missing += "goal_cycles,";
  if (!processConfigTank1LevelSet) missing += "tank1_level_target_pct,";
  if (!processConfigTank2LevelSet) missing += "tank2_level_target_pct,";
  if (!processConfigTank1TempSet) missing += "tank1_temp_target_c,";
  if (!processConfigTank2TempSet) missing += "tank2_temp_target_c,";
  if (!predictorModeSet) missing += "predictor_mode,";
  if (missing.endsWith(",")) missing.remove(missing.length() - 1);
  return missing;
}
const char* productionStateToString(ProductionState s) {
  switch (s) {
    case PROCESS_HEAT_TANK1: return "HEAT_TANK1";
    case PROCESS_TRANSFER_1_TO_2: return "TRANSFER_1_TO_2";
    case PROCESS_HEAT_TANK2: return "HEAT_TANK2";
    case PROCESS_TRANSFER_2_TO_1: return "TRANSFER_2_TO_1";
    default: return "IDLE";
  }
}

bool parseProductionState(const String& input, ProductionState& out) {
  String s = input;
  s.trim();
  s.toUpperCase();
  if (s == "HEAT_TANK1") {
    out = PROCESS_HEAT_TANK1;
    return true;
  }
  if (s == "TRANSFER_1_TO_2") {
    out = PROCESS_TRANSFER_1_TO_2;
    return true;
  }
  if (s == "HEAT_TANK2") {
    out = PROCESS_HEAT_TANK2;
    return true;
  }
  if (s == "TRANSFER_2_TO_1") {
    out = PROCESS_TRANSFER_2_TO_1;
    return true;
  }
  if (s == "IDLE") {
    out = PROCESS_IDLE;
    return true;
  }
  return false;
}

float distanceToLevelPct(float distanceCm, float heightCm) {
  if (heightCm <= 0.1f) return 0.0f;
  float level = ((heightCm - distanceCm) / heightCm) * 100.0f;
  return clampf(level, 0.0f, 100.0f);
}

float levelToDistanceCm(float levelPct, float heightCm) {
  return max(0.0f, heightCm * (1.0f - clampf(levelPct, 0.0f, 100.0f) / 100.0f));
}

static inline float ultrasonicSoundSpeedCmPerUs() {
  // Temperature compensation improves distance accuracy vs fixed 0.0344 cm/us.
  float tempC = ambientTempC;
  if (isnan(tempC)) tempC = 20.0f;
  tempC = clampf(tempC, -10.0f, 60.0f);
  return (331.3f + (0.606f * tempC)) / 10000.0f;
}

bool readUltrasonicDistanceUartCm(HardwareSerial& port, float& distanceCm) {
  const unsigned long timeoutMs = 60;
  unsigned long startMs = millis();
  while ((millis() - startMs) < timeoutMs) {
    while (port.available() >= 4) {
      int header = port.read();
      if (header != 0xFF) continue;
      int high = port.read();
      int low = port.read();
      int checksum = port.read();
      uint8_t sum = (uint8_t)((0xFF + high + low) & 0xFF);
      if (sum != (uint8_t)checksum) {
        continue;
      }
      int distMm = (high << 8) | low;
      if (distMm <= 0) continue;
      distanceCm = distMm / 10.0f;
      return true;
    }
    delay(2);
  }
  return false;
}

static inline void triggerUltrasonicPulse(uint8_t trigPin) {
  // Generate trigger pulse (Mode 0 / HC-SR04 style).
  if (ULTRASONIC_TRIG_ACTIVE_HIGH) {
    digitalWrite(trigPin, LOW);
    delayMicroseconds(ULTRASONIC_TRIG_PREPULSE_US);
    digitalWrite(trigPin, HIGH);
    delayMicroseconds(ULTRASONIC_TRIG_PULSE_US);
    digitalWrite(trigPin, LOW);
  } else {
    digitalWrite(trigPin, HIGH);
    delayMicroseconds(ULTRASONIC_TRIG_PREPULSE_US);
    digitalWrite(trigPin, LOW);
    delayMicroseconds(ULTRASONIC_TRIG_PULSE_US);
    digitalWrite(trigPin, HIGH);
  }
}

// float readUltrasonicDistanceCm(uint8_t echoPin, uint8_t trigPin, unsigned long* pulseUsOut = nullptr) {
//   triggerUltrasonicPulse(trigPin);
//   unsigned long durationUs = pulseIn(echoPin, HIGH, ULTRASONIC_ECHO_TIMEOUT_US);
//   if (pulseUsOut) *pulseUsOut = durationUs;
//   if (durationUs == 0) return NAN;

//   float distance = (durationUs * 0.0344f) / 2.0f;
//   if (distance < ULTRASONIC_MIN_CM || distance > ULTRASONIC_MAX_CM) return NAN;
//   return distance;
// }
float readUltrasonicDistanceCm(uint8_t echoPin, uint8_t trigPin, unsigned long* pulseUsOut = nullptr) {
  // Re-assert pin modes every time (important when system is “busy”)
  pinMode(trigPin, OUTPUT);
  digitalWrite(trigPin, ULTRASONIC_TRIG_ACTIVE_HIGH ? LOW : HIGH);
  pinMode(echoPin, INPUT);

  // Let line settle a moment
  delayMicroseconds(5);

  triggerUltrasonicPulse(trigPin);

  // Use stable pulse measurement instead of pulseIn()
  unsigned long durationUs = pulseInStable(echoPin, HIGH, ULTRASONIC_ECHO_TIMEOUT_US);

