Omzlaw/iot-based-industrial-energy-monitoring-and-predictive-load-management-system/MSc Project/Arduino/esp32_digital_twin_controller/esp32_digital_twin_controller.ino
  if (pulseUsOut) *pulseUsOut = durationUs;
  if (durationUs == 0) return NAN;

  float distance = (durationUs * ultrasonicSoundSpeedCmPerUs()) / 2.0f;
  if (distance < ULTRASONIC_MIN_CM || distance > ULTRASONIC_MAX_CM) return NAN;
  return distance;
}

float readUltrasonicDistanceWithRetry(uint8_t echoPin, uint8_t trigPin, unsigned long* pulseUsOut = nullptr) {
  float validDistances[ULTRASONIC_RETRY_COUNT];
  unsigned long validPulses[ULTRASONIC_RETRY_COUNT];
  uint8_t validCount = 0;
  unsigned long lastPulse = 0;
  for (uint8_t attempt = 0; attempt < ULTRASONIC_RETRY_COUNT; ++attempt) {
    float distance = readUltrasonicDistanceCm(echoPin, trigPin, &lastPulse);
    if (!isnan(distance)) {
      if (validCount < ULTRASONIC_RETRY_COUNT) {
        validDistances[validCount] = distance;
        validPulses[validCount] = lastPulse;
        validCount++;
      }
    }
    if (attempt + 1 < ULTRASONIC_RETRY_COUNT) {
      delay(ULTRASONIC_RETRY_DELAY_MS);
    }
  }
  if (validCount > 0) {
    // Sort to get median valid sample (rejects spikes better than first-valid).
    for (uint8_t i = 0; i < validCount; ++i) {
      for (uint8_t j = i + 1; j < validCount; ++j) {
        if (validDistances[j] < validDistances[i]) {
          float d = validDistances[i];
          validDistances[i] = validDistances[j];
          validDistances[j] = d;
          unsigned long p = validPulses[i];
          validPulses[i] = validPulses[j];
          validPulses[j] = p;
        }
      }
    }
    uint8_t mid = validCount / 2;
    if (pulseUsOut) *pulseUsOut = validPulses[mid];
    return validDistances[mid];
  }
  if (pulseUsOut) *pulseUsOut = lastPulse;
  return NAN;
}

static inline float sanitizeUltrasonicDistanceCm(float rawCm) {
  if (isnan(rawCm)) return NAN;
  if (rawCm < ULTRASONIC_MIN_CM || rawCm > ULTRASONIC_MAX_CM) return NAN;
  return rawCm;
}

static inline float sanitizeUltrasonicDistanceForTankCm(float rawCm, float tankHeightCm) {
  float distanceCm = sanitizeUltrasonicDistanceCm(rawCm);
  if (isnan(distanceCm)) return NAN;
  if (tankHeightCm <= 0.0f) return distanceCm;
  const float tankMaxCm = min(ULTRASONIC_MAX_CM, max(ULTRASONIC_MIN_CM + 0.5f, tankHeightCm + ULTRASONIC_HEIGHT_MARGIN_CM));
  if (distanceCm > tankMaxCm) return NAN;
  return distanceCm;
}

static float medianFloatWindow(const float* values, uint8_t count) {
  if (count == 0) return NAN;
  float sorted[ULTRASONIC_POST_MEDIAN_WINDOW];
  for (uint8_t i = 0; i < count; ++i) sorted[i] = values[i];
  for (uint8_t i = 0; i < count; ++i) {
    for (uint8_t j = i + 1; j < count; ++j) {
      if (sorted[j] < sorted[i]) {
        float tmp = sorted[i];
        sorted[i] = sorted[j];
        sorted[j] = tmp;
      }
    }
  }
  return sorted[count / 2];
}

static float applyUltrasonicPostMedian(float value, float* buffer, uint8_t& count) {
  if (isnan(value)) return NAN;
  if (count < ULTRASONIC_POST_MEDIAN_WINDOW) {
    buffer[count++] = value;
  } else {
    for (uint8_t i = 0; i < ULTRASONIC_POST_MEDIAN_WINDOW - 1; ++i) {
      buffer[i] = buffer[i + 1];
    }
    buffer[ULTRASONIC_POST_MEDIAN_WINDOW - 1] = value;
  }
  return medianFloatWindow(buffer, count);
}

static int8_t expectedDistanceDirectionTank1() {
  if (!productionProcessEnabled) return 0;
  if (productionState == PROCESS_TRANSFER_1_TO_2) return 1;   // tank1 drains -> distance rises
  if (productionState == PROCESS_TRANSFER_2_TO_1) return -1;  // tank1 fills -> distance falls
  return 0;
}

static int8_t expectedDistanceDirectionTank2() {
  if (!productionProcessEnabled) return 0;
  if (productionState == PROCESS_TRANSFER_1_TO_2) return -1;  // tank2 fills -> distance falls
  if (productionState == PROCESS_TRANSFER_2_TO_1) return 1;   // tank2 drains -> distance rises
  return 0;
}

static bool transferPhaseActive() {
  return productionProcessEnabled
    && (productionState == PROCESS_TRANSFER_1_TO_2 || productionState == PROCESS_TRANSFER_2_TO_1);
}

static void updateUltrasonicPumpSettleWindow(unsigned long nowMs) {
  const bool pump12On = motor1.on;
  const bool pump21On = motor2.on;
  if (!ultrasonicPumpStateInitialized) {
    ultrasonicPumpStateInitialized = true;
    ultrasonicLastPump12On = pump12On;
    ultrasonicLastPump21On = pump21On;
    return;
  }
  if (pump12On != ultrasonicLastPump12On || pump21On != ultrasonicLastPump21On) {
    ultrasonicPumpSettleUntilMs = nowMs + ULTRASONIC_PUMP_SETTLE_MS;
    ultrasonicLastPump12On = pump12On;
    ultrasonicLastPump21On = pump21On;
  }
}

static float applyUltrasonicRateLimitCm(
  float valueCm,
  float previousCm,
  unsigned long& lastAcceptedMs,
  unsigned long nowMs,
  bool isTransferPhase
) {
  if (isnan(valueCm)) return previousCm;
  if (isnan(previousCm)) {
    lastAcceptedMs = nowMs;
    return valueCm;
  }

  float dtSec = 0.0f;
  if (lastAcceptedMs > 0 && nowMs >= lastAcceptedMs) {
    dtSec = (nowMs - lastAcceptedMs) / 1000.0f;
  }
  if (dtSec <= 0.0f) dtSec = max(0.05f, SAMPLE_INTERVAL_SEC);

  const float rateCmPerSec = isTransferPhase ? ULTRASONIC_MAX_RATE_TRANSFER_CM_PER_SEC : ULTRASONIC_MAX_RATE_IDLE_CM_PER_SEC;
  const float maxStep = max(0.05f, rateCmPerSec * dtSec);
  const float delta = valueCm - previousCm;
  const float limited = previousCm + clampf(delta, -maxStep, maxStep);
  lastAcceptedMs = nowMs;
  return limited;
}

static float stabilizeUltrasonicDistanceCm(float rawCm, float previousCm, float tankHeightCm, int8_t expectedDirection) {
  if (isnan(rawCm)) return previousCm;
  if (isnan(previousCm)) return rawCm;

  // Prevent one-shot jumps from immediately distorting tank level.
  float maxStep = min(ULTRASONIC_MAX_STEP_CM, max(2.0f, tankHeightCm * 0.5f));
  float delta = rawCm - previousCm;
  float jitterBand = (expectedDirection != 0)
    ? max(ULTRASONIC_JITTER_BAND_CM, ULTRASONIC_TRANSFER_JITTER_BAND_CM)
    : ULTRASONIC_JITTER_BAND_CM;
  if (fabs(delta) <= jitterBand) {
    return previousCm;
  }
  if (fabs(delta) > maxStep) {
    delta = (delta > 0.0f ? maxStep : -maxStep);
    rawCm = previousCm + delta;
  }

  float alpha = ULTRASONIC_EMA_ALPHA;
  if (expectedDirection == 0 && fabs(delta) >= ULTRASONIC_FAST_DELTA_CM && alpha < ULTRASONIC_FAST_ALPHA) {
    alpha = ULTRASONIC_FAST_ALPHA;
  }
  // During transfer, reject/strongly damp brief reverse jumps caused by turbulence.
  if (expectedDirection != 0) {
    bool reverse = (expectedDirection > 0) ? (delta < -ULTRASONIC_TRANSFER_REVERSE_TOL_CM)
                                           : (delta > ULTRASONIC_TRANSFER_REVERSE_TOL_CM);
    if (reverse) {
      if (expectedDirection > 0) {
        delta = max(delta, -ULTRASONIC_TRANSFER_MAX_REVERSE_STEP_CM);
      } else {
        delta = min(delta, ULTRASONIC_TRANSFER_MAX_REVERSE_STEP_CM);
      }
      rawCm = previousCm + delta;
      alpha = ULTRASONIC_TRANSFER_ALPHA_REVERSE;
    } else {
      alpha = max(alpha, ULTRASONIC_TRANSFER_ALPHA_FORWARD);
    }
  }

  return previousCm + (rawCm - previousCm) * alpha;
}

void measureTankLevelsFromUltrasonic() {
  const unsigned long nowMs = millis();
  updateUltrasonicPumpSettleWindow(nowMs);

  // Hold last stable value briefly when pump states change (relay bounce/turbulence window).
  if (nowMs < ultrasonicPumpSettleUntilMs) {
    if (!isnan(lastTank1DistanceCm)) {
      tank1DistanceCm = lastTank1DistanceCm;
      tank1LevelPct = distanceToLevelPct(tank1DistanceCm, TANK1_HEIGHT_CM);
      tank1LevelValid = true;
    }
    if (!isnan(lastTank2DistanceCm)) {
      tank2DistanceCm = lastTank2DistanceCm;
      tank2LevelPct = distanceToLevelPct(tank2DistanceCm, TANK2_HEIGHT_CM);
      tank2LevelValid = true;
    }
    return;
  }

  float d1 = NAN;
  float d2 = NAN;
  static bool readTank1First = true;
  if (ULTRASONIC_UART_MODE) {
    float cm = NAN;
    if (readUltrasonicDistanceUartCm(UltrasonicSerial1, cm)) d1 = cm;
    cm = NAN;
    if (readUltrasonicDistanceUartCm(UltrasonicSerial2, cm)) d2 = cm;
  } else {
    unsigned long pulse1 = 0;
    unsigned long pulse2 = 0;
    if (readTank1First) {
      d1 = readUltrasonicDistanceWithRetry(ULTRASONIC_TANK1_ECHO_PIN, ULTRASONIC_TANK1_TRIG_PIN, &pulse1);
      delay(ULTRASONIC_INTER_SENSOR_DELAY_MS);
      d2 = readUltrasonicDistanceWithRetry(ULTRASONIC_TANK2_ECHO_PIN, ULTRASONIC_TANK2_TRIG_PIN, &pulse2);
    } else {
      d2 = readUltrasonicDistanceWithRetry(ULTRASONIC_TANK2_ECHO_PIN, ULTRASONIC_TANK2_TRIG_PIN, &pulse2);
      delay(ULTRASONIC_INTER_SENSOR_DELAY_MS);
      d1 = readUltrasonicDistanceWithRetry(ULTRASONIC_TANK1_ECHO_PIN, ULTRASONIC_TANK1_TRIG_PIN, &pulse1);
    }
    readTank1First = !readTank1First;
    Serial.printf("[ultra] tank1 pulse=%lu us dist=%.2fcm miss=%u | tank2 pulse=%lu us dist=%.2fcm miss=%u\n",
                  pulse1, isnan(d1) ? -1.0f : d1, tank1UltrasonicMissCount,
                  pulse2, isnan(d2) ? -1.0f : d2, tank2UltrasonicMissCount);
  }
  // Raw sensor-reported distance before tank-height gating and level conversion.
  tank1RawDistanceCm = d1;
  tank2RawDistanceCm = d2;
  d1 = sanitizeUltrasonicDistanceForTankCm(d1, TANK1_HEIGHT_CM);
  d2 = sanitizeUltrasonicDistanceForTankCm(d2, TANK2_HEIGHT_CM);
  const bool transferPhase = transferPhaseActive();
  if (!isnan(d1)) {
    float stable1 = stabilizeUltrasonicDistanceCm(d1, lastTank1DistanceCm, TANK1_HEIGHT_CM, expectedDistanceDirectionTank1());
    float smoothed1 = applyUltrasonicPostMedian(stable1, tank1DistanceMedianBuf, tank1DistanceMedianCount);
    float limited1 = applyUltrasonicRateLimitCm(smoothed1, lastTank1DistanceCm, tank1LastDistanceAcceptedMs, nowMs, transferPhase);
    tank1DistanceCm = limited1;
    lastTank1DistanceCm = limited1;
    tank1UltrasonicMissCount = 0;
    tank1LevelValid = true;
  } else if (!isnan(lastTank1DistanceCm) && tank1UltrasonicMissCount < ULTRASONIC_MAX_CONSECUTIVE_MISSES) {
    tank1UltrasonicMissCount++;
    tank1DistanceCm = lastTank1DistanceCm;
    tank1LevelValid = true;
  } else {
    tank1UltrasonicMissCount = ULTRASONIC_MAX_CONSECUTIVE_MISSES;
    tank1DistanceCm = NAN;
    tank1LevelPct = 0.0f;
    tank1LevelValid = false;
    tank1DistanceMedianCount = 0;
    lastTank1DistanceCm = NAN;
    tank1LastDistanceAcceptedMs = 0;
  }

  if (tank1LevelValid && !isnan(tank1DistanceCm)) {
    tank1LevelPct = distanceToLevelPct(tank1DistanceCm, TANK1_HEIGHT_CM);
  }

  if (!isnan(d2)) {
    float stable2 = stabilizeUltrasonicDistanceCm(d2, lastTank2DistanceCm, TANK2_HEIGHT_CM, expectedDistanceDirectionTank2());
    float smoothed2 = applyUltrasonicPostMedian(stable2, tank2DistanceMedianBuf, tank2DistanceMedianCount);
    float limited2 = applyUltrasonicRateLimitCm(smoothed2, lastTank2DistanceCm, tank2LastDistanceAcceptedMs, nowMs, transferPhase);
    tank2DistanceCm = limited2;
    lastTank2DistanceCm = limited2;
    tank2UltrasonicMissCount = 0;
    tank2LevelValid = true;
  } else if (!isnan(lastTank2DistanceCm) && tank2UltrasonicMissCount < ULTRASONIC_MAX_CONSECUTIVE_MISSES) {
    tank2UltrasonicMissCount++;
    tank2DistanceCm = lastTank2DistanceCm;
    tank2LevelValid = true;
  } else {
    tank2UltrasonicMissCount = ULTRASONIC_MAX_CONSECUTIVE_MISSES;
    tank2DistanceCm = NAN;
    tank2LevelPct = 0.0f;
    tank2LevelValid = false;
    tank2DistanceMedianCount = 0;
    lastTank2DistanceCm = NAN;
    tank2LastDistanceAcceptedMs = 0;
  }

  if (tank2LevelValid && !isnan(tank2DistanceCm)) {
    tank2LevelPct = distanceToLevelPct(tank2DistanceCm, TANK2_HEIGHT_CM);
  }
}

void setProcessActuators(bool pump12On, bool pump21On, bool heater1On, bool heater2On) {
  if (!pump12On && motor1.on) rememberDutyBeforeOff(&motor1);
  motor1.on = pump12On;
  motor1.duty = pump12On ? 1.0f : 0.0f;
  if (!pump21On && motor2.on) rememberDutyBeforeOff(&motor2);
  motor2.on = pump21On;
  motor2.duty = pump21On ? 1.0f : 0.0f;
  if (!heater1On && heater1.on) rememberDutyBeforeOff(&heater1);
  heater1.on = heater1On;
  heater1.duty = heater1On ? 1.0f : 0.0f;
  if (!heater2On && heater2.on) rememberDutyBeforeOff(&heater2);
  heater2.on = heater2On;
  heater2.duty = heater2On ? 1.0f : 0.0f;
}

