Omzlaw/iot-based-industrial-energy-monitoring-and-predictive-load-management-system/MSc Project/Arduino/esp32_digital_twin_controller/esp32_digital_twin_controller.ino
void applyProductionProcess(float dtSec) {
  if (!productionProcessEnabled) return;
  const float tank1TargetC = tank1EffectiveTempTargetC();
  const float tank2TargetC = tank2EffectiveTempTargetC();

  // Transition state machine.
  if (productionState == PROCESS_HEAT_TANK1) {
    // Heat phases should transition on temperature; level is handled in transfer phases.
    if (hasReachedTempTarget(tank1TempC, tank1TargetC)) {
      productionState = PROCESS_TRANSFER_1_TO_2;
    }
  } else if (productionState == PROCESS_TRANSFER_1_TO_2) {
    if (tank2LevelPct >= min(TANK2_LEVEL_TARGET_PCT, TANK2_HIGH_LEVEL_PCT)
        || tank1LevelPct <= TANK1_LOW_LEVEL_PCT) {
      productionState = PROCESS_HEAT_TANK2;
    }
  } else if (productionState == PROCESS_HEAT_TANK2) {
    // Heat phases should transition on temperature; level is handled in transfer phases.
    if (hasReachedTempTarget(tank2TempC, tank2TargetC)) {
      productionState = PROCESS_TRANSFER_2_TO_1;
    }
  } else if (productionState == PROCESS_TRANSFER_2_TO_1) {
    if (tank1LevelPct >= min(TANK1_LEVEL_TARGET_PCT, TANK1_HIGH_LEVEL_PCT)
        || tank2LevelPct <= TANK2_LOW_LEVEL_PCT) {
      productionState = PROCESS_HEAT_TANK1;
      processCycleCount++;
    }
  }

  // Enforce actuator sequence while active.
  if (productionState == PROCESS_HEAT_TANK1) {
    setProcessActuators(false, false, true, false);
  } else if (productionState == PROCESS_TRANSFER_1_TO_2) {
    setProcessActuators(true, false, false, false);
  } else if (productionState == PROCESS_HEAT_TANK2) {
    setProcessActuators(false, false, false, true);
  } else if (productionState == PROCESS_TRANSFER_2_TO_1) {
    setProcessActuators(false, true, false, false);
  } else {
    setProcessActuators(false, false, false, false);
  }

  // Fallback thermal model only when a DS18B20 sensor is missing for that tank.
  if (SIMULATE_TANK_TEMPS_WHEN_SENSOR_MISSING) {
    if (!tankTempSensor1Found) {
      if (heater1.on) tank1TempC += TANK_HEAT_RATE_C_PER_SEC * dtSec;
      tank1TempC += (ambientTempC - tank1TempC) * TANK_COOL_RATE_PER_SEC * dtSec;
    }
    if (!tankTempSensor2Found) {
      if (heater2.on) tank2TempC += TANK_HEAT_RATE_C_PER_SEC * dtSec;
      tank2TempC += (ambientTempC - tank2TempC) * TANK_COOL_RATE_PER_SEC * dtSec;
    }
  }
}

void setRuntimeConfigDefaults() {
  runtimeConfig.wifiSsid = DEFAULT_WIFI_SSID;
  runtimeConfig.wifiPassword = DEFAULT_WIFI_PASSWORD;
  runtimeConfig.mqttHost = DEFAULT_MQTT_BROKER_HOST;
  runtimeConfig.mqttPort = DEFAULT_MQTT_BROKER_PORT;
  runtimeConfig.mqttUsername = DEFAULT_MQTT_USERNAME;
  runtimeConfig.mqttPassword = DEFAULT_MQTT_PASSWORD;
}

void loadRuntimeConfigFromNvs() {
  setRuntimeConfigDefaults();
  if (!preferences.begin(PREFERENCES_NAMESPACE, true)) {
    Serial.println("[config] preferences open failed (read mode), using defaults");
    return;
  }

  runtimeConfig.wifiSsid = preferences.getString("wifi_ssid", runtimeConfig.wifiSsid);
  runtimeConfig.wifiPassword = preferences.getString("wifi_pass", runtimeConfig.wifiPassword);
  runtimeConfig.mqttHost = preferences.getString("mqtt_host", runtimeConfig.mqttHost);
  runtimeConfig.mqttPort = preferences.getUShort("mqtt_port", runtimeConfig.mqttPort);
  runtimeConfig.mqttUsername = preferences.getString("mqtt_user", runtimeConfig.mqttUsername);
  runtimeConfig.mqttPassword = preferences.getString("mqtt_pass", runtimeConfig.mqttPassword);
  preferences.end();
}

void saveRuntimeConfigToNvs() {
  if (!preferences.begin(PREFERENCES_NAMESPACE, false)) {
    Serial.println("[config] preferences open failed (write mode), config not saved");
    return;
  }

  preferences.putString("wifi_ssid", runtimeConfig.wifiSsid);
  preferences.putString("wifi_pass", runtimeConfig.wifiPassword);
  preferences.putString("mqtt_host", runtimeConfig.mqttHost);
  preferences.putUShort("mqtt_port", runtimeConfig.mqttPort);
  preferences.putString("mqtt_user", runtimeConfig.mqttUsername);
  preferences.putString("mqtt_pass", runtimeConfig.mqttPassword);
  preferences.end();
}

bool runtimeConfigLooksUsable() {
  if (runtimeConfig.wifiSsid.length() == 0 || runtimeConfig.wifiSsid == "YOUR_WIFI_SSID") return false;
  if (runtimeConfig.mqttHost.length() == 0) return false;
  if (runtimeConfig.mqttPort == 0) return false;
  return true;
}

String readSerialLineWithTimeout(unsigned long timeoutMs) {
  String line;
  unsigned long startMs = millis();
  while ((millis() - startMs) < timeoutMs) {
    while (Serial.available()) {
      char c = (char)Serial.read();
      if (c == '\r') continue;
      if (c == '\n') return line;
      line += c;
    }
    delay(10);
  }
  return line;
}

String promptConfigText(const char* label, const String& currentValue, bool hideCurrent) {
  String shown = hideCurrent ? (currentValue.length() > 0 ? "********" : "<empty>") : currentValue;
  Serial.printf("%s [%s]: ", label, shown.c_str());
  String in = readSerialLineWithTimeout(SERIAL_INPUT_TIMEOUT_MS);
  in.trim();
  if (in.length() == 0) return currentValue;
  return in;
}

uint16_t promptConfigPort(const char* label, uint16_t currentPort) {
  Serial.printf("%s [%u]: ", label, (unsigned int)currentPort);
  String in = readSerialLineWithTimeout(SERIAL_INPUT_TIMEOUT_MS);
  in.trim();
  if (in.length() == 0) return currentPort;
  long p = in.toInt();
  if (p < 1 || p > 65535) {
    Serial.println("[config] invalid port, keeping current value");
    return currentPort;
  }
  return (uint16_t)p;
}

bool serialConfigRequestedByUser() {
  Serial.println();
  Serial.printf("[config] press 'c' + Enter within %lus to edit WiFi/MQTT settings\n",
                STARTUP_CONFIG_WINDOW_MS / 1000UL);
  unsigned long startMs = millis();
  while ((millis() - startMs) < STARTUP_CONFIG_WINDOW_MS) {
    if (Serial.available()) {
      String in = readSerialLineWithTimeout(500);
      in.trim();
      in.toLowerCase();
      if (in == "c" || in == "config") return true;
      return false;
    }
    delay(20);
  }
  return false;
}

void runStartupConfigWizard() {
  bool forceSetup = !runtimeConfigLooksUsable();
  bool runWizard = forceSetup || serialConfigRequestedByUser();
  if (!runWizard) return;

  Serial.println("[config] entering startup configuration");
  runtimeConfig.wifiSsid = promptConfigText("WiFi SSID", runtimeConfig.wifiSsid, false);
  runtimeConfig.wifiPassword = promptConfigText("WiFi Password", runtimeConfig.wifiPassword, true);
  runtimeConfig.mqttHost = promptConfigText("MQTT Broker Host", runtimeConfig.mqttHost, false);
  runtimeConfig.mqttPort = promptConfigPort("MQTT Broker Port", runtimeConfig.mqttPort);
  runtimeConfig.mqttUsername = promptConfigText("MQTT Username", runtimeConfig.mqttUsername, false);
  runtimeConfig.mqttPassword = promptConfigText("MQTT Password", runtimeConfig.mqttPassword, true);

  saveRuntimeConfigToNvs();
  Serial.println("[config] settings saved to NVS");
}

