Omzlaw/iot-based-industrial-energy-monitoring-and-predictive-load-management-system/MSc Project/Arduino/esp32_digital_twin_controller/esp32_digital_twin_controller.ino
void registerControlAction();
void registerControlActionTyped(const char* actionType);

String predictionSourceToString(PredictionInputSource src) {
  switch (src) {
    case PRED_SRC_LONG_RF: return "LONG_RF";
    case PRED_SRC_LONG_LSTM: return "LONG_LSTM";
    default: return "SHORT";
  }
}

const char* predictionSourceKey(PredictionInputSource src) {
  switch (src) {
    case PRED_SRC_LONG_RF: return "long_rf";
    case PRED_SRC_LONG_LSTM: return "long_lstm";
    default: return "short";
  }
}

static int predictionSourceIndex(PredictionInputSource src) {
  switch (src) {
    case PRED_SRC_LONG_RF: return 1;
    case PRED_SRC_LONG_LSTM: return 2;
    default: return 0;
  }
}

static PredictionChannelState& predictionStateFor(PredictionInputSource src) {
  return predictionStateBySource[predictionSourceIndex(src)];
}

static const PredictionChannelState& predictionStateForConst(PredictionInputSource src) {
  return predictionStateBySource[predictionSourceIndex(src)];
}

static bool predictionSourceSupportsDynamicProcess(PredictionInputSource src) {
  return src == PRED_SRC_LONG_RF || src == PRED_SRC_LONG_LSTM;
}

static bool predictionStateIsFresh(const PredictionChannelState& state, unsigned long nowMs) {
  if (!state.applied || state.lastAppliedMs == 0) return false;
  return (nowMs - state.lastAppliedMs) <= AI_DYNAMIC_PREDICTION_STALE_MS;
}

static int riskLevelWeight(const String& level) {
  String upper = level;
  upper.toUpperCase();
  if (upper == "HIGH") return 2;
  if (upper == "MEDIUM") return 1;
  return 0;
}

static bool suggestionTargetsProcessLoad(const AISuggestion& s) {
  return s.deviceName == "motor1"
    || s.deviceName == "motor2"
    || s.deviceName == "heater1"
    || s.deviceName == "heater2";
}

static bool predictionStateHasProcessPlan(const PredictionChannelState& state) {
  for (int i = 0; i < state.suggestionCount; ++i) {
    const AISuggestion& s = state.suggestions[i];
    if (s.hasProcessMode || suggestionTargetsProcessLoad(s)) return true;
  }
  return false;
}

static bool predictionStateSupportsProcessPlanning(PredictionInputSource src,
                                                   const PredictionChannelState& state,
                                                   unsigned long nowMs) {
  if (!predictionSourceSupportsDynamicProcess(src)) return false;
  if (!predictionStateIsFresh(state, nowMs)) return false;
  if (state.sourceMode != "ONLINE") return false;
  if (!state.sourceModelReady) return false;
  if (state.suggestionCount <= 0) return false;
  return predictionStateHasProcessPlan(state);
}

static const PredictionChannelState* selectDynamicProcessPredictionState(PredictionInputSource* srcOut = nullptr,
                                                                         String* reasonOut = nullptr) {
  const unsigned long nowMs = millis();
  const PredictionChannelState& lstmState = predictionStateForConst(PRED_SRC_LONG_LSTM);
  const PredictionChannelState& rfState = predictionStateForConst(PRED_SRC_LONG_RF);

  if (predictionStateSupportsProcessPlanning(PRED_SRC_LONG_LSTM, lstmState, nowMs)) {
    if (srcOut != nullptr) *srcOut = PRED_SRC_LONG_LSTM;
    if (reasonOut != nullptr) *reasonOut = "ready";
    return &lstmState;
  }
  if (predictionStateSupportsProcessPlanning(PRED_SRC_LONG_RF, rfState, nowMs)) {
    if (srcOut != nullptr) *srcOut = PRED_SRC_LONG_RF;
    if (reasonOut != nullptr) *reasonOut = "ready";
    return &rfState;
  }

  if (srcOut != nullptr) *srcOut = PRED_SRC_LONG_RF;
  if (reasonOut == nullptr) return nullptr;

  if (lstmState.sourceMode != "ONLINE" && rfState.sourceMode != "ONLINE") {
    *reasonOut = "predictor_not_online";
  } else if (!lstmState.sourceModelReady && !rfState.sourceModelReady) {
    *reasonOut = "predictor_not_trained";
  } else if (!predictionStateIsFresh(lstmState, nowMs) && !predictionStateIsFresh(rfState, nowMs)) {
    *reasonOut = "prediction_stale";
  } else if (lstmState.suggestionCount <= 0 && rfState.suggestionCount <= 0) {
    *reasonOut = "no_suggestions";
  } else {
    *reasonOut = "no_process_plan";
  }
  return nullptr;
}

static String activePredictionSourcesSummary() {
  String summary = "";
  const unsigned long nowMs = millis();
  for (int idx = 0; idx < PREDICTION_SOURCE_COUNT; ++idx) {
    PredictionInputSource src = (idx == 1) ? PRED_SRC_LONG_RF : ((idx == 2) ? PRED_SRC_LONG_LSTM : PRED_SRC_SHORT);
    const PredictionChannelState& state = predictionStateForConst(src);
    if (!predictionStateIsFresh(state, nowMs)) continue;
    if (summary.length() > 0) summary += "+";
    summary += predictionSourceToString(src);
  }
  if (summary.length() == 0) return "NONE";
  return summary;
}

static void rebuildFusedPredictionState() {
  const unsigned long nowMs = millis();
  predictorPeakRisk = false;
  predictorRiskLevel = "LOW";
  predictorPowerW = 0.0f;
  predictorHorizonSec = 0.0f;
  predictorSourceTimestampSec = 0.0;
  predictorSourceMode = "FUSED";
  predictorSourceModelReady = false;
  predictorLastAppliedMs = 0;
  aiSuggestionCount = 0;

  String usedDevices[MAX_AI_SUGGESTIONS];
  int usedDeviceCount = 0;

  const PredictionInputSource sourceOrder[PREDICTION_SOURCE_COUNT] = {
    PRED_SRC_SHORT,
    PRED_SRC_LONG_RF,
    PRED_SRC_LONG_LSTM,
  };

  for (int idx = 0; idx < PREDICTION_SOURCE_COUNT; ++idx) {
    const PredictionInputSource src = sourceOrder[idx];
    const PredictionChannelState& state = predictionStateForConst(src);
    if (!predictionStateIsFresh(state, nowMs)) continue;

    predictorPeakRisk = predictorPeakRisk || state.peakRisk;
    if (riskLevelWeight(state.riskLevel) > riskLevelWeight(predictorRiskLevel)) {
      predictorRiskLevel = state.riskLevel;
    }
    if (state.powerW >= predictorPowerW) {
      predictorPowerW = state.powerW;
      predictorHorizonSec = state.horizonSec;
    }
    predictorSourceTimestampSec = max(predictorSourceTimestampSec, state.sourceTimestampSec);
    predictorSourceModelReady = predictorSourceModelReady || state.sourceModelReady;
    predictorLastAppliedMs = max(predictorLastAppliedMs, state.lastAppliedMs);

    for (int i = 0; i < state.suggestionCount; ++i) {
      if (aiSuggestionCount >= MAX_AI_SUGGESTIONS) break;
      const AISuggestion& suggestion = state.suggestions[i];
      bool seenDevice = false;
      for (int j = 0; j < usedDeviceCount; ++j) {
        if (usedDevices[j] == suggestion.deviceName) {
          seenDevice = true;
          break;
        }
      }
      if (seenDevice) continue;
      aiSuggestions[aiSuggestionCount++] = suggestion;
      if (usedDeviceCount < MAX_AI_SUGGESTIONS) {
        usedDevices[usedDeviceCount++] = suggestion.deviceName;
      }
    }
  }
}

