Omzlaw/iot-based-industrial-energy-monitoring-and-predictive-load-management-system/MSc Project/Arduino/esp32_digital_twin_controller/esp32_digital_twin_controller.ino
bool isAiDynamicProcessAvailable(String* reasonOut = nullptr) {
  PredictionInputSource selectedSrc = PRED_SRC_LONG_RF;
  return selectDynamicProcessPredictionState(&selectedSrc, reasonOut) != nullptr;
}

bool isAiDynamicProcessReady(String* reasonOut = nullptr) {
  if (!(controlPolicy == POLICY_AI_PREFERRED || controlPolicy == POLICY_HYBRID)) {
    if (reasonOut != nullptr) *reasonOut = "policy_not_ai";
    return false;
  }
  return isAiDynamicProcessAvailable(reasonOut);
}

String controlPolicyToString(ControlPolicy p) {
  switch (p) {
    case POLICY_RULE_ONLY: return "RULE_ONLY";
    case POLICY_AI_PREFERRED: return "AI_PREFERRED";
    case POLICY_NO_ENERGY_MANAGEMENT: return "NO_ENERGY_MANAGEMENT";
    default: return "HYBRID";
  }
}

String plantModeToString(PlantMode m) {
  switch (m) {
    case PLANT_HIGH_PROD: return "HIGH_PROD";
    case PLANT_LOW_PROD: return "LOW_PROD";
    case PLANT_ENERGY_SAVING: return "ENERGY_SAVING";
    default: return "NORMAL";
  }
}

String seasonModeToString(SeasonMode s) {
  switch (s) {
    case SEASON_SUMMER: return "SUMMER";
    case SEASON_WINTER: return "WINTER";
    case SEASON_SPRING: return "SPRING";
    case SEASON_AUTUMN: return "AUTUMN";
    default: return "DEFAULT";
  }
}

PlantMode plantModeFromString(const String& input) {
  String s = input;
  s.toUpperCase();
  if (s == "HIGH_PROD") return PLANT_HIGH_PROD;
  if (s == "LOW_PROD") return PLANT_LOW_PROD;
  if (s == "ENERGY_SAVING") return PLANT_ENERGY_SAVING;
  return PLANT_NORMAL;
}

SeasonMode seasonModeFromString(const String& input) {
  String s = input;
  s.toUpperCase();
  if (s == "SUMMER") return SEASON_SUMMER;
  if (s == "WINTER") return SEASON_WINTER;
  if (s == "SPRING") return SEASON_SPRING;
  if (s == "AUTUMN") return SEASON_AUTUMN;
  return SEASON_DEFAULT;
}

ControlPolicy controlPolicyFromString(const String& input) {
  String s = input;
  s.toUpperCase();
  if (s == "RULE_ONLY") return POLICY_RULE_ONLY;
  if (s == "AI_PREFERRED") return POLICY_AI_PREFERRED;
  if (s == "NO_ENERGY_MANAGEMENT") return POLICY_NO_ENERGY_MANAGEMENT;
  return POLICY_HYBRID;
}

String loadClassToString(LoadClass c) {
  switch (c) {
    case CLASS_CRITICAL: return "CRITICAL";
    case CLASS_ESSENTIAL: return "ESSENTIAL";
    case CLASS_IMPORTANT: return "IMPORTANT";
    case CLASS_SECONDARY: return "SECONDARY";
    default: return "NON_ESSENTIAL";
  }
}

LoadClass parseLoadClass(const String& s) {
  String u = s; u.toUpperCase();
  if (u == "CRITICAL") return CLASS_CRITICAL;
  if (u == "ESSENTIAL") return CLASS_ESSENTIAL;
  if (u == "IMPORTANT") return CLASS_IMPORTANT;
  if (u == "SECONDARY") return CLASS_SECONDARY;
  return CLASS_NON_ESSENTIAL;
}

void rememberDutyBeforeOff(LoadChannel* ld) {
  if (ld == nullptr) return;
  ld->lastDuty = ld->hasPwm ? clampf(ld->duty, 0.0f, 1.0f) : (ld->on ? 1.0f : 0.0f);
}

void restoreDutyOn(LoadChannel* ld) {
  if (ld == nullptr) return;
  if (!ld->hasPwm) {
    ld->duty = (ld->lastDuty > 0.0f) ? 1.0f : 0.0f;
    return;
  }
  float minDuty = (ld->loadClass == CLASS_CRITICAL) ? CRITICAL_MIN_DEVICE_DUTY : MIN_DEVICE_DUTY;
  float restored = clampf(ld->lastDuty, 0.0f, 1.0f);
  if (restored < minDuty) restored = minDuty;
  ld->duty = restored;
}

void forceAllLoadsOff(bool rememberLastDuty) {
  for (size_t i = 0; i < LOAD_COUNT; ++i) {
    LoadChannel* ld = loads[i];
    if (rememberLastDuty && ld->on) {
      rememberDutyBeforeOff(ld);
    }
    ld->on = false;
    ld->duty = 0.0f;
  }
}

static bool isProcessLoad(const LoadChannel* ld) {
  return ld == &motor1 || ld == &motor2 || ld == &heater1 || ld == &heater2;
}

static bool loadSupportsDutyControl(const LoadChannel* ld) {
  return ld != nullptr && ld->hasPwm;
}

static float sanitizeDutyForLoad(const LoadChannel* ld, float duty) {
  const float clipped = clampf(duty, 0.0f, 1.0f);
  if (!loadSupportsDutyControl(ld)) {
    return (clipped > 0.0f) ? 1.0f : 0.0f;
  }
  return clipped;
}

static bool heaterBlockedByAmbient(const LoadChannel* ld) {
  if (ld == nullptr) return false;
  if (productionProcessEnabled) return false;
  if (ld != &heater1 && ld != &heater2) return false;
  if (isnan(ambientTempC)) return false;
  return ambientTempC >= HEATER_WARM_TEMP_C;
}

static bool isHybridPolicy() {
  return controlPolicy == POLICY_HYBRID;
}

static bool isAiPreferredPolicy() {
  return controlPolicy == POLICY_AI_PREFERRED;
}

static bool isAiDrivenPolicy() {
  return isAiPreferredPolicy() || isHybridPolicy();
}

static bool isEnergyGoalWindowAtRisk(float ratio = 0.95f) {
  return (MAX_ENERGY_CONSUMPTION_FOR_THR_DAY_WH > 0.0f)
      && (getCurrentEnergyGoalWindowWh() >= (MAX_ENERGY_CONSUMPTION_FOR_THR_DAY_WH * ratio));
}

static bool shouldApplyAiProcessOverrides() {
  if (isAiPreferredPolicy()) return true;
  if (!isHybridPolicy()) return false;
  return predictorPeakRisk || isEnergyGoalWindowAtRisk(0.95f);
}

void applyAiProcessOverridesFromSuggestions() {
  if (!productionProcessEnabled) return;
  if (!isAiDrivenPolicy()) return;
  if (!shouldApplyAiProcessOverrides()) return;
  PredictionInputSource selectedSrc = PRED_SRC_LONG_RF;
  String reason;
  const PredictionChannelState* selectedState = selectDynamicProcessPredictionState(&selectedSrc, &reason);
  if (selectedState == nullptr) return;

  bool hasProcessPlan = false;
  bool hasSuggestedMode = false;
  ProductionState suggestedMode = productionState;
  for (int i = 0; i < selectedState->suggestionCount; ++i) {
    const AISuggestion& s = selectedState->suggestions[i];
    LoadChannel* ld = findLoadByName(s.deviceName);
    if (ld != nullptr && isProcessLoad(ld)) {
      hasProcessPlan = true;
      if (!hasSuggestedMode && s.hasProcessMode) {
        suggestedMode = s.processMode;
        hasSuggestedMode = true;
      }
    }
  }
  if (!hasProcessPlan) return;
  if (hasSuggestedMode) {
    productionState = suggestedMode;
  }

  for (int i = 0; i < selectedState->suggestionCount; ++i) {
    const AISuggestion& s = selectedState->suggestions[i];
    LoadChannel* ld = findLoadByName(s.deviceName);
    if (ld == nullptr || !isProcessLoad(ld)) continue;
    if (!isPolicyManagedLoad(ld)) continue;
    if (ld->faultActive && ((s.hasOn && s.onValue) || (s.hasDuty && s.dutyValue > 0.0f))) continue;

