Omzlaw/iot-based-industrial-energy-monitoring-and-predictive-load-management-system/MSc Project/Arduino/esp32_digital_twin_controller/esp32_digital_twin_controller.ino
    if (s.hasOn) {
      if (!s.onValue && ld->on) rememberDutyBeforeOff(ld);
      ld->on = s.onValue;
      if (s.onValue && !s.hasDuty) {
        restoreDutyOn(ld);
      }
    }
    if (s.hasDuty) {
      float d = sanitizeDutyForLoad(ld, s.dutyValue);
      ld->duty = d;
      if (d > 0.0f) ld->lastDuty = d;
      if (d <= 0.0f) ld->on = false;
      else if (!s.hasOn) ld->on = true;
    }
  }
}

LoadChannel* findLoadByName(const String& name) {
  for (size_t i = 0; i < LOAD_COUNT; ++i) {
    if (loads[i]->name == name) return loads[i];
  }
  return nullptr;
}

bool applySingleAiSuggestion(const AISuggestion& s) {
  LoadChannel* ld = findLoadByName(s.deviceName);
  if (ld == nullptr) return false;
  if (!isPolicyManagedLoad(ld)) return false;
  if (productionProcessEnabled && isProcessLoad(ld)) return false;

  // Guardrails: critical loads cannot be switched OFF
  if (s.hasOn && ld->loadClass == CLASS_CRITICAL && !s.onValue) return false;

  const bool wasOn = ld->on;
  const float oldDuty = ld->duty;
  if (s.hasOn) ld->on = s.onValue;
  if (s.hasDuty) {
    if (loadSupportsDutyControl(ld)) {
      float dutyFloor = (ld->loadClass == CLASS_CRITICAL) ? CRITICAL_MIN_DEVICE_DUTY : MIN_DEVICE_DUTY;
      ld->duty = clampf(max(dutyFloor, s.dutyValue), 0.0f, 1.0f);
    } else {
      ld->duty = sanitizeDutyForLoad(ld, s.dutyValue);
      ld->on = ld->duty > 0.0f;
    }
  } else if (s.hasOn && s.onValue && !wasOn) {
    restoreDutyOn(ld);
  } else if (s.hasOn && !s.onValue && wasOn) {
    rememberDutyBeforeOff(ld);
  }
  if (s.hasOn && wasOn && !ld->on) registerControlActionTyped("shed");
  else if (s.hasDuty && ld->duty < oldDuty) registerControlActionTyped("curtail");
  else if (s.hasDuty && ld->duty > oldDuty) registerControlActionTyped("restore");
  else registerControlAction();
  return true;
}

bool applyCachedAiSuggestion() {
  for (int i = 0; i < aiSuggestionCount; ++i) {
    if (applySingleAiSuggestion(aiSuggestions[i])) {
      return true;
    }
  }
  return false;
}

int applyCachedAiSuggestions(uint8_t maxToApply) {
  int appliedCount = 0;
  const uint8_t targetCount = (maxToApply > 0) ? maxToApply : 1;
  for (int i = 0; i < aiSuggestionCount; ++i) {
    if (applySingleAiSuggestion(aiSuggestions[i])) {
      appliedCount++;
      if (appliedCount >= targetCount) break;
    }
  }
  return appliedCount;
}

String isoTimestampUtc() {
  time_t now = time(nullptr);
  if (now < 100000) {
    // Fallback before NTP sync
    unsigned long ms = millis();
    return String("UNSYNCED_") + String(ms);
  }
  struct tm tmUtc;
  gmtime_r(&now, &tmUtc);
  char buf[32];
  strftime(buf, sizeof(buf), "%Y-%m-%dT%H:%M:%SZ", &tmUtc);
  return String(buf);
}

String isoTimestampUtcForEpoch(time_t epochSec) {
  if (epochSec < 100000) {
    return String("UNSYNCED_") + String((unsigned long)max(0L, (long)epochSec));
  }
  struct tm tmUtc;
  gmtime_r(&epochSec, &tmUtc);
  char buf[32];
  strftime(buf, sizeof(buf), "%Y-%m-%dT%H:%M:%SZ", &tmUtc);
  return String(buf);
}

void setEnergyGoalWindowResetReason(const char* reason) {
  snprintf(energyGoalWindowResetReason, sizeof(energyGoalWindowResetReason), "%s", (reason && reason[0]) ? reason : "unspecified");
}

void syncEnergyGoalWindowConfigSnapshot() {
  energyGoalWindowConfigWh = MAX_ENERGY_CONSUMPTION_FOR_THR_DAY_WH;
  energyGoalWindowConfigDurationSec = ENERGY_GOAL_DURATION_SEC;
  energyGoalWindowConfigPowerCapW = MAX_TOTAL_POWER_W;
}

void resetEnergyGoalWindowState(const char* reason, unsigned long startMs, bool incrementCounter) {
  if (incrementCounter) {
    energyGoalWindowResetCount++;
  }
  energyGoalWindowStartMs = startMs;
  currentGoalWindowWh = 0.0f;
  for (size_t i = 0; i < LOAD_COUNT; ++i) {
    loads[i]->goalWindowEnergyWh = 0.0f;
  }
  setEnergyGoalWindowResetReason(reason);
  syncEnergyGoalWindowConfigSnapshot();
}

unsigned long energyGoalWindowDurationMs() {
  return (unsigned long)max(60000.0f, ENERGY_GOAL_DURATION_SEC * 1000.0f);
}

void advanceEnergyGoalWindowToMs(unsigned long targetMs, const char* reason) {
  if (energyGoalWindowStartMs == 0) {
    resetEnergyGoalWindowState(reason, targetMs, false);
    return;
  }
  if (targetMs <= energyGoalWindowStartMs) {
    return;
  }
  const unsigned long durationMs = energyGoalWindowDurationMs();
  while ((targetMs - energyGoalWindowStartMs) >= durationMs) {
    energyGoalWindowStartMs += durationMs;
    currentGoalWindowWh = 0.0f;
    setEnergyGoalWindowResetReason(reason);
    syncEnergyGoalWindowConfigSnapshot();
    energyGoalWindowResetCount++;
  }
}

void ensureEnergyGoalWindowConfigured(unsigned long nowMs) {
  if (energyGoalWindowStartMs == 0) {
    resetEnergyGoalWindowState("startup", nowMs, false);
    return;
  }
  const bool configChanged =
    fabsf(energyGoalWindowConfigWh - MAX_ENERGY_CONSUMPTION_FOR_THR_DAY_WH) > 0.001f
    || fabsf(energyGoalWindowConfigDurationSec - ENERGY_GOAL_DURATION_SEC) > 0.001f
    || fabsf(energyGoalWindowConfigPowerCapW - MAX_TOTAL_POWER_W) > 0.001f;
  if (configChanged) {
    resetEnergyGoalWindowState("config_changed", nowMs, true);
  }
}

float readVoltageSensorV(uint8_t pin, float ratio) {
  int raw = analogRead(pin);
  float sensed = (raw / ADC_MAX_COUNTS) * ADC_REFERENCE_V;
  return sensed * ratio;
}

bool tcaSelectChannel(uint8_t channel) {
  if (!USE_TCA9548A) return true;
  if (channel > 7) return false;
  Wire.beginTransmission(TCA9548A_ADDR);
  Wire.write(1 << channel);
  return Wire.endTransmission() == 0;
}

bool tcaPresent() {
  if (!USE_TCA9548A) return false;
  Wire.beginTransmission(TCA9548A_ADDR);
  return Wire.endTransmission() == 0;
}

bool initIna219OnChannel(uint8_t channel) {
  if (!tcaSelectChannel(channel)) return false;
  if (!ina219.begin()) return false;
  ina219.setCalibration_32V_2A();
  return true;
}

float readIna219CurrentRawA(uint8_t channel) {
  if (!tcaSelectChannel(channel)) return 0.0f;
  delayMicroseconds(200);
  float mA = ina219.getCurrent_mA();
  return mA / 1000.0f;
}

float readIna219CurrentA(uint8_t channel) {
  return fabs(readIna219CurrentRawA(channel));
}

