Omzlaw/iot-based-industrial-energy-monitoring-and-predictive-load-management-system/MSc Project/Arduino/esp32_digital_twin_controller/esp32_digital_twin_controller.ino
float readIna219BusVoltageV(uint8_t channel) {
  if (!tcaSelectChannel(channel)) return NAN;
  delayMicroseconds(200);
  return ina219.getBusVoltage_V();
}

float readIna219PowerW(uint8_t channel) {
  if (!tcaSelectChannel(channel)) return NAN;
  delayMicroseconds(200);
  float mW = ina219.getPower_mW();
  return mW / 1000.0f;
}

void calibrateIna219CurrentOffsets() {
  if (!USE_INA219) return;
  Serial.println("[sensors] calibrating INA219 current offsets (no-load expected)...");
  bool prevOn[LOAD_COUNT];
  float prevDuty[LOAD_COUNT];
  unsigned long nowMs = millis();
  for (size_t i = 0; i < LOAD_COUNT; ++i) {
    prevOn[i] = loads[i]->on;
    prevDuty[i] = loads[i]->duty;
    loads[i]->on = false;
    loads[i]->duty = 0.0f;
    loads[i]->applyHardware(nowMs);
  }
  delay(CURRENT_ZERO_SETTLE_MS);
  for (size_t i = 0; i < LOAD_COUNT; ++i) {
    LoadChannel* ld = loads[i];
    ld->currentFilterInitialized = false;
    ld->filteredCurrentA = 0.0f;
    if (!ina219Present[i]) {
      ld->currentOffsetA = 0.0f;
      continue;
    }
    const uint8_t ch = INA219_CHANNELS[i];
    float acc = 0.0f;
    uint8_t count = 0;
    for (uint8_t s = 0; s < INA219_ZERO_CAL_SAMPLES; ++s) {
      float a = readIna219CurrentRawA(ch);
      if (!isnan(a)) {
        acc += a;
        count++;
      }
      delay(2);
    }
    ld->currentOffsetA = (count > 0) ? (acc / (float)count) : 0.0f;
    Serial.printf("[sensors] zero_%s ch=%u offset=%.4fA\n",
                  ld->name.c_str(),
                  ch,
                  ld->currentOffsetA);
  }
  nowMs = millis();
  for (size_t i = 0; i < LOAD_COUNT; ++i) {
    loads[i]->on = prevOn[i];
    loads[i]->duty = prevDuty[i];
    loads[i]->applyHardware(nowMs);
  }
}

float applyIna219CurrentCalibration(LoadChannel* ld, float rawCurrentA) {
  if (ld == nullptr || isnan(rawCurrentA)) return 0.0f;

  // Keep auto-zero tracking slow and only when load is effectively off.
  if (!ld->on && !ld->faultActive && ld->faultInjectA <= 0.0f) {
    if (fabs(rawCurrentA) <= INA219_OFFSET_TRACK_MAX_A) {
      ld->currentOffsetA = (ld->currentOffsetA * (1.0f - INA219_OFFSET_TRACK_ALPHA))
                         + (rawCurrentA * INA219_OFFSET_TRACK_ALPHA);
    }
  }

  float correctedA = (rawCurrentA - ld->currentOffsetA) * ld->currentGain;
  float absA = fabs(correctedA);
  if (absA < INA219_CURRENT_DEADBAND_A) absA = 0.0f;

  if (!ld->currentFilterInitialized) {
    ld->filteredCurrentA = absA;
    ld->currentFilterInitialized = true;
  } else {
    ld->filteredCurrentA += (absA - ld->filteredCurrentA) * INA219_CURRENT_FILTER_ALPHA;
  }
  if (ld->filteredCurrentA < INA219_CURRENT_DEADBAND_A) {
    ld->filteredCurrentA = 0.0f;
  }
  return max(0.0f, ld->filteredCurrentA);
}

bool controlCooldownOk() {
  unsigned long elapsedMs = millis() - lastControlActionMs;
  return elapsedMs >= (unsigned long)(CONTROL_COOLDOWN_SEC * 1000.0f);
}

void registerControlAction() {
  lastControlActionMs = millis();
  totalControlActions++;
}

void registerControlActionTyped(const char* actionType) {
  registerControlAction();
  if (strcmp(actionType, "shed") == 0) sheddingEventCount++;
  else if (strcmp(actionType, "curtail") == 0) curtailEventCount++;
  else if (strcmp(actionType, "restore") == 0) restoreEventCount++;
}

float scenePresetDurationSec(const String& preset) {
  String p = preset;
  p.toUpperCase();
  if (p == "WINTER_BALANCED") return 10.0f * 60.0f;
  if (p == "SPRING_RAMP") return 30.0f * 60.0f;
  if (p == "SUMMER_PEAK") return 60.0f * 60.0f;
  if (p == "AUTUMN_STABLE") return 24.0f * 60.0f * 60.0f;
  if (p == "PRESET_1") return 10.0f * 60.0f;
  if (p == "PRESET_2") return 30.0f * 60.0f;
  if (p == "PRESET_3") return 60.0f * 60.0f;
  if (p == "PRESET_4") return 24.0f * 60.0f * 60.0f;
  // Legacy aliases
  if (p == "TEN_MIN") return 10.0f * 60.0f;
  if (p == "THIRTY_MIN") return 30.0f * 60.0f;
  if (p == "ONE_HOUR") return 60.0f * 60.0f;
  if (p == "ONE_DAY") return 24.0f * 60.0f * 60.0f;
  return 0.0f;
}

void applySceneAutomation() {
  if (!sceneEnabled || sceneDurationSec <= 0.0f) {
    sceneTargetTempC = NAN;
    sceneTargetHumidityPct = NAN;
    return;
  }

  float elapsedSec = (millis() - sceneStartMs) / 1000.0f;
  if (elapsedSec >= sceneDurationSec) {
    if (sceneLoop) {
      elapsedSec = fmodf(elapsedSec, sceneDurationSec);
    } else {
      elapsedSec = sceneDurationSec;
      sceneEnabled = false;
      sceneTargetTempC = NAN;
      sceneTargetHumidityPct = NAN;
    }
  }

  float phase = elapsedSec / sceneDurationSec;
  String sceneKey = sceneName;
  sceneKey.toUpperCase();
  if (sceneKey == "PRESET_1") sceneKey = "WINTER_BALANCED";
  else if (sceneKey == "PRESET_2") sceneKey = "SPRING_RAMP";
  else if (sceneKey == "PRESET_3") sceneKey = "SUMMER_PEAK";
  else if (sceneKey == "PRESET_4") sceneKey = "AUTUMN_STABLE";

  PlantMode phaseMode = PLANT_NORMAL;
  SeasonMode phaseSeason = SEASON_DEFAULT;
  String phaseTariff = "OFFPEAK";
  bool phasePeak = false;
  float phaseTemp = NAN;
  float phaseHumidity = NAN;

  if (sceneKey == "WINTER_BALANCED") {
    phaseMode = PLANT_LOW_PROD;
    phaseSeason = SEASON_WINTER;
    phaseTariff = "OFFPEAK";
    phasePeak = false;
    phaseTemp = 19.0f;
    phaseHumidity = 50.0f;
  } else if (sceneKey == "SPRING_RAMP") {
    phaseMode = PLANT_NORMAL;
    phaseSeason = SEASON_SPRING;
    phaseTariff = "MIDPEAK";
    phasePeak = false;
    phaseTemp = 23.0f;
    phaseHumidity = 55.0f;
  } else if (sceneKey == "SUMMER_PEAK") {
    phaseMode = PLANT_HIGH_PROD;
    phaseSeason = SEASON_SUMMER;
    phaseTariff = "PEAK";
    phasePeak = true;
    phaseTemp = 30.0f;
    phaseHumidity = 62.0f;
  } else if (sceneKey == "AUTUMN_STABLE") {
    phaseMode = PLANT_NORMAL;
    phaseSeason = SEASON_AUTUMN;
    phaseTariff = "MIDPEAK";
    phasePeak = false;
    phaseTemp = 22.0f;
    phaseHumidity = 56.0f;
  } else if (phase < 0.15f) {
    phaseMode = PLANT_LOW_PROD;
    phaseSeason = SEASON_WINTER;
    phaseTariff = "OFFPEAK";
    phasePeak = false;
    phaseTemp = 19.0f;
    phaseHumidity = 50.0f;
  } else if (phase < 0.45f) {
    phaseMode = PLANT_HIGH_PROD;
    phaseSeason = SEASON_SPRING;
    phaseTariff = "MIDPEAK";
    phasePeak = false;
    phaseTemp = 23.0f;
    phaseHumidity = 55.0f;
  } else if (phase < 0.70f) {
    phaseMode = PLANT_HIGH_PROD;
    phaseSeason = SEASON_SUMMER;
    phaseTariff = "PEAK";
    phasePeak = true;
    phaseTemp = 30.0f;
    phaseHumidity = 62.0f;
  } else if (phase < 0.90f) {
    phaseMode = PLANT_NORMAL;
    phaseSeason = SEASON_AUTUMN;
    phaseTariff = "MIDPEAK";
    phasePeak = false;
    phaseTemp = 22.0f;
    phaseHumidity = 56.0f;
  } else {
    phaseMode = PLANT_ENERGY_SAVING;
    phaseSeason = SEASON_WINTER;
    phaseTariff = "OFFPEAK";
    phasePeak = false;
    phaseTemp = 18.0f;
    phaseHumidity = 50.0f;
  }

  if (sceneOverrideModeEnabled) phaseMode = sceneOverrideMode;
  if (sceneOverrideSeasonEnabled) phaseSeason = sceneOverrideSeason;
  if (sceneOverrideTariffEnabled) phaseTariff = sceneOverrideTariffState;
  if (sceneOverridePeakEnabled) phasePeak = sceneOverridePeakEvent;
  if (sceneOverrideTempEnabled) phaseTemp = sceneOverrideTempC;
  if (sceneOverrideHumidityEnabled) phaseHumidity = sceneOverrideHumidityPct;

