Omzlaw/iot-based-industrial-energy-monitoring-and-predictive-load-management-system/MSc Project/Arduino/esp32_digital_twin_controller/esp32_digital_twin_controller.ino
  plantMode = phaseMode;
  seasonMode = phaseSeason;
  tariffState = phaseTariff;
  peakEvent = phasePeak;
  sceneTargetTempC = phaseTemp;
  sceneTargetHumidityPct = phaseHumidity;
}

void updateEnergyWindows(float totalPowerW, float elapsedSec) {
  const unsigned long nowMs = millis();
  float stepWh = (totalPowerW * max(0.0f, elapsedSec)) / 3600.0f;
  float stepWhByLoad[LOAD_COUNT];
  for (size_t i = 0; i < LOAD_COUNT; ++i) {
    stepWhByLoad[i] = (loads[i]->powerW * max(0.0f, elapsedSec)) / 3600.0f;
  }
  cumulativeEnergyWh += stepWh;
  currentMinuteBucketWh += stepWh;

  if (currentMinuteBucketStartMs == 0) {
    currentMinuteBucketStartMs = nowMs;
  }

  while ((nowMs - currentMinuteBucketStartMs) >= 60000UL) {
    energyMinuteBucketsWh[energyBucketHead] = currentMinuteBucketWh;
    energyBucketHead = (energyBucketHead + 1) % ENERGY_BUCKETS_PER_DAY;
    if (energyBucketCount < ENERGY_BUCKETS_PER_DAY) {
      energyBucketCount++;
    }
    currentMinuteBucketWh = 0.0f;
    currentMinuteBucketStartMs += 60000UL;
  }

  ensureEnergyGoalWindowConfigured(nowMs);
  const unsigned long durationMs = energyGoalWindowDurationMs();
  if (elapsedSec <= 0.0f) {
    advanceEnergyGoalWindowToMs(nowMs, "window_completed");
    return;
  }

  const double stepDurationMs = max(1.0, (double)elapsedSec * 1000.0);
  const double stepEndMs = (double)nowMs;
  const double stepStartMs = max(0.0, stepEndMs - stepDurationMs);
  advanceEnergyGoalWindowToMs((unsigned long)stepStartMs, "window_completed");

  double cursorMs = max(stepStartMs, (double)energyGoalWindowStartMs);
  while (cursorMs < stepEndMs) {
    const double windowEndMs = (double)energyGoalWindowStartMs + (double)durationMs;
    const double overlapEndMs = min(stepEndMs, windowEndMs);
    const double overlapMs = max(0.0, overlapEndMs - cursorMs);
    if (overlapMs > 0.0) {
      const float overlapRatio = (float)(overlapMs / stepDurationMs);
      currentGoalWindowWh += stepWh * overlapRatio;
      for (size_t i = 0; i < LOAD_COUNT; ++i) {
        loads[i]->goalWindowEnergyWh += stepWhByLoad[i] * overlapRatio;
      }
    }
    cursorMs = overlapEndMs;
    if (cursorMs + 0.5 >= windowEndMs) {
      advanceEnergyGoalWindowToMs((unsigned long)windowEndMs, "window_completed");
    }
  }
}

float getWindowEnergyWh(int windowMinutes) {
  int available = min(windowMinutes, energyBucketCount);
  float sumWh = currentMinuteBucketWh;
  for (int i = 0; i < available; ++i) {
    int idx = (energyBucketHead - 1 - i + ENERGY_BUCKETS_PER_DAY) % ENERGY_BUCKETS_PER_DAY;
    sumWh += energyMinuteBucketsWh[idx];
  }
  return sumWh;
}

float getWindowEnergyByDurationSec(float durationSec) {
  int minutes = (int)roundf(max(60.0f, durationSec) / 60.0f);
  return getWindowEnergyWh(minutes);
}

float getCurrentEnergyGoalWindowWh() {
  return max(0.0f, currentGoalWindowWh);
}

// -----------------------------
// Mode / season application
// -----------------------------
void applySeasonProfile() {
  seasonTempOffsetC = 0.0f;
  seasonHumidityOffset = 0.0f;
  switch (seasonMode) {
    case SEASON_SUMMER:
      seasonTempOffsetC = 6.0f;
      seasonHumidityOffset = 5.0f;
      break;
    case SEASON_WINTER:
      seasonTempOffsetC = -6.0f;
      seasonHumidityOffset = -5.0f;
      break;
    case SEASON_SPRING:
      seasonTempOffsetC = -2.0f;
      seasonHumidityOffset = 0.0f;
      break;
    case SEASON_AUTUMN:
      seasonTempOffsetC = -3.0f;
      seasonHumidityOffset = 0.0f;
      break;
    default:
      break;
  }
}

void applyPlantModeProfile() {
  // Apply a mode profile across all loads (similar intent as simulator)
  float motorDutyCap = 1.0f;
  float lightDutyCap = 1.0f;
  float motorLoadFactor = 1.0f;

  switch (plantMode) {
    case PLANT_HIGH_PROD:
      motorLoadFactor = 1.25f;
      break;
    case PLANT_LOW_PROD:
      motorLoadFactor = 0.80f;
      lightDutyCap = 0.70f;
      break;
    case PLANT_ENERGY_SAVING:
      motorLoadFactor = 0.90f;
      lightDutyCap = 0.60f;
      break;
    default:
      break;
  }

  motor1.loadFactor = motorLoadFactor;
  motor2.loadFactor = motorLoadFactor;

  // Cap duties so mode impacts all loads
  motor1.duty = min(motor1.duty, motorDutyCap);
  motor2.duty = min(motor2.duty, motorDutyCap);
  light1.duty = min(light1.duty, lightDutyCap);
  light2.duty = min(light2.duty, lightDutyCap);
}

// -----------------------------
// Rule-based control
// -----------------------------
int classWeight(LoadClass c) {
  switch (c) {
    case CLASS_CRITICAL: return 0;
    case CLASS_ESSENTIAL: return 1;
    case CLASS_IMPORTANT: return 2;
    case CLASS_SECONDARY: return 3;
    case CLASS_NON_ESSENTIAL: return 4;
  }
  return 4;
}

LoadChannel* selectCurtailCandidate(bool descendingImportance, bool allowPolicyOverrides) {
  LoadChannel* best = nullptr;
  for (size_t i = 0; i < LOAD_COUNT; ++i) {
    LoadChannel* ld = loads[i];
    if (!ld->on) continue;
    if (!allowPolicyOverrides && !isPolicyManagedLoad(ld)) continue;
    // Keep heaters under process control while production process is active.
    if (productionProcessEnabled && (ld == &heater1 || ld == &heater2)) continue;
    if (best == nullptr) {
      best = ld;
      continue;
    }
    int wBest = classWeight(best->loadClass);
    int wCur = classWeight(ld->loadClass);
    // For curtail/shedding: pick least important first (higher weight, higher priority value)
    if (!descendingImportance) {
      if (wCur > wBest || (wCur == wBest && ld->priority > best->priority)) best = ld;
    } else {
      // For restore: pick most important first (lower weight, lower priority value)
      if (wCur < wBest || (wCur == wBest && ld->priority < best->priority)) best = ld;
    }
  }
  return best;
}

static unsigned long automaticRestoreHoldoffMs() {
  return max(4000UL, (unsigned long)(max(4.0f, CONTROL_COOLDOWN_SEC * 2.0f) * 1000.0f));
}

static float desiredRestoreDuty(const LoadChannel* ld);

static void noteAutomaticCurtail(LoadChannel* ld, unsigned long nowMs) {
  if (ld == nullptr) return;
  ld->controlReduced = true;
  ld->lastAutoCurtailMs = nowMs;
  ld->restoreBlockedUntilMs = nowMs + automaticRestoreHoldoffMs();
}

static void noteAutomaticRestore(LoadChannel* ld, unsigned long nowMs) {
  if (ld == nullptr) return;
  ld->lastAutoRestoreMs = nowMs;
  if (ld->on && (desiredRestoreDuty(ld) - ld->duty) <= 0.01f) {
    ld->controlReduced = false;
  }
}

static float loadMinDuty(const LoadChannel* ld) {
  if (ld == nullptr) return MIN_DEVICE_DUTY;
  if (!loadSupportsDutyControl(ld)) return 1.0f;
  return (ld->loadClass == CLASS_CRITICAL) ? CRITICAL_MIN_DEVICE_DUTY : MIN_DEVICE_DUTY;
}

