Omzlaw/iot-based-industrial-energy-monitoring-and-predictive-load-management-system/MSc Project/Arduino/esp32_digital_twin_controller/esp32_digital_twin_controller.ino
static float desiredRestoreDuty(const LoadChannel* ld) {
  if (ld == nullptr) return 0.0f;
  if (!loadSupportsDutyControl(ld)) {
    return (ld->lastDuty > 0.0f) ? 1.0f : 0.0f;
  }
  return clampf(max(loadMinDuty(ld), ld->lastDuty), 0.0f, 1.0f);
}

static float nextRestoreDuty(const LoadChannel* ld) {
  if (ld == nullptr) return 0.0f;
  const float desired = desiredRestoreDuty(ld);
  if (!loadSupportsDutyControl(ld)) return desired;
  if (!ld->on) {
    return loadMinDuty(ld);
  }
  return min(desired, clampf(ld->duty, 0.0f, 1.0f) + max(0.01f, DUTY_STEP_SIZE));
}

static bool loadNeedsRestore(const LoadChannel* ld, unsigned long nowMs) {
  if (ld == nullptr) return false;
  if (!isPolicyManagedLoad(ld)) return false;
  if (!ld->controlReduced) return false;
  if (ld->faultActive || ld->restorePending) return false;
  if (productionProcessEnabled && isProcessLoad(ld)) return false;
  if (nowMs < ld->restoreBlockedUntilMs) return false;
  if (heaterBlockedByAmbient(ld)) return false;
  const float desired = desiredRestoreDuty(ld);
  if (!ld->on) return desired > 0.0f;
  return (desired - ld->duty) > 0.01f;
}

static LoadChannel* selectRestoreCandidate(unsigned long nowMs) {
  LoadChannel* best = nullptr;
  for (size_t i = 0; i < LOAD_COUNT; ++i) {
    LoadChannel* ld = loads[i];
    if (!loadNeedsRestore(ld, nowMs)) continue;
    if (best == nullptr) {
      best = ld;
      continue;
    }
    const int bestWeight = classWeight(best->loadClass);
    const int curWeight = classWeight(ld->loadClass);
    const bool bestIsOff = !best->on;
    const bool curIsOff = !ld->on;
    if (curWeight < bestWeight
        || (curWeight == bestWeight && curIsOff < bestIsOff)
        || (curWeight == bestWeight && curIsOff == bestIsOff && ld->priority < best->priority)) {
      best = ld;
    }
  }
  return best;
}

static float expectedPowerForDuty(const LoadChannel* ld, float targetDuty) {
  if (ld == nullptr) return 0.0f;
  const float clippedDuty = sanitizeDutyForLoad(ld, targetDuty);
  const float currentPower = max(0.0f, ld->powerW);
  const float currentDuty = loadSupportsDutyControl(ld) ? max(0.01f, ld->duty) : (ld->on ? 1.0f : 0.0f);
  const float lastPower = max(0.0f, ld->lastActivePowerW);
  const float lastDuty = loadSupportsDutyControl(ld) ? max(0.01f, ld->lastActiveDuty) : 1.0f;

  if (!loadSupportsDutyControl(ld)) {
    if (clippedDuty <= 0.0f) return 0.0f;
    if (lastPower > 0.0f) return lastPower;
    if (ld->on && currentPower > 0.0f) return currentPower;
    return 0.0f;
  }

  if (lastPower > 0.0f) {
    return max(0.0f, lastPower * (clippedDuty / lastDuty));
  }
  if (ld->on && currentPower > 0.0f) {
    return max(0.0f, currentPower * (clippedDuty / currentDuty));
  }
  return 0.0f;
}

static float estimateRestorePowerDeltaW(const LoadChannel* ld) {
  if (ld == nullptr) return 0.0f;
  const float currentPower = max(0.0f, ld->powerW);
  const float expectedPower = expectedPowerForDuty(ld, max(0.0f, ld->duty));
  if (ld->on) {
    return max(0.0f, expectedPower - currentPower);
  }
  return expectedPower;
}

static float estimateRestorePowerDeltaWForDuty(const LoadChannel* ld, float targetDuty) {
  if (ld == nullptr) return 0.0f;
  const float currentPower = max(0.0f, ld->powerW);
  const float expectedPower = expectedPowerForDuty(ld, targetDuty);
  if (ld->on) {
    return max(0.0f, expectedPower - currentPower);
  }
  return expectedPower;
}

static float estimateRestoreCurrentA(const LoadChannel* ld) {
  if (ld == nullptr) return 0.0f;
  float voltageV = ld->voltageV;
  if (voltageV <= 0.1f) voltageV = loadBusVoltageV;
  const float expectedPower = expectedPowerForDuty(ld, max(0.0f, ld->duty));
  return max(0.0f, expectedPower / max(0.1f, voltageV));
}

static float estimateRestoreCurrentAForDuty(const LoadChannel* ld, float targetDuty) {
  if (ld == nullptr) return 0.0f;
  float voltageV = ld->voltageV;
  if (voltageV <= 0.1f) voltageV = loadBusVoltageV;
  const float expectedPower = expectedPowerForDuty(ld, targetDuty);
  return max(0.0f, expectedPower / max(0.1f, voltageV));
}

static bool applyRuleOverloadCurtailment(unsigned long nowMs) {
  LoadChannel* target = selectCurtailCandidate(false, false);
  if (target == nullptr) return false;
  const float minDuty = loadMinDuty(target);
  if (target->duty > minDuty) {
    target->duty = max(minDuty, target->duty - DUTY_STEP_SIZE);
    noteAutomaticCurtail(target, nowMs);
    registerControlActionTyped("curtail");
    return true;
  }
  if (target->loadClass != CLASS_CRITICAL) {
    rememberDutyBeforeOff(target);
    target->on = false;
    target->duty = 0.0f;
    noteAutomaticCurtail(target, nowMs);
    registerControlActionTyped("shed");
    return true;
  }
  return false;
}

static bool applyRuleOverloadCurtailmentToTarget(float measuredPowerW, float targetPowerW, unsigned long nowMs) {
  if (measuredPowerW <= targetPowerW) return false;
  return applyRuleOverloadCurtailment(nowMs);
}

static bool applyRuleRiskCurtailment(const String& effectiveRiskLevel, unsigned long nowMs) {
  LoadChannel* target = selectCurtailCandidate(false, false);
  if (target == nullptr) return false;
  const float minDuty = loadMinDuty(target);
  float dutyTarget = (effectiveRiskLevel == "HIGH" || effectiveRiskLevel == "MEDIUM") ? 0.35f : 0.50f;
  dutyTarget = max(dutyTarget, minDuty);
  if (loadSupportsDutyControl(target) && target->duty > dutyTarget) {
    target->duty = dutyTarget;
    noteAutomaticCurtail(target, nowMs);
    registerControlActionTyped("curtail");
    return true;
  }
  if (effectiveRiskLevel == "HIGH"
      && target->loadClass != CLASS_CRITICAL
      && (!loadSupportsDutyControl(target) || target->duty <= (minDuty + 0.01f))) {
    rememberDutyBeforeOff(target);
    target->on = false;
    target->duty = 0.0f;
    noteAutomaticCurtail(target, nowMs);
    registerControlActionTyped("shed");
    return true;
  }
  return false;
}

void applyAutomaticControl(float totalPowerW) {
  const unsigned long nowMs = millis();
  static unsigned long lastUvActionMs = 0;

  // Safety curtailment: active in all policies (including NO_ENERGY_MANAGEMENT).
  if (undervoltageActive || overvoltageActive) {
    const unsigned long uvActionCooldownMs = 500;
    if (nowMs - lastUvActionMs >= uvActionCooldownMs) {
      LoadChannel* target = selectCurtailCandidate(false, false);
      if (target != nullptr && target->loadClass != CLASS_CRITICAL) {
        const float minDuty = loadMinDuty(target);
        if (target->duty > minDuty) {
          target->duty = max(minDuty, target->duty - DUTY_STEP_SIZE);
          noteAutomaticCurtail(target, nowMs);
          registerControlActionTyped("curtail");
        } else {
          rememberDutyBeforeOff(target);
          target->on = false;
          target->duty = 0.0f;
          noteAutomaticCurtail(target, nowMs);
          registerControlActionTyped("shed");
        }
        lastUvActionMs = nowMs;
      }
    }
    return;
  }

  if (controlPolicy == POLICY_NO_ENERGY_MANAGEMENT) return;
  if (!controlCooldownOk()) return;
  float energyGoalWindowWh = getCurrentEnergyGoalWindowWh();
  float energyGoalRatio = (MAX_ENERGY_CONSUMPTION_FOR_THR_DAY_WH > 0.0f)
    ? (energyGoalWindowWh / MAX_ENERGY_CONSUMPTION_FOR_THR_DAY_WH)
    : 0.0f;
  bool energyBudgetRisk = isEnergyGoalWindowAtRisk(0.95f);
  bool effectivePeakRisk = predictorPeakRisk || energyBudgetRisk;
  String effectiveRiskLevel = predictorRiskLevel;
  float hybridTargetPowerW = MAX_TOTAL_POWER_W * ((energyBudgetRisk || energyGoalRatio >= 0.98f) ? 0.96f : 1.0f);
  float aiTargetPowerW = MAX_TOTAL_POWER_W * ((energyBudgetRisk || energyGoalRatio >= 1.0f) ? 0.88f : 0.94f);
  if (energyBudgetRisk && energyGoalWindowWh > MAX_ENERGY_CONSUMPTION_FOR_THR_DAY_WH * 1.01f) {
    effectiveRiskLevel = "HIGH";
  } else if (energyBudgetRisk && effectiveRiskLevel == "LOW") {
    effectiveRiskLevel = "MEDIUM";
  }

