Omzlaw/iot-based-industrial-energy-monitoring-and-predictive-load-management-system/MSc Project/Arduino/esp32_digital_twin_controller/esp32_digital_twin_controller.ino
  // Ambient heater rules (skip when production process is active).
  if (!productionProcessEnabled) {
    if (ambientTempC >= HEATER_HOT_OFF_TEMP_C) {
      for (LoadChannel* heater : {&heater1, &heater2}) {
        if (!isPolicyManagedLoad(heater)) continue;
        if (heater->on) {
          rememberDutyBeforeOff(heater);
          heater->on = false;
          heater->duty = 0.0f;
          noteAutomaticCurtail(heater, nowMs);
          registerControlActionTyped("shed");
          return;
        }
      }
    }
  }

  // Overload rule
  if (totalPowerW > MAX_TOTAL_POWER_W) {
    if (applyRuleOverloadCurtailment(nowMs)) return;
  }

  // Peak-risk rule (from predictor)
  if (effectivePeakRisk) {
    if (isAiPreferredPolicy()) {
      const uint8_t aiBurst = (effectiveRiskLevel == "HIGH" || energyGoalRatio >= 1.0f) ? 2 : 1;
      if (applyCachedAiSuggestions(aiBurst) > 0) return;
      if (applyRuleOverloadCurtailmentToTarget(totalPowerW, aiTargetPowerW, nowMs)) return;
      if (effectiveRiskLevel == "HIGH" && applyRuleRiskCurtailment(effectiveRiskLevel, nowMs)) return;
      return;
    }
    if (isHybridPolicy()) {
      if ((energyBudgetRisk || energyGoalRatio >= 0.95f || effectiveRiskLevel == "MEDIUM" || effectiveRiskLevel == "HIGH")
          && applyCachedAiSuggestion()) return;
      if (predictorPeakRisk || totalPowerW > hybridTargetPowerW || effectiveRiskLevel == "HIGH") {
        if (applyRuleRiskCurtailment(effectiveRiskLevel, nowMs)) return;
      }
      if (applyRuleOverloadCurtailmentToTarget(totalPowerW, hybridTargetPowerW, nowMs)) return;
      return;
    }
    if (applyRuleRiskCurtailment(effectiveRiskLevel, nowMs)) return;
    return;
  }

  // Restore rule
  if (totalPowerW < (MAX_TOTAL_POWER_W * RESTORE_POWER_RATIO)) {
    const float restoreHeadroomMarginW = max(0.25f, MAX_TOTAL_POWER_W * 0.02f);
    LoadChannel* target = selectRestoreCandidate(nowMs);
    if (target != nullptr) {
      const float restoreDuty = nextRestoreDuty(target);
      const float projectedDelta = estimateRestorePowerDeltaWForDuty(target, restoreDuty);
      const float projectedTotal = totalPowerW + projectedDelta;
      if (projectedTotal > (MAX_TOTAL_POWER_W - restoreHeadroomMarginW)) {
        return;
      }
      if (!target->on || restoreDuty > target->duty + 0.01f) {
        target->on = true;
        target->duty = restoreDuty;
        noteAutomaticRestore(target, nowMs);
        registerControlActionTyped("restore");
        return;
      }
    }
  }
}

// -----------------------------
// MQTT command handling
// -----------------------------
void publishAck(JsonDocument& ack, JsonDocument& cmdDoc) {
  StaticJsonDocument<2048> out;
  out["timestamp"] = (double)(millis() / 1000.0f);
  out["plant_id"] = PLANT_IDENTIFIER;
  out["ack"] = ack.as<JsonObject>();
  out["cmd"] = cmdDoc.as<JsonObject>();
  String payload;
  serializeJson(out, payload);
  mqttClient.publish(topicCommandAck.c_str(), payload.c_str());
}

double normalizePredictionTimestampSec(double rawTs) {
  double ts = rawTs;
  // Accept unix epoch in milliseconds and convert to seconds.
  if (ts > 1e12) ts /= 1000.0;
  // Keep only plausible epoch-second values (2000..2100) to avoid uptime values.
  if (ts < 946684800.0 || ts > 4102444800.0) return 0.0;
  return ts;
}

bool rejectIfProcessLocked(JsonObject root, JsonDocument& ack, JsonDocument& cmdDoc) {
  // Keep lock status for observability but do not block runtime updates.
  (void)root;
  (void)ack;
  (void)cmdDoc;
  return false;
}

void applyControllerMode(JsonObject root, JsonDocument& ack) {
  if (root.containsKey("controller_mode") || root.containsKey("control_mode")) {
    // Deprecated: controller mode is no longer used for access control.
    ack["controller_mode"] = "DEPRECATED";
  }
}

void applyControlPolicy(JsonObject root, JsonDocument& ack) {
  if (!root.containsKey("control_policy")) return;
  String p = root["control_policy"].as<String>();
  p.toUpperCase();
  if (p == "RULE_ONLY") controlPolicy = POLICY_RULE_ONLY;
  else if (p == "AI_PREFERRED") controlPolicy = POLICY_AI_PREFERRED;
  else if (p == "NO_ENERGY_MANAGEMENT") controlPolicy = POLICY_NO_ENERGY_MANAGEMENT;
  else controlPolicy = POLICY_HYBRID;
  ack["control_policy"] = controlPolicyToString(controlPolicy);
}

bool applyPredictorMode(JsonObject root, JsonDocument& ack, JsonDocument& cmdDoc) {
  if (!root.containsKey("predictor_mode") && !root.containsKey("PREDICTOR_MODE")) return false;
  String mode = root.containsKey("predictor_mode") ? root["predictor_mode"].as<String>() : root["PREDICTOR_MODE"].as<String>();
  mode.toUpperCase();
  if (mode != "TRAIN_ONLY" && mode != "EVAL_ONLY" && mode != "ONLINE" && mode != "OFFLINE") {
    ack["ok"] = false;
    ack["msg"] = "invalid predictor_mode";
    publishAck(ack, cmdDoc);
    return true;
  }
  predictorMode = mode;
  predictorModeSet = true;
  ack["predictor_mode"] = predictorMode;
  return false;
}

void applyDeprecatedModeSeason(JsonObject root, JsonDocument& ack) {
  if (root.containsKey("mode")) ack["mode"] = "IGNORED (deprecated)";
  if (root.containsKey("season")) ack["season"] = "IGNORED (deprecated)";
}

void applyTariffPeak(JsonObject root, JsonDocument& ack) {
  if (root.containsKey("tariff_state")) {
    tariffState = root["tariff_state"].as<String>();
  }
  if (root.containsKey("peak_event")) {
    peakEvent = root["peak_event"].as<bool>();
  }
  if (root.containsKey("tariff_state")) ack["tariff_state"] = tariffState;
  if (root.containsKey("peak_event")) ack["peak_event"] = peakEvent;
}

bool applyProcessCommand(JsonObject root, JsonDocument& ack, JsonDocument& cmdDoc) {
  if (!root.containsKey("process") && !root.containsKey("production_goal")) return false;
  JsonObject proc = root.containsKey("process")
    ? root["process"].as<JsonObject>()
    : root["production_goal"].as<JsonObject>();
  const bool wasProcessEnabled = productionProcessEnabled;

  if (proc.containsKey("predictor_mode")) {
    String mode = proc["predictor_mode"].as<String>();
    mode.toUpperCase();
    if (mode == "TRAIN_ONLY" || mode == "EVAL_ONLY" || mode == "ONLINE" || mode == "OFFLINE") {
      predictorMode = mode;
      predictorModeSet = true;
    }
  }

    if (proc.containsKey("goal_cycles")) {
      PRODUCTION_GOAL_CYCLES = max<uint32_t>(1u, (uint32_t)proc["goal_cycles"].as<int>());
      processConfigGoalCyclesSet = true;
    }
  bool heightChanged = false;
  if (proc.containsKey("tank_height_cm")) {
    float h = proc["tank_height_cm"].as<float>();
    float clamped = clampf(h, 10.0f, 500.0f);
    TANK1_HEIGHT_CM = clamped;
    TANK2_HEIGHT_CM = clamped;
    heightChanged = true;
  }
  if (proc.containsKey("tank1_height_cm")) {
    float h = proc["tank1_height_cm"].as<float>();
    TANK1_HEIGHT_CM = clampf(h, 10.0f, 500.0f);
    heightChanged = true;
  }
  if (proc.containsKey("tank2_height_cm")) {
    float h = proc["tank2_height_cm"].as<float>();
    TANK2_HEIGHT_CM = clampf(h, 10.0f, 500.0f);
    heightChanged = true;
  }
  if (proc.containsKey("tank_low_level_pct")) {
    float v = proc["tank_low_level_pct"].as<float>();
    TANK1_LOW_LEVEL_PCT = clampLowPctForHeight(v, TANK1_HEIGHT_CM);
    TANK2_LOW_LEVEL_PCT = clampLowPctForHeight(v, TANK2_HEIGHT_CM);
  }
  if (proc.containsKey("tank_high_level_pct")) {
    float v = proc["tank_high_level_pct"].as<float>();
    TANK1_HIGH_LEVEL_PCT = clampHighPctForHeight(v, TANK1_HEIGHT_CM, TANK1_LOW_LEVEL_PCT);
    TANK2_HIGH_LEVEL_PCT = clampHighPctForHeight(v, TANK2_HEIGHT_CM, TANK2_LOW_LEVEL_PCT);
  }
  if (proc.containsKey("tank1_low_level_pct")) {
    TANK1_LOW_LEVEL_PCT = clampLowPctForHeight(proc["tank1_low_level_pct"].as<float>(), TANK1_HEIGHT_CM);
  }
  if (proc.containsKey("tank2_low_level_pct")) {
    TANK2_LOW_LEVEL_PCT = clampLowPctForHeight(proc["tank2_low_level_pct"].as<float>(), TANK2_HEIGHT_CM);
  }
  if (proc.containsKey("tank1_high_level_pct")) {
    TANK1_HIGH_LEVEL_PCT = clampHighPctForHeight(proc["tank1_high_level_pct"].as<float>(), TANK1_HEIGHT_CM, TANK1_LOW_LEVEL_PCT);
  }
  if (proc.containsKey("tank2_high_level_pct")) {
    TANK2_HIGH_LEVEL_PCT = clampHighPctForHeight(proc["tank2_high_level_pct"].as<float>(), TANK2_HEIGHT_CM, TANK2_LOW_LEVEL_PCT);
  }
  if (heightChanged) {
    TANK1_LOW_LEVEL_PCT = clampLowPctForHeight(TANK1_LOW_LEVEL_PCT, TANK1_HEIGHT_CM);
    TANK2_LOW_LEVEL_PCT = clampLowPctForHeight(TANK2_LOW_LEVEL_PCT, TANK2_HEIGHT_CM);
    TANK1_HIGH_LEVEL_PCT = clampHighPctForHeight(TANK1_HIGH_LEVEL_PCT, TANK1_HEIGHT_CM, TANK1_LOW_LEVEL_PCT);
    TANK2_HIGH_LEVEL_PCT = clampHighPctForHeight(TANK2_HIGH_LEVEL_PCT, TANK2_HEIGHT_CM, TANK2_LOW_LEVEL_PCT);
  }
  TANK1_LOW_LEVEL_PCT = min(TANK1_LOW_LEVEL_PCT, TANK1_HIGH_LEVEL_PCT);
  TANK2_LOW_LEVEL_PCT = min(TANK2_LOW_LEVEL_PCT, TANK2_HIGH_LEVEL_PCT);
  if (proc.containsKey("tank1_level_target_pct")) {
    TANK1_LEVEL_TARGET_PCT = clampf(proc["tank1_level_target_pct"].as<float>(), TANK1_LOW_LEVEL_PCT, TANK1_HIGH_LEVEL_PCT);
    processConfigTank1LevelSet = true;
  }
  if (proc.containsKey("tank2_level_target_pct")) {
    TANK2_LEVEL_TARGET_PCT = clampf(proc["tank2_level_target_pct"].as<float>(), TANK2_LOW_LEVEL_PCT, TANK2_HIGH_LEVEL_PCT);
    processConfigTank2LevelSet = true;
  }
  if (heightChanged) {
    TANK1_LEVEL_TARGET_PCT = clampf(TANK1_LEVEL_TARGET_PCT, TANK1_LOW_LEVEL_PCT, TANK1_HIGH_LEVEL_PCT);
    TANK2_LEVEL_TARGET_PCT = clampf(TANK2_LEVEL_TARGET_PCT, TANK2_LOW_LEVEL_PCT, TANK2_HIGH_LEVEL_PCT);
  }
  if (proc.containsKey("tank1_temp_target_c")) {
    TANK1_TEMP_TARGET_C = clampf(proc["tank1_temp_target_c"].as<float>(), 0.0f, 95.0f);
    processConfigTank1TempSet = true;
  }
  if (proc.containsKey("tank2_temp_target_c")) {
    TANK2_TEMP_TARGET_C = clampf(proc["tank2_temp_target_c"].as<float>(), 0.0f, 95.0f);
    processConfigTank2TempSet = true;
  }
  if (proc.containsKey("tank1_level_pct")) tank1LevelPct = clampf(proc["tank1_level_pct"].as<float>(), 0.0f, 100.0f);
  if (proc.containsKey("tank2_level_pct")) tank2LevelPct = clampf(proc["tank2_level_pct"].as<float>(), 0.0f, 100.0f);
  if (proc.containsKey("tank1_temp_c")) tank1TempC = proc["tank1_temp_c"].as<float>();
  if (proc.containsKey("tank2_temp_c")) tank2TempC = proc["tank2_temp_c"].as<float>();

  bool wantsStart = (proc.containsKey("enabled") && proc["enabled"].as<bool>())
    || (proc.containsKey("restart") && proc["restart"].as<bool>());
  if (wantsStart && emergencyStopActive) {
    ack["ok"] = false;
    ack["msg"] = "emergency_stop_active";
    ack["process"] = root["process"];
    publishAck(ack, cmdDoc);
    return true;
  }
  if (wantsStart && !processConfigReady()) {
    ack["ok"] = false;
    ack["msg"] = "process_config_incomplete: set required parameters before starting";
    ack["missing"] = processConfigMissing();
    publishAck(ack, cmdDoc);
    return true;
  }

  if (proc.containsKey("enabled")) {
    productionProcessEnabled = proc["enabled"].as<bool>();
    processLockActive = productionProcessEnabled;
    if (productionProcessEnabled) {
      if (!wasProcessEnabled) processCycleCount = 0;
      processStartMs = millis();
      if (productionState == PROCESS_IDLE) productionState = PROCESS_HEAT_TANK1;
    } else {
      productionState = PROCESS_IDLE;
    }
  }
  if (proc.containsKey("restart") && proc["restart"].as<bool>()) {
    productionProcessEnabled = true;
    processLockActive = true;
    processStartMs = millis();
    processCycleCount = 0;
    productionState = PROCESS_HEAT_TANK1;
  }

  JsonObject ackProcess = ack.createNestedObject("process");
  ackProcess["enabled"] = productionProcessEnabled;
  ackProcess["lock_active"] = processLockActive;
  ackProcess["state"] = productionStateToString(productionState);
  ackProcess["cycle_count"] = processCycleCount;
  ackProcess["goal_cycles"] = PRODUCTION_GOAL_CYCLES;
  ackProcess["predictor_mode"] = predictorMode;
  ackProcess["tank1_level_target_pct"] = TANK1_LEVEL_TARGET_PCT;
  ackProcess["tank2_level_target_pct"] = TANK2_LEVEL_TARGET_PCT;
  ackProcess["tank_low_level_pct"] = TANK1_LOW_LEVEL_PCT;
  ackProcess["tank_high_level_pct"] = TANK1_HIGH_LEVEL_PCT;
  ackProcess["tank1_low_level_pct"] = TANK1_LOW_LEVEL_PCT;
  ackProcess["tank2_low_level_pct"] = TANK2_LOW_LEVEL_PCT;
  ackProcess["tank1_high_level_pct"] = TANK1_HIGH_LEVEL_PCT;
  ackProcess["tank2_high_level_pct"] = TANK2_HIGH_LEVEL_PCT;
  ackProcess["tank1_temp_target_base_c"] = TANK1_TEMP_TARGET_C;
  ackProcess["tank2_temp_target_base_c"] = TANK2_TEMP_TARGET_C;
  ackProcess["tank1_temp_target_c"] = tank1EffectiveTempTargetC();
  ackProcess["tank2_temp_target_c"] = tank2EffectiveTempTargetC();
  ackProcess["temp_target_step_per_cycle_c"] = PROCESS_TEMP_TARGET_STEP_PER_CYCLE_C;
  ackProcess["tank_height_cm"] = TANK1_HEIGHT_CM;
  ackProcess["tank1_height_cm"] = TANK1_HEIGHT_CM;
  ackProcess["tank2_height_cm"] = TANK2_HEIGHT_CM;
  return false;
}

void handleDeviceSet(const String& devName, JsonObject setObj) {
  LoadChannel* ld = findLoadByName(devName);
  if (ld == nullptr) return;

  if (setObj.containsKey("clear_fault") && setObj["clear_fault"].as<bool>()) {
    ld->faultInjectA = 0.0f;
    const float limitA = (ld->faultLimitA > 0.0f) ? ld->faultLimitA : LOAD_OVERCURRENT_LIMIT_A;
    const unsigned long restoreDelayMs = (ld->faultRestoreDelayMs > 0) ? ld->faultRestoreDelayMs : OVERCURRENT_CLEAR_DELAY_MS;
    const bool overLimit = (ld->currentA >= limitA);
    if (!overLimit) {
      ld->faultActive = false;
      ld->faultLatched = false;
      ld->faultCode = "NONE";
      ld->health = "OK";
      ld->overcurrentStartMs = 0;
      ld->faultClearStartMs = 0;
      const bool processDemand = (productionProcessEnabled && processDemandsLoad(ld));
      const bool allowRestore = (ld->faultWasOn || processDemand);
      if ((ld->faultWasOn || processDemand) && allowRestore) {
        ld->restorePending = true;
        ld->restoreAtMs = millis() + restoreDelayMs;
        ld->on = false;
        ld->duty = 0.0f;
        ld->appliedDuty = 0.0f;
        ld->lastDutyUpdateMs = millis();
      } else {
        ld->restorePending = false;
        ld->on = false;
        ld->duty = 0.0f;
        ld->appliedDuty = 0.0f;
        ld->lastDutyUpdateMs = millis();
      }
    } else {
      Serial.printf("[fault] clear denied %s current=%.3fA\n",
                    ld->name.c_str(),
                    ld->currentA);
    }
  }
  if (setObj.containsKey("on")) {
    bool newOn = setObj["on"].as<bool>();
    if (!newOn && ld->on) {
      rememberDutyBeforeOff(ld);
    }
    ld->controlReduced = false;
    ld->restoreBlockedUntilMs = 0;
    ld->on = newOn;
    if (newOn && !setObj.containsKey("duty")) {
      restoreDutyOn(ld);
    }
  }
  if (setObj.containsKey("duty")) {
    ld->controlReduced = false;
    ld->restoreBlockedUntilMs = 0;
    ld->duty = sanitizeDutyForLoad(ld, setObj["duty"].as<float>());
    if (ld->duty > 0.0f) {
      ld->lastDuty = ld->duty;
    }
    ld->on = ld->duty > 0.0f;
  }
  if (setObj.containsKey("load_factor")) ld->loadFactor = clampf(setObj["load_factor"].as<float>(), 0.5f, 1.6f);
  if (setObj.containsKey("temperature_c")) ld->tempC = setObj["temperature_c"].as<float>();
  if (setObj.containsKey("fault_limit_a")) ld->faultLimitA = max(0.0f, setObj["fault_limit_a"].as<float>());
  if (setObj.containsKey("fault_trip_ms") || setObj.containsKey("fault_trip_delay_ms")) {
    unsigned long v = (unsigned long)(setObj.containsKey("fault_trip_ms")
      ? setObj["fault_trip_ms"].as<unsigned long>()
      : setObj["fault_trip_delay_ms"].as<unsigned long>());
    ld->faultTripDelayMs = max(0UL, v);
  }
  if (setObj.containsKey("fault_clear_ms") || setObj.containsKey("fault_clear_delay_ms")) {
    unsigned long v = (unsigned long)(setObj.containsKey("fault_clear_ms")
      ? setObj["fault_clear_ms"].as<unsigned long>()
      : setObj["fault_clear_delay_ms"].as<unsigned long>());
    ld->faultClearDelayMs = max(0UL, v);
  }
  if (setObj.containsKey("fault_restore_ms") || setObj.containsKey("fault_restore_delay_ms")) {
    unsigned long v = (unsigned long)(setObj.containsKey("fault_restore_ms")
      ? setObj["fault_restore_ms"].as<unsigned long>()
      : setObj["fault_restore_delay_ms"].as<unsigned long>());
    ld->faultRestoreDelayMs = max(0UL, v);
  }
  if (setObj.containsKey("override") || setObj.containsKey("policy_override")) {
    ld->policyOverride = setObj.containsKey("override")
      ? setObj["override"].as<bool>()
      : setObj["policy_override"].as<bool>();
  }
  if (setObj.containsKey("inject_current_a") || setObj.containsKey("fault_inject_a")) {
    float val = setObj.containsKey("inject_current_a") ? setObj["inject_current_a"].as<float>() : setObj["fault_inject_a"].as<float>();
    ld->faultInjectA = max(0.0f, val);
  }
  if (setObj.containsKey("clear_inject") && setObj["clear_inject"].as<bool>()) {
    ld->faultInjectA = 0.0f;
  }
}

void handleDeviceMeta(const String& devName, JsonObject metaObj) {
  LoadChannel* ld = findLoadByName(devName);
  if (ld == nullptr) return;
  if (metaObj.containsKey("priority")) ld->priority = (uint8_t)clampf(metaObj["priority"].as<int>(), 1, 99);
  if (metaObj.containsKey("class")) ld->loadClass = parseLoadClass(metaObj["class"].as<String>());
}

void handleCommandMessage(const String& payload) {
  StaticJsonDocument<4096> doc;
  StaticJsonDocument<2048> ack;
  ack["ok"] = true;
  ack["msg"] = "command applied";

  auto err = deserializeJson(doc, payload);
  if (err) {
    ack["ok"] = false;
    ack["msg"] = "invalid json";
    publishAck(ack, doc);
    return;
  }

