Omzlaw/iot-based-industrial-energy-monitoring-and-predictive-load-management-system/MSc Project/Arduino/esp32_digital_twin_controller/esp32_digital_twin_controller.ino
  JsonObject root = doc.as<JsonObject>();

  if (rejectIfProcessLocked(root, ack, doc)) return;
  applyControllerMode(root, ack);
  applyControlPolicy(root, ack);
  if (applyPredictorMode(root, ack, doc)) return;
  applyDeprecatedModeSeason(root, ack);
  applyTariffPeak(root, ack);
  if (applyProcessCommand(root, ack, doc)) return;

  if (root.containsKey("scene")) {
    JsonObject scene = root["scene"].as<JsonObject>();
    if (scene.containsKey("enabled")) {
      sceneEnabled = scene["enabled"].as<bool>();
      sceneLockActive = sceneEnabled;
      if (sceneEnabled && sceneStartMs == 0) sceneStartMs = millis();
      if (!sceneEnabled) sceneLockActive = false;
    }
    if (scene.containsKey("preset")) {
      String preset = scene["preset"].as<String>();
      float presetDurationSec = scenePresetDurationSec(preset);
      if (presetDurationSec > 0.0f) {
        sceneName = preset;
        sceneName.toUpperCase();
        if (!scene.containsKey("duration_sec") && sceneDurationSec <= 0.0f) {
          // Keep backward compatibility if duration was never configured.
          sceneDurationSec = presetDurationSec;
        }
      }
    }
    if (scene.containsKey("duration_sec")) {
      sceneName = "CUSTOM";
      sceneDurationSec = max(10.0f, scene["duration_sec"].as<float>());
    }
    if (scene.containsKey("loop")) {
      sceneLoop = scene["loop"].as<bool>();
    }
    if (scene.containsKey("clear_overrides") && scene["clear_overrides"].as<bool>()) {
      sceneOverrideModeEnabled = false;
      sceneOverrideSeasonEnabled = false;
      sceneOverridePolicyEnabled = false;
      sceneOverrideTariffEnabled = false;
      sceneOverridePeakEnabled = false;
      sceneOverrideTempEnabled = false;
      sceneOverrideHumidityEnabled = false;
    }
    if (scene.containsKey("mode")) {
      sceneOverrideModeEnabled = true;
      sceneOverrideMode = plantModeFromString(scene["mode"].as<String>());
    }
    if (scene.containsKey("season")) {
      sceneOverrideSeasonEnabled = true;
      sceneOverrideSeason = seasonModeFromString(scene["season"].as<String>());
    }
    if (scene.containsKey("control_policy")) {
      sceneOverridePolicyEnabled = true;
      sceneOverridePolicy = controlPolicyFromString(scene["control_policy"].as<String>());
    }
    if (scene.containsKey("tariff_state")) {
      sceneOverrideTariffEnabled = true;
      sceneOverrideTariffState = scene["tariff_state"].as<String>();
      sceneOverrideTariffState.toUpperCase();
    }
    if (scene.containsKey("peak_event")) {
      sceneOverridePeakEnabled = true;
      sceneOverridePeakEvent = scene["peak_event"].as<bool>();
    }
    if (scene.containsKey("environment")) {
      JsonObject sceneEnv = scene["environment"].as<JsonObject>();
      if (sceneEnv.containsKey("temperature_c")) {
        sceneOverrideTempEnabled = true;
        sceneOverrideTempC = sceneEnv["temperature_c"].as<float>();
      }
      if (sceneEnv.containsKey("humidity_pct")) {
        sceneOverrideHumidityEnabled = true;
        sceneOverrideHumidityPct = clampf(sceneEnv["humidity_pct"].as<float>(), 0.0f, 100.0f);
      }
    }
    if (scene["restart"] | false) {
      sceneStartMs = millis();
    }

    JsonObject ackScene = ack.createNestedObject("scene");
    ackScene["enabled"] = sceneEnabled;
    ackScene["lock_active"] = sceneLockActive;
    ackScene["name"] = sceneName;
    ackScene["duration_sec"] = sceneDurationSec;
    ackScene["loop"] = sceneLoop;
    JsonObject ackSceneOverrides = ackScene.createNestedObject("overrides");
    if (sceneOverrideModeEnabled) ackSceneOverrides["mode"] = plantModeToString(sceneOverrideMode);
    if (sceneOverrideSeasonEnabled) ackSceneOverrides["season"] = seasonModeToString(sceneOverrideSeason);
    if (sceneOverridePolicyEnabled) ackSceneOverrides["control_policy"] = controlPolicyToString(sceneOverridePolicy);
    if (sceneOverrideTariffEnabled) ackSceneOverrides["tariff_state"] = sceneOverrideTariffState;
    if (sceneOverridePeakEnabled) ackSceneOverrides["peak_event"] = sceneOverridePeakEvent;
    if (sceneOverrideTempEnabled || sceneOverrideHumidityEnabled) {
      JsonObject ackSceneEnv = ackSceneOverrides.createNestedObject("environment");
      if (sceneOverrideTempEnabled) ackSceneEnv["temperature_c"] = sceneOverrideTempC;
      if (sceneOverrideHumidityEnabled) ackSceneEnv["humidity_pct"] = sceneOverrideHumidityPct;
    }
  }

  // Control block
  if (root.containsKey("control")) {
    JsonObject ctrl = root["control"].as<JsonObject>();
    bool energyGoalConfigTouched = false;
    if (ctrl.containsKey("MAX_TOTAL_POWER_W") || ctrl.containsKey("POWER_MAX_W") || ctrl.containsKey("P_MAX")) {
      MAX_TOTAL_POWER_W = ctrl.containsKey("MAX_TOTAL_POWER_W") ? ctrl["MAX_TOTAL_POWER_W"].as<float>()
                        : (ctrl.containsKey("POWER_MAX_W") ? ctrl["POWER_MAX_W"].as<float>() : ctrl["P_MAX"].as<float>());
      energyGoalConfigTouched = true;
    }
    if (ctrl.containsKey("UNDERVOLTAGE_THRESHOLD_V") || ctrl.containsKey("UV_THRESHOLD_V")) {
      float v = ctrl.containsKey("UNDERVOLTAGE_THRESHOLD_V")
        ? ctrl["UNDERVOLTAGE_THRESHOLD_V"].as<float>()
        : ctrl["UV_THRESHOLD_V"].as<float>();
      UNDERVOLTAGE_THRESHOLD_V = max(0.0f, v);
    }
    if (ctrl.containsKey("UNDERVOLTAGE_TRIP_DELAY_MS") || ctrl.containsKey("UV_TRIP_DELAY_MS")) {
      unsigned long v = (unsigned long)(ctrl.containsKey("UNDERVOLTAGE_TRIP_DELAY_MS")
        ? ctrl["UNDERVOLTAGE_TRIP_DELAY_MS"].as<unsigned long>()
        : ctrl["UV_TRIP_DELAY_MS"].as<unsigned long>());
      UNDERVOLTAGE_TRIP_DELAY_MS = max(0UL, v);
    }
    if (ctrl.containsKey("UNDERVOLTAGE_CLEAR_DELAY_MS") || ctrl.containsKey("UV_CLEAR_DELAY_MS")) {
      unsigned long v = (unsigned long)(ctrl.containsKey("UNDERVOLTAGE_CLEAR_DELAY_MS")
        ? ctrl["UNDERVOLTAGE_CLEAR_DELAY_MS"].as<unsigned long>()
        : ctrl["UV_CLEAR_DELAY_MS"].as<unsigned long>());
      UNDERVOLTAGE_CLEAR_DELAY_MS = max(0UL, v);
    }
    if (ctrl.containsKey("UNDERVOLTAGE_RESTORE_MARGIN_V") || ctrl.containsKey("UV_RESTORE_MARGIN_V")) {
      float v = ctrl.containsKey("UNDERVOLTAGE_RESTORE_MARGIN_V")
        ? ctrl["UNDERVOLTAGE_RESTORE_MARGIN_V"].as<float>()
        : ctrl["UV_RESTORE_MARGIN_V"].as<float>();
      UNDERVOLTAGE_RESTORE_MARGIN_V = max(0.0f, v);
    }
    if (ctrl.containsKey("OVERVOLTAGE_THRESHOLD_V") || ctrl.containsKey("OV_THRESHOLD_V")) {
      float v = ctrl.containsKey("OVERVOLTAGE_THRESHOLD_V")
        ? ctrl["OVERVOLTAGE_THRESHOLD_V"].as<float>()
        : ctrl["OV_THRESHOLD_V"].as<float>();
      OVERVOLTAGE_THRESHOLD_V = max(0.0f, v);
    }
    if (ctrl.containsKey("OVERVOLTAGE_TRIP_DELAY_MS") || ctrl.containsKey("OV_TRIP_DELAY_MS")) {
      unsigned long v = (unsigned long)(ctrl.containsKey("OVERVOLTAGE_TRIP_DELAY_MS")
        ? ctrl["OVERVOLTAGE_TRIP_DELAY_MS"].as<unsigned long>()
        : ctrl["OV_TRIP_DELAY_MS"].as<unsigned long>());
      OVERVOLTAGE_TRIP_DELAY_MS = max(0UL, v);
    }
    if (ctrl.containsKey("OVERVOLTAGE_CLEAR_DELAY_MS") || ctrl.containsKey("OV_CLEAR_DELAY_MS")) {
      unsigned long v = (unsigned long)(ctrl.containsKey("OVERVOLTAGE_CLEAR_DELAY_MS")
        ? ctrl["OVERVOLTAGE_CLEAR_DELAY_MS"].as<unsigned long>()
        : ctrl["OV_CLEAR_DELAY_MS"].as<unsigned long>());
      OVERVOLTAGE_CLEAR_DELAY_MS = max(0UL, v);
    }
    if (ctrl.containsKey("OVERVOLTAGE_RESTORE_MARGIN_V") || ctrl.containsKey("OV_RESTORE_MARGIN_V")) {
      float v = ctrl.containsKey("OVERVOLTAGE_RESTORE_MARGIN_V")
        ? ctrl["OVERVOLTAGE_RESTORE_MARGIN_V"].as<float>()
        : ctrl["OV_RESTORE_MARGIN_V"].as<float>();
      OVERVOLTAGE_RESTORE_MARGIN_V = max(0.0f, v);
    }
    if (ctrl.containsKey("MAX_ENERGY_CONSUMPTION_FOR_THR_DAY_WH") || ctrl.containsKey("MAX_ENERGY_CONSUMPTION_FOR_DAY_WH") || ctrl.containsKey("DAILY_ENERGY_CAP_WH")) {
      MAX_ENERGY_CONSUMPTION_FOR_THR_DAY_WH =
        ctrl.containsKey("MAX_ENERGY_CONSUMPTION_FOR_THR_DAY_WH") ? ctrl["MAX_ENERGY_CONSUMPTION_FOR_THR_DAY_WH"].as<float>()
      : (ctrl.containsKey("MAX_ENERGY_CONSUMPTION_FOR_DAY_WH") ? ctrl["MAX_ENERGY_CONSUMPTION_FOR_DAY_WH"].as<float>() : ctrl["DAILY_ENERGY_CAP_WH"].as<float>());
      if (MAX_ENERGY_CONSUMPTION_FOR_THR_DAY_WH < 0.0f) MAX_ENERGY_CONSUMPTION_FOR_THR_DAY_WH = 0.0f;
      energyGoalConfigTouched = true;
    }
    if (ctrl.containsKey("ENERGY_GOAL_DURATION_SEC") || ctrl.containsKey("ENERGY_GOAL_DURATION_MIN")) {
      float sec = ctrl.containsKey("ENERGY_GOAL_DURATION_SEC")
        ? ctrl["ENERGY_GOAL_DURATION_SEC"].as<float>()
        : (ctrl["ENERGY_GOAL_DURATION_MIN"].as<float>() * 60.0f);
      ENERGY_GOAL_DURATION_SEC = max(60.0f, sec);
      energyGoalConfigTouched = true;
    }
    if (ctrl.containsKey("ENERGY_GOAL_RATE_W_PER_MIN") || ctrl.containsKey("ENERGY_GOAL_W_PER_MIN")) {
      float rate = ctrl.containsKey("ENERGY_GOAL_RATE_W_PER_MIN")
        ? ctrl["ENERGY_GOAL_RATE_W_PER_MIN"].as<float>()
        : ctrl["ENERGY_GOAL_W_PER_MIN"].as<float>();
      rate = max(0.0f, rate);
      MAX_ENERGY_CONSUMPTION_FOR_THR_DAY_WH = rate * (ENERGY_GOAL_DURATION_SEC / 60.0f);
      energyGoalConfigTouched = true;
    }
    if (ctrl.containsKey("ENERGY_GOAL_WH")) {
      MAX_ENERGY_CONSUMPTION_FOR_THR_DAY_WH = max(0.0f, ctrl["ENERGY_GOAL_WH"].as<float>());
      energyGoalConfigTouched = true;
    }
    if (ctrl.containsKey("RESTORE_POWER_RATIO") || ctrl.containsKey("RESTORE_THRESHOLD_RATIO") || ctrl.containsKey("RESTORE_FACTOR")) {
      RESTORE_POWER_RATIO = clampf(
        ctrl.containsKey("RESTORE_POWER_RATIO") ? ctrl["RESTORE_POWER_RATIO"].as<float>()
        : (ctrl.containsKey("RESTORE_THRESHOLD_RATIO") ? ctrl["RESTORE_THRESHOLD_RATIO"].as<float>() : ctrl["RESTORE_FACTOR"].as<float>()),
        0.0f, 1.0f
      );
    }
    if (ctrl.containsKey("CONTROL_COOLDOWN_SEC") || ctrl.containsKey("CONTROL_COOLDOWN_S") || ctrl.containsKey("COOLDOWN_SEC")) {
      CONTROL_COOLDOWN_SEC = max(0.0f, ctrl.containsKey("CONTROL_COOLDOWN_SEC") ? ctrl["CONTROL_COOLDOWN_SEC"].as<float>()
                              : (ctrl.containsKey("CONTROL_COOLDOWN_S") ? ctrl["CONTROL_COOLDOWN_S"].as<float>() : ctrl["COOLDOWN_SEC"].as<float>()));
    }
    if (ctrl.containsKey("CLEAR_VOLTAGE_INJECTION") && ctrl["CLEAR_VOLTAGE_INJECTION"].as<bool>()) {
      clearVoltageInjection();
    }
    if (ctrl.containsKey("VOLTAGE_INJECTION_MAGNITUDE_V") || ctrl.containsKey("VOLTAGE_INJECT_V") || ctrl.containsKey("VOLTAGE_FAULT_MAGNITUDE_V")) {
      float v = ctrl.containsKey("VOLTAGE_INJECTION_MAGNITUDE_V")
        ? ctrl["VOLTAGE_INJECTION_MAGNITUDE_V"].as<float>()
        : (ctrl.containsKey("VOLTAGE_INJECT_V") ? ctrl["VOLTAGE_INJECT_V"].as<float>() : ctrl["VOLTAGE_FAULT_MAGNITUDE_V"].as<float>());
      voltageInjectionMagnitudeV = max(0.0f, v);
      if (voltageInjectionMagnitudeV <= 0.0f) {
        voltageInjectionMode = VOLTAGE_INJECTION_NONE;
      }
    }
    if (ctrl.containsKey("VOLTAGE_INJECTION_MODE") || ctrl.containsKey("VOLTAGE_SCENARIO") || ctrl.containsKey("VOLTAGE_FAULT_MODE")) {
      String modeStr = ctrl.containsKey("VOLTAGE_INJECTION_MODE")
        ? ctrl["VOLTAGE_INJECTION_MODE"].as<String>()
        : (ctrl.containsKey("VOLTAGE_SCENARIO") ? ctrl["VOLTAGE_SCENARIO"].as<String>() : ctrl["VOLTAGE_FAULT_MODE"].as<String>());
      VoltageInjectionMode parsedMode = VOLTAGE_INJECTION_NONE;
      if (parseVoltageInjectionMode(modeStr, parsedMode)) {
        voltageInjectionMode = parsedMode;
        if (parsedMode == VOLTAGE_INJECTION_NONE) {
          voltageInjectionMagnitudeV = 0.0f;
        }
      }
    }
    if (ctrl.containsKey("INJECT_UNDERVOLTAGE") && ctrl["INJECT_UNDERVOLTAGE"].as<bool>()) {
      voltageInjectionMode = VOLTAGE_INJECTION_UNDERVOLTAGE;
    }
    if (ctrl.containsKey("INJECT_OVERVOLTAGE") && ctrl["INJECT_OVERVOLTAGE"].as<bool>()) {
      voltageInjectionMode = VOLTAGE_INJECTION_OVERVOLTAGE;
    }
    if (ctrl.containsKey("EMERGENCY_STOP") || ctrl.containsKey("E_STOP")) {
      emergencyStopActive = ctrl.containsKey("EMERGENCY_STOP") ? ctrl["EMERGENCY_STOP"].as<bool>()
        : ctrl["E_STOP"].as<bool>();
      if (emergencyStopActive) {
        productionProcessEnabled = false;
        processLockActive = false;
        productionState = PROCESS_IDLE;
        forceAllLoadsOff(true);
      }
    }
    if (ctrl.containsKey("MIN_DEVICE_DUTY") || ctrl.containsKey("MIN_DUTY")) {
      MIN_DEVICE_DUTY = clampf(ctrl.containsKey("MIN_DEVICE_DUTY") ? ctrl["MIN_DEVICE_DUTY"].as<float>() : ctrl["MIN_DUTY"].as<float>(), 0.0f, 1.0f);
    }
    if (ctrl.containsKey("DUTY_STEP_SIZE") || ctrl.containsKey("DUTY_STEP")) {
      DUTY_STEP_SIZE = clampf(ctrl.containsKey("DUTY_STEP_SIZE") ? ctrl["DUTY_STEP_SIZE"].as<float>() : ctrl["DUTY_STEP"].as<float>(), 0.01f, 1.0f);
    }
    if (ctrl.containsKey("DUTY_RAMP_RATE_PER_SEC") || ctrl.containsKey("DUTY_RAMP_SEC")) {
      if (ctrl.containsKey("DUTY_RAMP_SEC")) {
        float sec = max(0.0f, ctrl["DUTY_RAMP_SEC"].as<float>());
        DUTY_RAMP_RATE_PER_SEC = (sec <= 0.0f) ? 0.0f : (1.0f / sec);
      } else {
        DUTY_RAMP_RATE_PER_SEC = max(0.0f, ctrl["DUTY_RAMP_RATE_PER_SEC"].as<float>());
      }
    }
    if (ctrl.containsKey("CRITICAL_MIN_DEVICE_DUTY") || ctrl.containsKey("CRITICAL_MIN_DUTY")) {
      CRITICAL_MIN_DEVICE_DUTY = clampf(ctrl.containsKey("CRITICAL_MIN_DEVICE_DUTY") ? ctrl["CRITICAL_MIN_DEVICE_DUTY"].as<float>() : ctrl["CRITICAL_MIN_DUTY"].as<float>(), 0.0f, 1.0f);
    }
    if (ctrl.containsKey("HEATER_WARM_TEMP_C")) HEATER_WARM_TEMP_C = ctrl["HEATER_WARM_TEMP_C"].as<float>();
    if (ctrl.containsKey("HEATER_DUTY_STEP_SIZE") || ctrl.containsKey("HEATER_DUTY_STEP")) {
      HEATER_DUTY_STEP_SIZE = clampf(ctrl.containsKey("HEATER_DUTY_STEP_SIZE") ? ctrl["HEATER_DUTY_STEP_SIZE"].as<float>() : ctrl["HEATER_DUTY_STEP"].as<float>(), 0.01f, 1.0f);
    }
    if (ctrl.containsKey("HEATER_HOT_OFF_TEMP_C")) HEATER_HOT_OFF_TEMP_C = ctrl["HEATER_HOT_OFF_TEMP_C"].as<float>();
    if (ctrl.containsKey("PREDICTION_DELAY_SEC") || ctrl.containsKey("PREDICTOR_DELAY_SEC")) {
      predictionApplyDelaySec = max(0.0f, ctrl.containsKey("PREDICTION_DELAY_SEC") ? ctrl["PREDICTION_DELAY_SEC"].as<float>() : ctrl["PREDICTOR_DELAY_SEC"].as<float>());
    }
    if (ctrl.containsKey("AI_SUGGESTION_SOURCE") || ctrl.containsKey("PREDICTION_SOURCE") || ctrl.containsKey("SUGGESTION_SOURCE")) {
      ack["ai_suggestion_source"] = "IGNORED (fused multi-source mode)";
    }
    if (ctrl.containsKey("AI_DYNAMIC_PROCESS") || ctrl.containsKey("ENABLE_AI_DYNAMIC_PROCESS")) {
      // Deprecated toggle: dynamic process is policy-driven (HYBRID / AI_PREFERRED).
    }
    if (ctrl.containsKey("CALIBRATE_CURRENT") || ctrl.containsKey("CALIBRATE_CURRENT_OFFSETS")) {
      bool doCal = ctrl.containsKey("CALIBRATE_CURRENT")
        ? ctrl["CALIBRATE_CURRENT"].as<bool>()
        : ctrl["CALIBRATE_CURRENT_OFFSETS"].as<bool>();
      if (doCal) {
        calibrateCurrentZeroOffsets();
      }
    }
    if (energyGoalConfigTouched) {
      resetEnergyGoalWindowState("config_changed", millis(), true);
    }

    JsonObject ackCtrl = ack.createNestedObject("control");
    ackCtrl["MAX_TOTAL_POWER_W"] = MAX_TOTAL_POWER_W;
    ackCtrl["UNDERVOLTAGE_THRESHOLD_V"] = UNDERVOLTAGE_THRESHOLD_V;
    ackCtrl["UNDERVOLTAGE_TRIP_DELAY_MS"] = UNDERVOLTAGE_TRIP_DELAY_MS;
    ackCtrl["UNDERVOLTAGE_CLEAR_DELAY_MS"] = UNDERVOLTAGE_CLEAR_DELAY_MS;
    ackCtrl["UNDERVOLTAGE_RESTORE_MARGIN_V"] = UNDERVOLTAGE_RESTORE_MARGIN_V;
    ackCtrl["UNDERVOLTAGE_ACTIVE"] = undervoltageActive;
    ackCtrl["OVERVOLTAGE_THRESHOLD_V"] = OVERVOLTAGE_THRESHOLD_V;
    ackCtrl["OVERVOLTAGE_TRIP_DELAY_MS"] = OVERVOLTAGE_TRIP_DELAY_MS;
    ackCtrl["OVERVOLTAGE_CLEAR_DELAY_MS"] = OVERVOLTAGE_CLEAR_DELAY_MS;
    ackCtrl["OVERVOLTAGE_RESTORE_MARGIN_V"] = OVERVOLTAGE_RESTORE_MARGIN_V;
    ackCtrl["OVERVOLTAGE_ACTIVE"] = overvoltageActive;
    ackCtrl["VOLTAGE_INJECTION_MODE"] = voltageInjectionModeToString(voltageInjectionMode);
    ackCtrl["VOLTAGE_INJECTION_MAGNITUDE_V"] = voltageInjectionMagnitudeV;
    ackCtrl["supply_v_raw"] = loadBusVoltageRawV;
    ackCtrl["supply_v_effective"] = loadBusVoltageV;
    ackCtrl["MAX_ENERGY_CONSUMPTION_FOR_THR_DAY_WH"] = MAX_ENERGY_CONSUMPTION_FOR_THR_DAY_WH;
    ackCtrl["ENERGY_GOAL_WH"] = MAX_ENERGY_CONSUMPTION_FOR_THR_DAY_WH;
    ackCtrl["ENERGY_GOAL_DURATION_SEC"] = ENERGY_GOAL_DURATION_SEC;
    ackCtrl["ENERGY_GOAL_DURATION_MIN"] = ENERGY_GOAL_DURATION_SEC / 60.0f;
    ackCtrl["ENERGY_GOAL_RATE_W_PER_MIN"] = (ENERGY_GOAL_DURATION_SEC > 0.0f)
      ? (MAX_ENERGY_CONSUMPTION_FOR_THR_DAY_WH / (ENERGY_GOAL_DURATION_SEC / 60.0f))
      : 0.0f;
    ackCtrl["ENERGY_GOAL_WINDOW_RESET_COUNT"] = energyGoalWindowResetCount;
    ackCtrl["ENERGY_GOAL_WINDOW_RESET_REASON"] = energyGoalWindowResetReason;
    ackCtrl["RESTORE_POWER_RATIO"] = RESTORE_POWER_RATIO;
    ackCtrl["CONTROL_COOLDOWN_SEC"] = CONTROL_COOLDOWN_SEC;
    ackCtrl["EMERGENCY_STOP"] = emergencyStopActive;
    ackCtrl["DUTY_RAMP_RATE_PER_SEC"] = DUTY_RAMP_RATE_PER_SEC;
    ackCtrl["DUTY_RAMP_SEC"] = (DUTY_RAMP_RATE_PER_SEC > 0.0f) ? (1.0f / DUTY_RAMP_RATE_PER_SEC) : 0.0f;
    ackCtrl["PREDICTION_DELAY_SEC"] = predictionApplyDelaySec;
    ackCtrl["AI_DYNAMIC_PROCESS"] = (controlPolicy == POLICY_AI_PREFERRED || controlPolicy == POLICY_HYBRID);
    String dynamicReason;
    PredictionInputSource dynamicSrc = PRED_SRC_LONG_RF;
    const bool dynamicAvailable = (selectDynamicProcessPredictionState(&dynamicSrc, &dynamicReason) != nullptr);
    ackCtrl["AI_SUGGESTION_SOURCE"] = "FUSED";
    ackCtrl["AI_ACTIVE_SOURCES"] = activePredictionSourcesSummary();
    ackCtrl["AI_DYNAMIC_PROCESS_AVAILABLE"] = dynamicAvailable;
    ackCtrl["AI_DYNAMIC_PROCESS_REASON"] = dynamicReason;
    ackCtrl["AI_DYNAMIC_PROCESS_SOURCE"] = dynamicAvailable ? predictionSourceToString(dynamicSrc) : "NONE";
  }

  // Timing block
  if (root.containsKey("timing")) {
    JsonObject timing = root["timing"].as<JsonObject>();
    if (timing.containsKey("SAMPLE_INTERVAL_SEC") || timing.containsKey("DT_SEC")) {
      SAMPLE_INTERVAL_SEC = timing.containsKey("SAMPLE_INTERVAL_SEC") ? timing["SAMPLE_INTERVAL_SEC"].as<float>() : timing["DT_SEC"].as<float>();
      SAMPLE_INTERVAL_SEC = max(0.1f, SAMPLE_INTERVAL_SEC);
      sampleIntervalMs = (unsigned long)(SAMPLE_INTERVAL_SEC * 1000.0f);
    }
    JsonObject ackTiming = ack.createNestedObject("timing");
    ackTiming["SAMPLE_INTERVAL_SEC"] = SAMPLE_INTERVAL_SEC;
  }

  // Environment override (sensor + optional offset source)
  if (root.containsKey("environment")) {
    JsonObject env = root["environment"].as<JsonObject>();
    if (env.containsKey("temperature_c")) ambientTempC = env["temperature_c"].as<float>();
    if (env.containsKey("humidity_pct")) ambientHumidity = env["humidity_pct"].as<float>();
  }

  // Device commands
  if (root.containsKey("device")) {
    String dev = root["device"].as<String>();
    dev.toLowerCase();
    JsonObject setObj;
    const bool hasSet = root.containsKey("set") && root["set"].is<JsonObject>();
    if (hasSet) {
      setObj = root["set"].as<JsonObject>();
    }
    bool injectionOnly = false;
    bool faultConfigOnly = false;
    if (hasSet) {
      bool sawKey = false;
      injectionOnly = true;
      faultConfigOnly = true;
      for (JsonPair kv : setObj) {
        sawKey = true;
        const char* key = kv.key().c_str();
        if (strcmp(key, "inject_current_a") != 0
            && strcmp(key, "fault_inject_a") != 0
            && strcmp(key, "clear_inject") != 0) {
          injectionOnly = false;
        }
        if (strcmp(key, "inject_current_a") != 0
            && strcmp(key, "fault_inject_a") != 0
            && strcmp(key, "clear_inject") != 0
            && strcmp(key, "override") != 0
            && strcmp(key, "policy_override") != 0
            && strcmp(key, "fault_limit_a") != 0
            && strcmp(key, "fault_trip_ms") != 0
            && strcmp(key, "fault_trip_delay_ms") != 0
            && strcmp(key, "fault_clear_ms") != 0
            && strcmp(key, "fault_clear_delay_ms") != 0
            && strcmp(key, "fault_restore_ms") != 0
            && strcmp(key, "fault_restore_delay_ms") != 0
            && strcmp(key, "clear_fault") != 0) {
          faultConfigOnly = false;
        }
      }
      if (!sawKey) {
        injectionOnly = false;
        faultConfigOnly = false;
      }
    }
    bool nonActuationSetOnly = injectionOnly || faultConfigOnly;
    if (emergencyStopActive && hasSet && !nonActuationSetOnly) {
      ack["ok"] = false;
      ack["msg"] = "emergency_stop_active";
      ack["device"] = dev;
      publishAck(ack, doc);
      return;
    }
    if (hasSet) {
      LoadChannel* ld = findLoadByName(dev);
      if (ld && ld->faultActive) {
        bool wantsOn = setObj.containsKey("on") && setObj["on"].as<bool>();
        bool wantsDuty = setObj.containsKey("duty") && (setObj["duty"].as<float>() > 0.0f);
        if (wantsOn || wantsDuty) {
          ack["ok"] = false;
          ack["msg"] = "device_fault_lockout";
          ack["device"] = dev;
          ack["fault_code"] = ld->faultCode;
          publishAck(ack, doc);
          return;
        }
      }
      handleDeviceSet(dev, setObj);
    }
    if (root.containsKey("meta")) handleDeviceMeta(dev, root["meta"].as<JsonObject>());
    ack["device"] = dev;
  }

  publishAck(ack, doc);
}

void handlePredictionMessage(const String& payload, PredictionInputSource source) {
  PredictionChannelState& state = predictionStateFor(source);
  StaticJsonDocument<1024> doc;
  if (deserializeJson(doc, payload) != DeserializationError::Ok) return;
  JsonObject root = doc.as<JsonObject>();
  state.pendingSourceTimestampSec = normalizePredictionTimestampSec(root["timestamp"] | 0.0);
  state.pendingHorizonSec = root["horizon_sec"] | 0.0f;
  state.pendingSourceMode = String((const char*)(root["predictor_mode"] | "UNSET"));
  state.pendingSourceMode.toUpperCase();
  state.pendingSourceModelReady = root.containsKey("model_ready")
    ? root["model_ready"].as<bool>()
    : true;
  state.pendingPeakRisk = root["peak_risk"] | false;
  state.pendingRiskLevel = String((const char*)(root["risk_level"] | "LOW"));
  state.pendingPowerW = root["predicted_power_w"] | 0.0f;

  state.pendingSuggestionCount = 0;
  if (root.containsKey("suggestions") && root["suggestions"].is<JsonArray>()) {
    JsonArray arr = root["suggestions"].as<JsonArray>();
    for (JsonObject s : arr) {
      if (state.pendingSuggestionCount >= MAX_AI_SUGGESTIONS) break;
      if (!s.containsKey("device") || !s.containsKey("set")) continue;
      JsonObject setObj = s["set"].as<JsonObject>();

      AISuggestion item;
      item.deviceName = String((const char*)s["device"]);
      item.deviceName.toLowerCase();
      if (setObj.containsKey("on")) {
        item.hasOn = true;
        item.onValue = setObj["on"].as<bool>();
      }
      if (setObj.containsKey("duty")) {
        item.hasDuty = true;
        item.dutyValue = setObj["duty"].as<float>();
      }
      if (s.containsKey("process_mode")) {
        ProductionState parsedMode;
        String processModeText = String((const char*)s["process_mode"]);
        if (parseProductionState(processModeText, parsedMode)) {
          item.hasProcessMode = true;
          item.processMode = parsedMode;
        }
      }
      state.pendingSuggestions[state.pendingSuggestionCount++] = item;
    }
  }
  state.pendingApplyAtMs = millis() + (unsigned long)(predictionApplyDelaySec * 1000.0f);
  state.pendingReady = true;
}

void mqttCallback(char* topic, byte* payload, unsigned int length) {
  String body;
  body.reserve(length + 1);
  for (unsigned int i = 0; i < length; ++i) body += (char)payload[i];

