Omzlaw/iot-based-industrial-energy-monitoring-and-predictive-load-management-system/MSc Project/Arduino/esp32_digital_twin_controller/esp32_digital_twin_controller.ino
  String t = String(topic);
  if (t == topicCommand) {
    handleCommandMessage(body);
  } else if (t == topicPrediction) {
    handlePredictionMessage(body, PRED_SRC_SHORT);
  } else if (t == topicPredictionLong) {
    handlePredictionMessage(body, PRED_SRC_LONG_RF);
  } else if (t == topicPredictionLongLstm) {
    handlePredictionMessage(body, PRED_SRC_LONG_LSTM);
  }
}

void applyPendingPredictionIfDue() {
  const unsigned long nowMs = millis();
  for (int idx = 0; idx < PREDICTION_SOURCE_COUNT; ++idx) {
    PredictionInputSource src = (idx == 1) ? PRED_SRC_LONG_RF : ((idx == 2) ? PRED_SRC_LONG_LSTM : PRED_SRC_SHORT);
    PredictionChannelState& state = predictionStateFor(src);
    if (!state.pendingReady) continue;
    if (nowMs < state.pendingApplyAtMs) continue;

    state.peakRisk = state.pendingPeakRisk;
    state.riskLevel = state.pendingRiskLevel;
    state.powerW = state.pendingPowerW;
    state.sourceTimestampSec = state.pendingSourceTimestampSec;
    state.horizonSec = state.pendingHorizonSec;
    state.sourceMode = state.pendingSourceMode;
    state.sourceModelReady = state.pendingSourceModelReady;
    state.lastAppliedMs = nowMs;
    state.applied = true;
    state.suggestionCount = state.pendingSuggestionCount;
    for (int i = 0; i < state.pendingSuggestionCount; ++i) {
      state.suggestions[i] = state.pendingSuggestions[i];
    }
    state.pendingReady = false;
  }
  rebuildFusedPredictionState();
}

// -----------------------------
// WiFi + MQTT lifecycle
// -----------------------------
static bool beginEnterpriseWifiConnection(const String& ssid,
                                          const String& pskFallback,
                                          const char* eapIdentity,
                                          const char* eapUsername,
                                          const char* eapPassword) {
  const char* identity = (strlen(eapIdentity) > 0) ? eapIdentity : eapUsername;
  const char* username = (strlen(eapUsername) > 0) ? eapUsername : identity;
  const char* password = (strlen(eapPassword) > 0) ? eapPassword : pskFallback.c_str();

  if (ssid.length() == 0 || strlen(username) == 0 || strlen(password) == 0) {
    Serial.println("[net] enterprise WiFi config incomplete (ssid/identity/username/password)");
    return false;
  }

#if DT_HAS_WIFI_EAP_CLIENT
  esp_wifi_sta_enterprise_disable();
  esp_eap_client_set_identity((const uint8_t*)identity, strlen(identity));
  esp_eap_client_set_username((const uint8_t*)username, strlen(username));
  esp_eap_client_set_password((const uint8_t*)password, strlen(password));
  esp_wifi_sta_enterprise_enable();
  WiFi.begin(ssid.c_str());
  return true;
#elif DT_HAS_WIFI_WPA2_ENTERPRISE
  esp_wifi_sta_wpa2_ent_disable();
  esp_wifi_sta_wpa2_ent_set_identity((uint8_t*)identity, strlen(identity));
  esp_wifi_sta_wpa2_ent_set_username((uint8_t*)username, strlen(username));
  esp_wifi_sta_wpa2_ent_set_password((uint8_t*)password, strlen(password));
  esp_wpa2_config_t wpa2Config = WPA2_CONFIG_INIT_DEFAULT();
  esp_wifi_sta_wpa2_ent_enable(&wpa2Config);
  WiFi.begin(ssid.c_str());
  return true;
#else
  Serial.println("[net] enterprise WiFi requested but this ESP32 core lacks enterprise APIs");
  return false;
#endif
}

static void disableEnterpriseWifi() {
#if DT_HAS_WIFI_EAP_CLIENT
  esp_wifi_sta_enterprise_disable();
#elif DT_HAS_WIFI_WPA2_ENTERPRISE
  esp_wifi_sta_wpa2_ent_disable();
#endif
}

static bool connectWifiProfile(const String& ssid,
                               const String& pskPassword,
                               bool useEnterprise,
                               const char* eapIdentity,
                               const char* eapUsername,
                               const char* eapPassword) {
  if (ssid.length() == 0) return false;

  Serial.printf("[net] trying SSID '%s'%s",
                ssid.c_str(),
                useEnterprise ? " (enterprise)" : "");
  WiFi.disconnect(true, true);
  delay(120);

  bool beginStarted = false;
  if (useEnterprise) {
    beginStarted = beginEnterpriseWifiConnection(ssid, pskPassword, eapIdentity, eapUsername, eapPassword);
  } else {
    disableEnterpriseWifi();
    WiFi.begin(ssid.c_str(), pskPassword.c_str());
    beginStarted = true;
  }
  if (!beginStarted) {
    Serial.println(" failed to start");
    return false;
  }

  const unsigned long startMs = millis();
  while (WiFi.status() != WL_CONNECTED && (millis() - startMs) < WIFI_CONNECT_TIMEOUT_MS) {
    delay(500);
    Serial.print(".");
  }
  if (WiFi.status() == WL_CONNECTED) {
    Serial.println(" connected");
    return true;
  }
  Serial.println(" timeout");
  return false;
}

void ensureWifiConnected() {
  static unsigned long lastWifiAttemptMs = 0;
  if (WiFi.status() == WL_CONNECTED) return;
  WiFi.mode(WIFI_STA);
  if (lastWifiAttemptMs != 0 && (millis() - lastWifiAttemptMs) < WIFI_RETRY_BACKOFF_MS) return;
  lastWifiAttemptMs = millis();

  if (connectWifiProfile(runtimeConfig.wifiSsid,
                         runtimeConfig.wifiPassword,
                         WIFI_USE_ENTERPRISE,
                         DEFAULT_WIFI_EAP_IDENTITY,
                         DEFAULT_WIFI_EAP_USERNAME,
                         DEFAULT_WIFI_EAP_PASSWORD)) {
    WiFi.setSleep(false);
    configTime(0, 0, "pool.ntp.org", "time.nist.gov");
    return;
  }

  if (strlen(FALLBACK_WIFI_SSID) > 0 && String(FALLBACK_WIFI_SSID) != runtimeConfig.wifiSsid) {
    Serial.println("[net] primary WiFi failed, trying fallback SSID");
    if (connectWifiProfile(String(FALLBACK_WIFI_SSID),
                           String(FALLBACK_WIFI_PASSWORD),
                           WIFI_FALLBACK_USE_ENTERPRISE,
                           FALLBACK_WIFI_EAP_IDENTITY,
                           FALLBACK_WIFI_EAP_USERNAME,
                           FALLBACK_WIFI_EAP_PASSWORD)) {
      WiFi.setSleep(false);
      configTime(0, 0, "pool.ntp.org", "time.nist.gov");
      return;
    }
  }

  Serial.println("[net] WiFi connection failed; retrying shortly");
}

void ensureOtaReady() {
  if (WiFi.status() != WL_CONNECTED) {
    otaStarted = false;
    return;
  }
  if (otaStarted) return;
  ArduinoOTA.setHostname(OTA_HOSTNAME);
  if (strlen(OTA_PASSWORD) > 0) {
    ArduinoOTA.setPassword(OTA_PASSWORD);
  }
  ArduinoOTA.onStart([]() {
    Serial.println("[ota] start");
  });
  ArduinoOTA.onEnd([]() {
    Serial.println("[ota] end");
  });
  ArduinoOTA.onError([](ota_error_t error) {
    Serial.printf("[ota] error=%u\n", error);
  });
  ArduinoOTA.begin();
  otaStarted = true;
  Serial.printf("[ota] ready (host=%s)\n", OTA_HOSTNAME);
}

void ensureMqttConnected() {
  if (mqttClient.connected()) return;

  while (!mqttClient.connected()) {
    Serial.print("[mqtt] connecting...");
    String clientId = "esp32-" + String(PLANT_IDENTIFIER) + "-" + String((uint32_t)ESP.getEfuseMac(), HEX);
    bool ok = mqttClient.connect(clientId.c_str(), runtimeConfig.mqttUsername.c_str(), runtimeConfig.mqttPassword.c_str());
    if (ok) {
      Serial.println(" connected");
      mqttClient.subscribe(topicCommand.c_str());
      mqttClient.subscribe(topicPrediction.c_str());
      mqttClient.subscribe(topicPredictionLong.c_str());
      mqttClient.subscribe(topicPredictionLongLstm.c_str());
    } else {
      Serial.print(" failed rc=");
      Serial.print(mqttClient.state());
      Serial.println(" retry in 2s");
      delay(2000);
    }
  }
}

