Omzlaw/iot-based-industrial-energy-monitoring-and-predictive-load-management-system/MSc Project/Arduino/esp32_digital_twin_controller/esp32_digital_twin_controller.ino
// -----------------------------
// Telemetry + serial print
// -----------------------------
void publishTelemetry(float totalPowerW, float totalCurrentA) {
  // Keep this static to avoid large stack pressure in loopTask.
  static StaticJsonDocument<10240> doc;
  doc.clear();
  const unsigned long nowMs = millis();
  float runtimeSec = max(1.0f, millis() / 1000.0f);
  float energy10mWh = getWindowEnergyWh(10);
  float energy30mWh = getWindowEnergyWh(30);
  float energy1hWh = getWindowEnergyWh(60);
  float energy1dWh = getWindowEnergyWh(24 * 60);
  float energyGoalWh = MAX_ENERGY_CONSUMPTION_FOR_THR_DAY_WH;
  ensureEnergyGoalWindowConfigured(nowMs);
  advanceEnergyGoalWindowToMs(nowMs, "window_completed");
  float goalWindowWh = getCurrentEnergyGoalWindowWh();
  float energyLeftGoalWh = (energyGoalWh > 0.0f) ? max(0.0f, energyGoalWh - goalWindowWh) : 0.0f;
  float energyUsedRatioGoal = (energyGoalWh > 0.0f) ? (goalWindowWh / energyGoalWh) : 0.0f;
  unsigned long goalWindowDurationMs = energyGoalWindowDurationMs();
  unsigned long goalWindowElapsedMs = (energyGoalWindowStartMs > 0 && nowMs >= energyGoalWindowStartMs)
    ? (nowMs - energyGoalWindowStartMs)
    : 0UL;
  unsigned long goalWindowRemainingMs = (goalWindowElapsedMs >= goalWindowDurationMs)
    ? 0UL
    : (goalWindowDurationMs - goalWindowElapsedMs);
  float goalWindowRemainingSec = goalWindowRemainingMs / 1000.0f;
  float goalWindowRemainingRatio = (goalWindowDurationMs > 0)
    ? ((float)goalWindowRemainingMs / (float)goalWindowDurationMs)
    : 0.0f;
  double goalWindowNowEpochSec = (double)time(nullptr);
  String goalWindowStartedAtUtc = (goalWindowNowEpochSec >= 100000.0 && energyGoalWindowStartMs > 0)
    ? isoTimestampUtcForEpoch((time_t)(goalWindowNowEpochSec - (double)goalWindowElapsedMs / 1000.0))
    : String("UNSYNCED_") + String(energyGoalWindowStartMs);
  String goalWindowEndsAtUtc = (goalWindowNowEpochSec >= 100000.0)
    ? isoTimestampUtcForEpoch((time_t)(goalWindowNowEpochSec + (double)goalWindowRemainingMs / 1000.0))
    : String("UNSYNCED_") + String(nowMs + goalWindowRemainingMs);

  doc["timestamp"] = isoTimestampUtc();

  JsonObject system = doc.createNestedObject("system");
  system["timestamp"] = nowMs / 1000.0;
  system["plant_id"] = PLANT_IDENTIFIER;
  system["mode"] = "PROCESS";
  system["control_policy"] = controlPolicyToString(controlPolicy);
  system["predictor_mode"] = predictorMode;
  String activeSources = activePredictionSourcesSummary();
  system["ai_suggestion_source"] = "FUSED";
  system["ai_source_active"] = activeSources;
  system["ai_dynamic_process"] = (controlPolicy == POLICY_AI_PREFERRED || controlPolicy == POLICY_HYBRID);
  String aiDynamicReason;
  PredictionInputSource dynamicProcessSrc = PRED_SRC_LONG_RF;
  const bool aiDynamicAvailable = (selectDynamicProcessPredictionState(&dynamicProcessSrc, &aiDynamicReason) != nullptr);
  system["ai_dynamic_process_available"] = aiDynamicAvailable;
  system["ai_dynamic_process_reason"] = aiDynamicReason;
  system["ai_dynamic_process_source"] = aiDynamicAvailable ? predictionSourceToString(dynamicProcessSrc) : "NONE";
  system["predictor_source_mode"] = predictorSourceMode;
  system["predictor_source_model_ready"] = predictorSourceModelReady;
  system["predictor_source_age_ms"] = (predictorLastAppliedMs == 0) ? -1.0f : (float)(nowMs - predictorLastAppliedMs);
  JsonObject predictionSources = system.createNestedObject("prediction_sources");
  for (int idx = 0; idx < PREDICTION_SOURCE_COUNT; ++idx) {
    PredictionInputSource src = (idx == 1) ? PRED_SRC_LONG_RF : ((idx == 2) ? PRED_SRC_LONG_LSTM : PRED_SRC_SHORT);
    const PredictionChannelState& srcState = predictionStateForConst(src);
    JsonObject srcJson = predictionSources.createNestedObject(predictionSourceKey(src));
    srcJson["applied"] = srcState.applied;
    srcJson["fresh"] = predictionStateIsFresh(srcState, nowMs);
    srcJson["mode"] = srcState.sourceMode;
    srcJson["model_ready"] = srcState.sourceModelReady;
    srcJson["age_ms"] = (srcState.lastAppliedMs == 0) ? -1.0f : (float)(nowMs - srcState.lastAppliedMs);
    srcJson["peak_risk"] = srcState.peakRisk;
    srcJson["risk_level"] = srcState.riskLevel;
    srcJson["predicted_power_w"] = srcState.powerW;
    srcJson["horizon_sec"] = srcState.horizonSec;
    srcJson["suggestion_count"] = srcState.suggestionCount;
  }
  system["emergency_stop"] = emergencyStopActive;
  system["season"] = "N/A";
  system["tariff_state"] = tariffState;
  system["peak_event"] = peakEvent;
  system["supply_v"] = loadBusVoltageV;
  system["supply_v_raw"] = loadBusVoltageRawV;
  system["total_power_w"] = totalPowerW;
  system["total_current_a"] = totalCurrentA;
  system["MAX_TOTAL_POWER_W"] = MAX_TOTAL_POWER_W;
  system["VOLTAGE_INJECTION_MODE"] = voltageInjectionModeToString(voltageInjectionMode);
  system["VOLTAGE_INJECTION_MAGNITUDE_V"] = voltageInjectionMagnitudeV;
  system["VOLTAGE_INJECTION_ACTIVE"] = (voltageInjectionMode != VOLTAGE_INJECTION_NONE) && (voltageInjectionMagnitudeV > 0.0f);
  system["UNDERVOLTAGE_THRESHOLD_V"] = UNDERVOLTAGE_THRESHOLD_V;
  system["UNDERVOLTAGE_TRIP_DELAY_MS"] = UNDERVOLTAGE_TRIP_DELAY_MS;
  system["UNDERVOLTAGE_CLEAR_DELAY_MS"] = UNDERVOLTAGE_CLEAR_DELAY_MS;
  system["UNDERVOLTAGE_RESTORE_MARGIN_V"] = UNDERVOLTAGE_RESTORE_MARGIN_V;
  system["UNDERVOLTAGE_ACTIVE"] = undervoltageActive;
  system["OVERVOLTAGE_THRESHOLD_V"] = OVERVOLTAGE_THRESHOLD_V;
  system["OVERVOLTAGE_TRIP_DELAY_MS"] = OVERVOLTAGE_TRIP_DELAY_MS;
  system["OVERVOLTAGE_CLEAR_DELAY_MS"] = OVERVOLTAGE_CLEAR_DELAY_MS;
  system["OVERVOLTAGE_RESTORE_MARGIN_V"] = OVERVOLTAGE_RESTORE_MARGIN_V;
  system["OVERVOLTAGE_ACTIVE"] = overvoltageActive;
  system["CONTROL_COOLDOWN_SEC"] = CONTROL_COOLDOWN_SEC;
  system["SAMPLE_INTERVAL_SEC"] = SAMPLE_INTERVAL_SEC;
  system["MAX_ENERGY_CONSUMPTION_FOR_THR_DAY_WH"] = energyGoalWh;
  system["ENERGY_GOAL_VALUE_WH"] = energyGoalWh;
  system["ENERGY_GOAL_DURATION_SEC"] = ENERGY_GOAL_DURATION_SEC;
  system["ENERGY_GOAL_DURATION_MIN"] = ENERGY_GOAL_DURATION_SEC / 60.0f;
  system["ENERGY_GOAL_RATE_W_PER_MIN"] = (ENERGY_GOAL_DURATION_SEC > 0.0f)
    ? (energyGoalWh / (ENERGY_GOAL_DURATION_SEC / 60.0f))
    : 0.0f;
  system["ENERGY_CONSUMED_1D_WH"] = energy1dWh;
  system["ENERGY_REMAINING_1D_WH"] = (energyGoalWh > 0.0f) ? max(0.0f, energyGoalWh - energy1dWh) : 0.0f;
  system["ENERGY_USED_RATIO_1D"] = (energyGoalWh > 0.0f) ? (energy1dWh / energyGoalWh) : 0.0f;
  system["ENERGY_CONSUMED_GOAL_WINDOW_WH"] = goalWindowWh;
  system["ENERGY_REMAINING_GOAL_WINDOW_WH"] = energyLeftGoalWh;
  system["ENERGY_USED_RATIO_GOAL_WINDOW"] = energyUsedRatioGoal;
  system["ENERGY_GOAL_WINDOW_STARTED_AT_UTC"] = goalWindowStartedAtUtc;
  system["ENERGY_GOAL_WINDOW_ENDS_AT_UTC"] = goalWindowEndsAtUtc;
  system["ENERGY_GOAL_WINDOW_ELAPSED_SEC"] = goalWindowElapsedMs / 1000.0f;
  system["ENERGY_GOAL_WINDOW_REMAINING_SEC"] = goalWindowRemainingSec;
  system["ENERGY_GOAL_WINDOW_REMAINING_RATIO"] = goalWindowRemainingRatio;
  system["ENERGY_GOAL_WINDOW_RESET_COUNT"] = energyGoalWindowResetCount;
  system["ENERGY_GOAL_WINDOW_RESET_REASON"] = energyGoalWindowResetReason;
  system["scene_enabled"] = sceneEnabled;
  system["scene_lock_active"] = sceneLockActive;
  system["scene_name"] = sceneName;
  system["scene_duration_sec"] = sceneDurationSec;
  JsonObject scene = system.createNestedObject("scene");
  scene["enabled"] = sceneEnabled;
  scene["lock_active"] = sceneLockActive;
  scene["name"] = sceneName;
  scene["duration_sec"] = sceneDurationSec;
  scene["loop"] = sceneLoop;
  scene["elapsed_sec"] = sceneEnabled ? ((millis() - sceneStartMs) / 1000.0f) : 0.0f;
  if (!isnan(sceneTargetTempC)) scene["target_temperature_c"] = sceneTargetTempC;
  if (!isnan(sceneTargetHumidityPct)) scene["target_humidity_pct"] = sceneTargetHumidityPct;
  JsonObject sceneOverrides = scene.createNestedObject("overrides");
  if (sceneOverrideModeEnabled) sceneOverrides["mode"] = plantModeToString(sceneOverrideMode);
  if (sceneOverrideSeasonEnabled) sceneOverrides["season"] = seasonModeToString(sceneOverrideSeason);
  if (sceneOverridePolicyEnabled) sceneOverrides["control_policy"] = controlPolicyToString(sceneOverridePolicy);
  if (sceneOverrideTariffEnabled) sceneOverrides["tariff_state"] = sceneOverrideTariffState;
  if (sceneOverridePeakEnabled) sceneOverrides["peak_event"] = sceneOverridePeakEvent;
  if (sceneOverrideTempEnabled || sceneOverrideHumidityEnabled) {
    JsonObject sceneOverrideEnv = sceneOverrides.createNestedObject("environment");
    if (sceneOverrideTempEnabled) sceneOverrideEnv["temperature_c"] = sceneOverrideTempC;
    if (sceneOverrideHumidityEnabled) sceneOverrideEnv["humidity_pct"] = sceneOverrideHumidityPct;
  }
  system["total_energy_wh"] = cumulativeEnergyWh;
  bool processGoalReached = (processCycleCount >= PRODUCTION_GOAL_CYCLES);
  JsonObject productionGoal = system.createNestedObject("production_goal");
  productionGoal["enabled"] = productionProcessEnabled;
  productionGoal["lock_active"] = processLockActive;
  productionGoal["state"] = productionStateToString(productionState);
  productionGoal["cycle_count"] = processCycleCount;
  productionGoal["goal_cycles"] = PRODUCTION_GOAL_CYCLES;
  productionGoal["goal_reached"] = processGoalReached;

