Omzlaw/iot-based-industrial-energy-monitoring-and-predictive-load-management-system/MSc Project/Arduino/esp32_digital_twin_controller/esp32_digital_twin_controller.ino
  JsonObject env = doc.createNestedObject("environment");
  env["temperature_c"] = ambientTempC;
  env["humidity_pct"] = ambientHumidity;

  JsonObject process = doc.createNestedObject("process");
  process["enabled"] = productionProcessEnabled;
  process["lock_active"] = processLockActive;
  process["state"] = productionStateToString(productionState);
  process["cycle_count"] = processCycleCount;
  process["goal_cycles"] = PRODUCTION_GOAL_CYCLES;
  process["goal_reached"] = processGoalReached;
  process["elapsed_sec"] = productionProcessEnabled ? ((millis() - processStartMs) / 1000.0f) : 0.0f;
  process["tank_height_cm"] = TANK1_HEIGHT_CM;
  process["tank1_height_cm"] = TANK1_HEIGHT_CM;
  process["tank2_height_cm"] = TANK2_HEIGHT_CM;
  process["tank_low_level_pct"] = TANK1_LOW_LEVEL_PCT;
  process["tank_high_level_pct"] = TANK1_HIGH_LEVEL_PCT;
  process["tank1_low_level_pct"] = TANK1_LOW_LEVEL_PCT;
  process["tank2_low_level_pct"] = TANK2_LOW_LEVEL_PCT;
  process["tank1_high_level_pct"] = TANK1_HIGH_LEVEL_PCT;
  process["tank2_high_level_pct"] = TANK2_HIGH_LEVEL_PCT;
  process["tank1_level_valid"] = tank1LevelValid;
  process["tank2_level_valid"] = tank2LevelValid;
  // Flat aliases keep compatibility with frontends/parsers expecting non-nested fields.
  if (tank1LevelValid) process["tank1_level_pct"] = tank1LevelPct;
  else process["tank1_level_pct"] = nullptr;
  if (tank2LevelValid) process["tank2_level_pct"] = tank2LevelPct;
  else process["tank2_level_pct"] = nullptr;
  process["tank1_temp_c"] = tank1TempC;
  process["tank2_temp_c"] = tank2TempC;
  process["tank1_temp_target_c"] = tank1EffectiveTempTargetC();
  process["tank2_temp_target_c"] = tank2EffectiveTempTargetC();
  process["temp_target_step_per_cycle_c"] = PROCESS_TEMP_TARGET_STEP_PER_CYCLE_C;
  if (tank1LevelValid && !isnan(tank1DistanceCm)) process["tank1_ultrasonic_distance_cm"] = tank1DistanceCm;
  else process["tank1_ultrasonic_distance_cm"] = nullptr;
  if (tank2LevelValid && !isnan(tank2DistanceCm)) process["tank2_ultrasonic_distance_cm"] = tank2DistanceCm;
  else process["tank2_ultrasonic_distance_cm"] = nullptr;
  if (!isnan(tank1RawDistanceCm)) process["tank1_ultrasonic_raw_cm"] = tank1RawDistanceCm;
  else process["tank1_ultrasonic_raw_cm"] = nullptr;
  if (!isnan(tank2RawDistanceCm)) process["tank2_ultrasonic_raw_cm"] = tank2RawDistanceCm;
  else process["tank2_ultrasonic_raw_cm"] = nullptr;
  JsonObject tank1 = process.createNestedObject("tank1");
  tank1["level_valid"] = tank1LevelValid;
  if (tank1LevelValid) tank1["level_pct"] = tank1LevelPct;
  else tank1["level_pct"] = nullptr;
  tank1["temperature_c"] = tank1TempC;
  tank1["target_level_pct"] = TANK1_LEVEL_TARGET_PCT;
  tank1["target_temp_base_c"] = TANK1_TEMP_TARGET_C;
  tank1["target_temp_c"] = tank1EffectiveTempTargetC();
  tank1["height_cm"] = TANK1_HEIGHT_CM;
  tank1["low_level_pct"] = TANK1_LOW_LEVEL_PCT;
  tank1["high_level_pct"] = TANK1_HIGH_LEVEL_PCT;
  if (tank1LevelValid && !isnan(tank1DistanceCm)) tank1["ultrasonic_distance_cm"] = tank1DistanceCm;
  else tank1["ultrasonic_distance_cm"] = nullptr;
  if (!isnan(tank1RawDistanceCm)) tank1["ultrasonic_raw_cm"] = tank1RawDistanceCm;
  else tank1["ultrasonic_raw_cm"] = nullptr;
  JsonObject tank2 = process.createNestedObject("tank2");
  tank2["level_valid"] = tank2LevelValid;
  if (tank2LevelValid) tank2["level_pct"] = tank2LevelPct;
  else tank2["level_pct"] = nullptr;
  tank2["temperature_c"] = tank2TempC;
  tank2["target_level_pct"] = TANK2_LEVEL_TARGET_PCT;
  tank2["target_temp_base_c"] = TANK2_TEMP_TARGET_C;
  tank2["target_temp_c"] = tank2EffectiveTempTargetC();
  tank2["height_cm"] = TANK2_HEIGHT_CM;
  tank2["low_level_pct"] = TANK2_LOW_LEVEL_PCT;
  tank2["high_level_pct"] = TANK2_HIGH_LEVEL_PCT;
  if (tank2LevelValid && !isnan(tank2DistanceCm)) tank2["ultrasonic_distance_cm"] = tank2DistanceCm;
  else tank2["ultrasonic_distance_cm"] = nullptr;
  if (!isnan(tank2RawDistanceCm)) tank2["ultrasonic_raw_cm"] = tank2RawDistanceCm;
  else tank2["ultrasonic_raw_cm"] = nullptr;
  JsonObject processKpi = process.createNestedObject("kpi");
  processKpi["balance_delta_level_pct"] = fabs(tank1LevelPct - tank2LevelPct);

  JsonObject energy = doc.createNestedObject("energy");
  energy["total_energy_wh"] = cumulativeEnergyWh;
  energy["window_wh_10m"] = energy10mWh;
  energy["window_wh_30m"] = energy30mWh;
  energy["window_wh_1h"] = energy1hWh;
  energy["window_wh_1d"] = energy1dWh;
  JsonObject budget = energy.createNestedObject("budget");
  budget["goal_window_wh"] = energyGoalWh;
  budget["window_duration_sec"] = ENERGY_GOAL_DURATION_SEC;
  budget["window_duration_min"] = ENERGY_GOAL_DURATION_SEC / 60.0f;
  budget["consumed_window_wh"] = goalWindowWh;
  budget["remaining_window_wh"] = energyLeftGoalWh;
  budget["used_ratio_window"] = energyUsedRatioGoal;
  budget["started_at_utc"] = goalWindowStartedAtUtc;
  budget["ends_at_utc"] = goalWindowEndsAtUtc;
  budget["elapsed_sec"] = goalWindowElapsedMs / 1000.0f;
  budget["remaining_sec"] = goalWindowRemainingSec;
  budget["remaining_ratio"] = goalWindowRemainingRatio;
  budget["reset_count"] = energyGoalWindowResetCount;
  budget["reset_reason"] = energyGoalWindowResetReason;
  // legacy aliases
  budget["goal_1d_wh"] = energyGoalWh;
  budget["consumed_1d_wh"] = energy1dWh;
  budget["remaining_1d_wh"] = (energyGoalWh > 0.0f) ? max(0.0f, energyGoalWh - energy1dWh) : 0.0f;
  budget["used_ratio_1d"] = (energyGoalWh > 0.0f) ? (energy1dWh / energyGoalWh) : 0.0f;
  energy["avg_power_w_10m"] = (energy10mWh * 3600.0f) / min(runtimeSec, 10.0f * 60.0f);
  energy["avg_power_w_30m"] = (energy30mWh * 3600.0f) / min(runtimeSec, 30.0f * 60.0f);
  energy["avg_power_w_1h"] = (energy1hWh * 3600.0f) / min(runtimeSec, 60.0f * 60.0f);
  energy["avg_power_w_1d"] = (energy1dWh * 3600.0f) / min(runtimeSec, 24.0f * 60.0f * 60.0f);

  JsonObject evaluation = doc.createNestedObject("evaluation");
  JsonObject controlEval = evaluation.createNestedObject("control");
  controlEval["total_control_actions"] = totalControlActions;
  controlEval["shedding_event_count"] = sheddingEventCount;
  controlEval["curtail_event_count"] = curtailEventCount;
  controlEval["restore_event_count"] = restoreEventCount;
  controlEval["control_actions_per_min"] = (totalControlActions * 60.0f) / runtimeSec;

  JsonObject stabilityEval = evaluation.createNestedObject("stability");
  stabilityEval["max_overshoot_w"] = maxOvershootW;
  stabilityEval["overshoot_event_count"] = overloadEventCount;
  stabilityEval["overshoot_energy_ws"] = overshootEnergyWs;
  stabilityEval["load_toggle_count"] = loadToggleCount;
  stabilityEval["last_peak_settling_time_sec"] = lastPeakSettlingSec;

  JsonObject predEval = evaluation.createNestedObject("prediction");
  double nowEpochSec = (double)time(nullptr);
  float predictionAgeMs = 0.0f;
  if (predictorSourceTimestampSec > 0.0 && nowEpochSec > 100000.0) {
    predictionAgeMs = max(0.0f, (float)((nowEpochSec - predictorSourceTimestampSec) * 1000.0));
  }
  predEval["prediction_age_ms"] = predictionAgeMs;
  predEval["apply_delay_sec"] = predictionApplyDelaySec;
  predEval["horizon_sec"] = predictorHorizonSec;

  JsonObject voltages = doc.createNestedObject("voltages");
  voltages["load_bus_v"] = loadBusVoltageV;
  voltages["aux_v"] = auxVoltageV;

  JsonObject pred = doc.createNestedObject("prediction_context");
  pred["peak_risk"] = predictorPeakRisk;
  pred["risk_level"] = predictorRiskLevel;
  pred["predicted_power_w"] = predictorPowerW;
  pred["ai_suggestion_count"] = aiSuggestionCount;

  JsonObject loadsJson = doc.createNestedObject("loads");
  for (size_t i = 0; i < LOAD_COUNT; ++i) {
    LoadChannel* ld = loads[i];
    JsonObject j = loadsJson.createNestedObject(ld->name);
    j["on"] = ld->on;
    j["duty"] = ld->duty;
    j["duty_applied"] = ld->appliedDuty;
    j["power_w"] = ld->powerW;
    j["current_a"] = ld->currentA;
    j["energy_goal_window_wh"] = ld->goalWindowEnergyWh;
    j["voltage_v"] = ld->voltageV;
    j["priority"] = ld->priority;
    j["class"] = loadClassToString(ld->loadClass);
    j["override"] = ld->policyOverride;
    j["health"] = ld->health;
    j["fault_code"] = ld->faultCode;
    j["fault_active"] = ld->faultActive;
    j["fault_latched"] = ld->faultLatched;
    j["fault_limit_a"] = ld->faultLimitA;
    j["fault_trip_ms"] = ld->faultTripDelayMs;
    j["fault_clear_ms"] = ld->faultClearDelayMs;
    j["fault_restore_ms"] = ld->faultRestoreDelayMs;
    j["inject_current_a"] = ld->faultInjectA;
    if (!isnan(ld->tempC)) j["temperature_c"] = ld->tempC;
  }

  String payload;
  if (doc.overflowed()) {
    Serial.println("[mqtt] telemetry json overflow (increase doc size or reduce fields)");
  }
  serializeJson(doc, payload);
  bool ok = mqttClient.publish(topicTelemetry.c_str(), payload.c_str());
  if (!ok) {
    Serial.printf("[mqtt] telemetry publish failed (len=%u, state=%d)\n",
                  (unsigned int)payload.length(), mqttClient.state());
  }
}

