Omzlaw/iot-based-industrial-energy-monitoring-and-predictive-load-management-system/MSc Project/Arduino/esp32_digital_twin_controller/esp32_digital_twin_controller.ino
void printTick(float totalPowerW, float totalCurrentA) {
  const unsigned long nowMs = millis();
  float runtimeSec = max(1.0f, millis() / 1000.0f);
  float energy10mWh = getWindowEnergyWh(10);
  float energy30mWh = getWindowEnergyWh(30);
  float energy1hWh = getWindowEnergyWh(60);
  float energy1dWh = getWindowEnergyWh(24 * 60);
  ensureEnergyGoalWindowConfigured(nowMs);
  advanceEnergyGoalWindowToMs(nowMs, "window_completed");
  float goalWindowWh = getCurrentEnergyGoalWindowWh();
  unsigned long goalWindowDurationMs = energyGoalWindowDurationMs();
  unsigned long goalWindowElapsedMs = (energyGoalWindowStartMs > 0 && nowMs >= energyGoalWindowStartMs)
    ? (nowMs - energyGoalWindowStartMs)
    : 0UL;
  unsigned long goalWindowRemainingMs = (goalWindowElapsedMs >= goalWindowDurationMs)
    ? 0UL
    : (goalWindowDurationMs - goalWindowElapsedMs);

  Serial.println();
  Serial.println("======================================================================");
  Serial.print("[time] ");
  Serial.println(isoTimestampUtc());
  Serial.println("Loads:");
  Serial.println("----------------------------------------------------------------------");
  Serial.println("NAME       P CLASS          ON   DUTY  VOLT(V) POWER(W) CURR(A)");
  Serial.println("----------------------------------------------------------------------");

  for (size_t i = 0; i < LOAD_COUNT; ++i) {
    LoadChannel* ld = loads[i];
    Serial.printf(
      "%-9s %1u %-14s %-4s %5.2f  %7.2f %8.2f %7.2f\n",
      ld->name.c_str(),
      ld->priority,
      loadClassToString(ld->loadClass).c_str(),
      ld->on ? "on" : "off",
      ld->duty,
      ld->voltageV,
      ld->powerW,
      ld->currentA
    );
  }
  Serial.println("----------------------------------------------------------------------");

  Serial.println("System / Env / Process / Eval:");
  Serial.println("----------------------------------------------------------------------");
  Serial.printf("%-12s | %-18s | %-18s | %-18s\n", "SECTION", "FIELD", "VALUE", "UNIT");
  Serial.println("----------------------------------------------------------------------");
  Serial.printf("%-12s | %-18s | %-18s | %-18s\n", "system", "policy", controlPolicyToString(controlPolicy).c_str(), "-");
  String activeSources = activePredictionSourcesSummary();
  PredictionInputSource dynamicProcessSrc = PRED_SRC_LONG_RF;
  String aiDynamicReason;
  const bool aiDynamicAvailable = (selectDynamicProcessPredictionState(&dynamicProcessSrc, &aiDynamicReason) != nullptr);
  String aiDynamicSource = aiDynamicAvailable ? predictionSourceToString(dynamicProcessSrc) : "NONE";
  Serial.printf("%-12s | %-18s | %-18s | %-18s\n", "system", "ai_sources", activeSources.c_str(), "-");
  Serial.printf("%-12s | %-18s | %-18s | %-18s\n", "system", "ai_dyn_process",
                (controlPolicy == POLICY_AI_PREFERRED || controlPolicy == POLICY_HYBRID) ? "on" : "off", "-");
  Serial.printf("%-12s | %-18s | %-18s | %-18s\n", "system", "ai_dyn_avail", aiDynamicAvailable ? "yes" : "no", "-");
  Serial.printf("%-12s | %-18s | %-18s | %-18s\n", "system", "ai_dyn_source", aiDynamicSource.c_str(), "-");
  Serial.printf("%-12s | %-18s | %-18s | %-18s\n", "system", "ai_dyn_reason", aiDynamicReason.c_str(), "-");
  Serial.printf("%-12s | %-18s | %-18s | %-18s\n", "system", "tariff", tariffState.c_str(), "-");
  Serial.printf("%-12s | %-18s | %-18s | %-18s\n", "system", "peak_event", peakEvent ? "on" : "off", "-");
  Serial.printf("%-12s | %-18s | %-18.2f | %-18s\n", "system", "supply_v", loadBusVoltageV, "V");
  Serial.printf("%-12s | %-18s | %-18.2f | %-18s\n", "system", "supply_v_raw", loadBusVoltageRawV, "V");
  Serial.printf("%-12s | %-18s | %-18s | %-18s\n", "system", "voltage_inject", voltageInjectionModeToString(voltageInjectionMode), "-");
  Serial.printf("%-12s | %-18s | %-18.2f | %-18s\n", "system", "inject_mag", voltageInjectionMagnitudeV, "V");
  Serial.printf("%-12s | %-18s | %-18.2f | %-18s\n", "system", "total_power", totalPowerW, "W");
  Serial.printf("%-12s | %-18s | %-18.2f | %-18s\n", "system", "total_current", totalCurrentA, "A");
  Serial.printf("%-12s | %-18s | %-18.2f | %-18s\n", "system", "max_power", MAX_TOTAL_POWER_W, "W");
  Serial.printf("%-12s | %-18s | %-18.2f | %-18s\n", "system", "uv_threshold", UNDERVOLTAGE_THRESHOLD_V, "V");
  Serial.printf("%-12s | %-18s | %-18lu | %-18s\n", "system", "uv_trip_delay", UNDERVOLTAGE_TRIP_DELAY_MS, "ms");
  Serial.printf("%-12s | %-18s | %-18lu | %-18s\n", "system", "uv_clear_delay", UNDERVOLTAGE_CLEAR_DELAY_MS, "ms");
  Serial.printf("%-12s | %-18s | %-18.2f | %-18s\n", "system", "uv_margin", UNDERVOLTAGE_RESTORE_MARGIN_V, "V");
  Serial.printf("%-12s | %-18s | %-18s | %-18s\n", "system", "uv_active", undervoltageActive ? "yes" : "no", "-");
  Serial.printf("%-12s | %-18s | %-18.2f | %-18s\n", "system", "ov_threshold", OVERVOLTAGE_THRESHOLD_V, "V");
  Serial.printf("%-12s | %-18s | %-18lu | %-18s\n", "system", "ov_trip_delay", OVERVOLTAGE_TRIP_DELAY_MS, "ms");
  Serial.printf("%-12s | %-18s | %-18lu | %-18s\n", "system", "ov_clear_delay", OVERVOLTAGE_CLEAR_DELAY_MS, "ms");
  Serial.printf("%-12s | %-18s | %-18.2f | %-18s\n", "system", "ov_margin", OVERVOLTAGE_RESTORE_MARGIN_V, "V");
  Serial.printf("%-12s | %-18s | %-18s | %-18s\n", "system", "ov_active", overvoltageActive ? "yes" : "no", "-");
  Serial.printf("%-12s | %-18s | %-18.2f | %-18s\n", "env", "ambient_temp", ambientTempC, "C");
  Serial.printf("%-12s | %-18s | %-18.2f | %-18s\n", "env", "humidity", ambientHumidity, "%");
  Serial.printf("%-12s | %-18s | %-18d | %-18s\n", "env", "ai_suggestions", aiSuggestionCount, "-");
  Serial.printf("%-12s | %-18s | %-18s | %-18s\n", "process", "enabled", productionProcessEnabled ? "on" : "off", "-");
  Serial.printf("%-12s | %-18s | %-18s | %-18s\n", "process", "lock", processLockActive ? "on" : "off", "-");
  Serial.printf("%-12s | %-18s | %-18s | %-18s\n", "process", "state", productionStateToString(productionState), "-");
  Serial.printf("%-12s | %-18s | %-18lu | %-18s\n", "process", "cycles", (unsigned long)processCycleCount, "count");
  Serial.printf("%-12s | %-18s | %-18lu | %-18s\n", "process", "goal_cycles", (unsigned long)PRODUCTION_GOAL_CYCLES, "count");
  if (tank1LevelValid) Serial.printf("%-12s | %-18s | %-18.2f | %-18s\n", "process", "tank1_level", tank1LevelPct, "%");
  else Serial.printf("%-12s | %-18s | %-18s | %-18s\n", "process", "tank1_level", "N/A", "%");
  Serial.printf("%-12s | %-18s | %-18.2f | %-18s\n", "process", "tank1_temp", tank1TempC, "C");
  if (tank1LevelValid && !isnan(tank1DistanceCm)) Serial.printf("%-12s | %-18s | %-18.2f | %-18s\n", "process", "tank1_dist", tank1DistanceCm, "cm");
  else Serial.printf("%-12s | %-18s | %-18s | %-18s\n", "process", "tank1_dist", "N/A", "cm");
  if (tank2LevelValid) Serial.printf("%-12s | %-18s | %-18.2f | %-18s\n", "process", "tank2_level", tank2LevelPct, "%");
  else Serial.printf("%-12s | %-18s | %-18s | %-18s\n", "process", "tank2_level", "N/A", "%");
  Serial.printf("%-12s | %-18s | %-18.2f | %-18s\n", "process", "tank2_temp", tank2TempC, "C");
  if (tank2LevelValid && !isnan(tank2DistanceCm)) Serial.printf("%-12s | %-18s | %-18.2f | %-18s\n", "process", "tank2_dist", tank2DistanceCm, "cm");
  else Serial.printf("%-12s | %-18s | %-18s | %-18s\n", "process", "tank2_dist", "N/A", "cm");
  Serial.println("----------------------------------------------------------------------");
  Serial.printf(
    "[energy] total=%.4fWh 10m=%.4fWh(%.2fW) 30m=%.4fWh(%.2fW) 1h=%.4fWh(%.2fW) 1d=%.4fWh(%.2fW)\n",
    cumulativeEnergyWh,
    energy10mWh, (energy10mWh * 3600.0f) / min(runtimeSec, 10.0f * 60.0f),
    energy30mWh, (energy30mWh * 3600.0f) / min(runtimeSec, 30.0f * 60.0f),
    energy1hWh, (energy1hWh * 3600.0f) / min(runtimeSec, 60.0f * 60.0f),
    energy1dWh, (energy1dWh * 3600.0f) / min(runtimeSec, 24.0f * 60.0f * 60.0f)
  );
  Serial.printf(
    "         goal=%.2fWh window=%.1fmin consumed=%.2fWh left=%.2fWh used=%.2f%% time_left=%.1fs resets=%lu reason=%s\n",
    MAX_ENERGY_CONSUMPTION_FOR_THR_DAY_WH,
    ENERGY_GOAL_DURATION_SEC / 60.0f,
    goalWindowWh,
    (MAX_ENERGY_CONSUMPTION_FOR_THR_DAY_WH > 0.0f) ? max(0.0f, MAX_ENERGY_CONSUMPTION_FOR_THR_DAY_WH - goalWindowWh) : 0.0f,
    (MAX_ENERGY_CONSUMPTION_FOR_THR_DAY_WH > 0.0f) ? (goalWindowWh / MAX_ENERGY_CONSUMPTION_FOR_THR_DAY_WH) * 100.0f : 0.0f,
    goalWindowRemainingMs / 1000.0f,
    energyGoalWindowResetCount,
    energyGoalWindowResetReason
  );
  double nowEpochSec = (double)time(nullptr);
  float predictionAgeMs = 0.0f;
  if (predictorSourceTimestampSec > 0.0 && nowEpochSec > 100000.0) {
    predictionAgeMs = max(0.0f, (float)((nowEpochSec - predictorSourceTimestampSec) * 1000.0));
  }
  Serial.printf("%-12s | %-18s | %-18lu | %-18s\n", "eval", "actions", totalControlActions, "count");
  Serial.printf("%-12s | %-18s | %-18lu | %-18s\n", "eval", "shed_events", sheddingEventCount, "count");
  Serial.printf("%-12s | %-18s | %-18lu | %-18s\n", "eval", "curtail_events", curtailEventCount, "count");
  Serial.printf("%-12s | %-18s | %-18lu | %-18s\n", "eval", "restore_events", restoreEventCount, "count");
  Serial.printf("%-12s | %-18s | %-18lu | %-18s\n", "eval", "overload_events", overloadEventCount, "count");
  Serial.printf("%-12s | %-18s | %-18.2f | %-18s\n", "eval", "max_overshoot", maxOvershootW, "W");
  Serial.printf("%-12s | %-18s | %-18lu | %-18s\n", "eval", "load_toggles", loadToggleCount, "count");
  Serial.printf("%-12s | %-18s | %-18.1f | %-18s\n", "eval", "pred_age", predictionAgeMs, "ms");
  Serial.printf("%-12s | %-18s | %-18.1f | %-18s\n", "eval", "apply_delay", predictionApplyDelaySec, "s");
  Serial.printf("%-12s | %-18s | %-18.2f | %-18s\n", "eval", "settle_time", lastPeakSettlingSec, "s");
  Serial.println("======================================================================");
}

