Omzlaw/iot-based-industrial-energy-monitoring-and-predictive-load-management-system/MSc Project/Arduino/esp32_digital_twin_controller/esp32_digital_twin_controller.ino
// -----------------------------
// Setup / loop
// -----------------------------
void initializeLoadMetadata() {
  motor1.loadClass = CLASS_CRITICAL;     motor1.priority = 1;
  motor2.loadClass = CLASS_CRITICAL;     motor2.priority = 1;
  heater1.loadClass = CLASS_ESSENTIAL;   heater1.priority = 2;
  heater2.loadClass = CLASS_ESSENTIAL;   heater2.priority = 2;
  light1.loadClass = CLASS_IMPORTANT;    light1.priority = 3;
  light2.loadClass = CLASS_SECONDARY;    light2.priority = 4;
  for (size_t i = 0; i < LOAD_COUNT; ++i) {
    loads[i]->currentGain = INA219_CURRENT_GAIN[i];
    loads[i]->currentOffsetA = 0.0f;
    loads[i]->filteredCurrentA = 0.0f;
    loads[i]->currentFilterInitialized = false;
  }
}

void initializeAnalogInputs() {
  analogReadResolution(12);
  if (!USE_INA219) {
    analogSetPinAttenuation(MOTOR1_PINS.currentPin, ADC_11db);
    analogSetPinAttenuation(MOTOR2_PINS.currentPin, ADC_11db);
    analogSetPinAttenuation(LIGHT1_PINS.currentPin, ADC_11db);
    analogSetPinAttenuation(LIGHT2_PINS.currentPin, ADC_11db);
    analogSetPinAttenuation(HEATER1_PINS.currentPin, ADC_11db);
    analogSetPinAttenuation(HEATER2_PINS.currentPin, ADC_11db);
  }
  analogSetPinAttenuation(VOLTAGE_SENSOR_1_PIN, ADC_11db);
  analogSetPinAttenuation(VOLTAGE_SENSOR_2_PIN, ADC_11db);
}

void initializeTemperatureSensors() {
  ds18b20.begin();
  ds18b20.setWaitForConversion(true);
  int count = ds18b20.getDeviceCount();
  if (count >= 1) tankTempSensor1Found = ds18b20.getAddress(tankTempAddress1, 0);
  if (count >= 2) tankTempSensor2Found = ds18b20.getAddress(tankTempAddress2, 1);
  if (tankTempSensor1Found) ds18b20.setResolution(tankTempAddress1, 12);
  if (tankTempSensor2Found) ds18b20.setResolution(tankTempAddress2, 12);
  Serial.printf("[sensors] DS18B20 found=%d tank1=%s tank2=%s\n",
                count,
                tankTempSensor1Found ? "yes" : "no",
                tankTempSensor2Found ? "yes" : "no");

  dht22.setup(DHT22_PIN, DHTesp::DHT22);
}

void diagnoseAnalogPin(const char* name, uint8_t pin) {
  int raw = analogRead(pin);
  float voltage = (raw / ADC_MAX_COUNTS) * ADC_REFERENCE_V;
  Serial.printf("[sensors] %s pin=%u raw=%d v=%.3f\n", name, pin, raw, voltage);
  if (raw <= 2 || raw >= 4093) {
    Serial.printf("[sensors] WARN %s looks saturated (check wiring/divider)\n", name);
  }
}

float readAnalogVoltageAvg(uint8_t pin, uint8_t samples) {
  uint32_t acc = 0;
  for (uint8_t i = 0; i < samples; ++i) {
    acc += analogRead(pin);
    delayMicroseconds(200);
  }
  float raw = acc / (float)samples;
  return (raw / ADC_MAX_COUNTS) * ADC_REFERENCE_V;
}

void calibrateCurrentZeroOffsets() {
  if (USE_INA219) {
    calibrateIna219CurrentOffsets();
    return;
  }
  Serial.println("[sensors] calibrating current zero offsets (no-load expected)...");
  bool prevOn[LOAD_COUNT];
  float prevDuty[LOAD_COUNT];
  unsigned long nowMs = millis();
  for (size_t i = 0; i < LOAD_COUNT; ++i) {
    prevOn[i] = loads[i]->on;
    prevDuty[i] = loads[i]->duty;
    loads[i]->on = false;
    loads[i]->duty = 0.0f;
    loads[i]->applyHardware(nowMs);
  }
  delay(CURRENT_ZERO_SETTLE_MS);
  for (size_t i = 0; i < LOAD_COUNT; ++i) {
    LoadChannel* ld = loads[i];
    float v = readAnalogVoltageAvg(ld->pins.currentPin, CURRENT_ZERO_CAL_SAMPLES);
    ld->currentZeroV = v;
    Serial.printf("[sensors] zero_%s pin=%u v=%.3f\n",
                  ld->name.c_str(),
                  ld->pins.currentPin,
                  v);
  }
  for (size_t i = 0; i < LOAD_COUNT; ++i) {
    loads[i]->on = prevOn[i];
    loads[i]->duty = prevDuty[i];
    loads[i]->applyHardware(nowMs);
  }
}

void diagnoseSensors() {
  Serial.println("[sensors] running diagnostics...");

  // DHT22 needs at least 2s between reads.
  delay(2100);
  TempAndHumidity dhtData = dht22.getTempAndHumidity();
  if (isnan(dhtData.temperature) || isnan(dhtData.humidity)) {
    Serial.println("[sensors] DHT22 read failed (check wiring + pullup)");
  } else {
    Serial.printf("[sensors] DHT22 temp=%.2fC hum=%.2f%%\n", dhtData.temperature, dhtData.humidity);
  }

  float d1 = NAN;
  float d2 = NAN;
  if (ULTRASONIC_UART_MODE) {
    float cm = NAN;
    if (readUltrasonicDistanceUartCm(UltrasonicSerial1, cm)) d1 = cm;
    cm = NAN;
    if (readUltrasonicDistanceUartCm(UltrasonicSerial2, cm)) d2 = cm;
  } else {
    unsigned long pulse1 = 0;
    unsigned long pulse2 = 0;
    d1 = readUltrasonicDistanceWithRetry(ULTRASONIC_TANK1_ECHO_PIN, ULTRASONIC_TANK1_TRIG_PIN, &pulse1);
    delay(ULTRASONIC_INTER_SENSOR_DELAY_MS);
    d2 = readUltrasonicDistanceWithRetry(ULTRASONIC_TANK2_ECHO_PIN, ULTRASONIC_TANK2_TRIG_PIN, &pulse2);
    if (isnan(d1)) {
      Serial.printf("[sensors] Ultrasonic tank1: no echo (pulse=%luus)\n", pulse1);
    }
    if (isnan(d2)) {
      Serial.printf("[sensors] Ultrasonic tank2: no echo (pulse=%luus)\n", pulse2);
    }
  }
  d1 = sanitizeUltrasonicDistanceCm(d1);
  d2 = sanitizeUltrasonicDistanceCm(d2);
  if (!isnan(d1)) Serial.printf("[sensors] Ultrasonic tank1 distance=%.2fcm\n", d1);
  if (!isnan(d2)) Serial.printf("[sensors] Ultrasonic tank2 distance=%.2fcm\n", d2);

  if (USE_INA219) {
    for (size_t i = 0; i < LOAD_COUNT; ++i) {
      uint8_t ch = INA219_CHANNELS[i];
      if (!ina219Present[i]) {
        Serial.printf("[sensors] INA219 %s ch=%u not detected\n", loads[i]->name.c_str(), ch);
        continue;
      }
      float rawA = readIna219CurrentRawA(ch);
      float calibA = applyIna219CurrentCalibration(loads[i], rawA);
      Serial.printf("[sensors] INA219 %s ch=%u raw=%.4fA offset=%.4fA current=%.4fA\n",
                    loads[i]->name.c_str(), ch, rawA, loads[i]->currentOffsetA, calibA);
    }
  } else {
    diagnoseAnalogPin("current_motor1", MOTOR1_PINS.currentPin);
    diagnoseAnalogPin("current_motor2", MOTOR2_PINS.currentPin);
    diagnoseAnalogPin("current_light1", LIGHT1_PINS.currentPin);
    diagnoseAnalogPin("current_light2", LIGHT2_PINS.currentPin);
    diagnoseAnalogPin("current_heater1", HEATER1_PINS.currentPin);
    diagnoseAnalogPin("current_heater2", HEATER2_PINS.currentPin);
  }
  diagnoseAnalogPin("voltage_bus", VOLTAGE_SENSOR_1_PIN);
  diagnoseAnalogPin("voltage_aux", VOLTAGE_SENSOR_2_PIN);
}

void updateTemperatureSensors() {
  ds18b20.requestTemperatures();
  if (tankTempSensor1Found) {
    float t1 = ds18b20.getTempC(tankTempAddress1);
    if (isValidDs18Sample(t1)) {
      float corrected = t1 + TANK1_TEMP_OFFSET_C;
      if (!tank1TempInitialized) {
        tank1TempC = corrected;
        tank1TempInitialized = true;
      } else {
        tank1TempC = smoothBounded(tank1TempC, corrected, TANK_TEMP_FILTER_ALPHA, TANK_TEMP_MAX_STEP_C);
      }
      tank1TempInvalidCount = 0;
    } else {
      if (tank1TempInvalidCount < TEMP_INVALID_MAX_HOLD) {
        tank1TempInvalidCount++;
      } else {
        tank1TempC = 0.0f;
        tank1TempInitialized = false;
      }
    }
  } else {
    tank1TempC = 0.0f;
    tank1TempInitialized = false;
    tank1TempInvalidCount = TEMP_INVALID_MAX_HOLD;
  }
  if (tankTempSensor2Found) {
    float t2 = ds18b20.getTempC(tankTempAddress2);
    if (isValidDs18Sample(t2)) {
      float corrected = t2 + TANK2_TEMP_OFFSET_C;
      if (!tank2TempInitialized) {
        tank2TempC = corrected;
        tank2TempInitialized = true;
      } else {
        tank2TempC = smoothBounded(tank2TempC, corrected, TANK_TEMP_FILTER_ALPHA, TANK_TEMP_MAX_STEP_C);
      }
      tank2TempInvalidCount = 0;
    } else {
      if (tank2TempInvalidCount < TEMP_INVALID_MAX_HOLD) {
        tank2TempInvalidCount++;
      } else {
        tank2TempC = 0.0f;
        tank2TempInitialized = false;
      }
    }
  } else {
    tank2TempC = 0.0f;
    tank2TempInitialized = false;
    tank2TempInvalidCount = TEMP_INVALID_MAX_HOLD;
  }

