Omzlaw/iot-based-industrial-energy-monitoring-and-predictive-load-management-system/MSc Project/Arduino/esp32_digital_twin_controller/esp32_digital_twin_controller.ino
  unsigned long nowMs = millis();
  if (nowMs - lastDhtReadMs >= DHT_READ_INTERVAL_MS) {
    lastDhtReadMs = nowMs;
    TempAndHumidity dhtData = dht22.getTempAndHumidity();
    if (!isnan(dhtData.temperature)) {
      float correctedTemp = dhtData.temperature + DHT_TEMP_OFFSET_C + seasonTempOffsetC;
      if (!ambientTempInitialized) {
        ambientTempC = correctedTemp;
        ambientTempInitialized = true;
      } else {
        ambientTempC = smoothBounded(ambientTempC, correctedTemp, AMBIENT_TEMP_FILTER_ALPHA, AMBIENT_TEMP_MAX_STEP_C);
      }
    }
    if (!isnan(dhtData.humidity)) {
      float correctedHum = clampf(dhtData.humidity + DHT_HUM_OFFSET_PCT + seasonHumidityOffset, 0.0f, 100.0f);
      if (!ambientHumidityInitialized) {
        ambientHumidity = correctedHum;
        ambientHumidityInitialized = true;
      } else {
        ambientHumidity = smoothBounded(ambientHumidity, correctedHum, AMBIENT_HUM_FILTER_ALPHA, AMBIENT_HUM_MAX_STEP_PCT);
      }
      ambientHumidity = clampf(ambientHumidity, 0.0f, 100.0f);
    }
  }
}

void setupTopics() {
  topicTelemetry = String("dt/") + PLANT_IDENTIFIER + "/telemetry";
  topicCommand = String("dt/") + PLANT_IDENTIFIER + "/cmd";
  topicStatus = String("dt/") + PLANT_IDENTIFIER + "/status";
  topicPrediction = String("dt/") + PLANT_IDENTIFIER + "/prediction";
  topicPredictionLong = String("dt/") + PLANT_IDENTIFIER + "/prediction_long";
  topicPredictionLongLstm = String("dt/") + PLANT_IDENTIFIER + "/prediction_long_lstm";
  topicCommandAck = String("dt/") + PLANT_IDENTIFIER + "/cmd_ack";
}

void setup() {
  Serial.begin(115200);
  delay(300);

  loadRuntimeConfigFromNvs();
  runStartupConfigWizard();
  if (!runtimeConfigLooksUsable()) {
    Serial.println("[config] missing/placeholder WiFi or MQTT settings, reboot after providing valid values");
    while (true) delay(1000);
  }

  setupTopics();
  initializeLoadMetadata();
  initializeAnalogInputs();
  forceAllLoadsOff(false);
  if (USE_INA219) {
    Wire.begin(I2C_SDA_RUNTIME_PIN, I2C_SCL_RUNTIME_PIN);
    if (USE_TCA9548A) {
      if (!tcaPresent()) {
        Serial.println("[sensors] TCA9548A not detected");
        while (true) delay(1000);
      }
      Serial.println("[sensors] TCA9548A detected");
      for (size_t i = 0; i < LOAD_COUNT; ++i) {
        uint8_t ch = INA219_CHANNELS[i];
        ina219Present[i] = initIna219OnChannel(ch);
        Serial.printf("[sensors] INA219 %s ch=%u %s\n",
                      loads[i]->name.c_str(),
                      ch,
                      ina219Present[i] ? "ok" : "missing");
      }
    } else {
      const size_t directIndex = 4; // light1
      ina219Present[directIndex] = initIna219OnChannel(INA219_CHANNELS[directIndex]);
      Serial.printf("[sensors] INA219 direct (%s) %s\n",
                    loads[directIndex]->name.c_str(),
                    ina219Present[directIndex] ? "ok" : "missing");
      for (size_t i = 1; i < LOAD_COUNT; ++i) {
        if (i == directIndex) continue;
        ina219Present[i] = false;
      }
    }
  }
  if (ULTRASONIC_UART_MODE) {
    UltrasonicSerial1.begin(ULTRASONIC_UART_BAUD, SERIAL_8N1, ULTRASONIC1_UART_RX_PIN, ULTRASONIC_UART_TX_PIN);
    UltrasonicSerial2.begin(ULTRASONIC_UART_BAUD, SERIAL_8N1, ULTRASONIC2_UART_RX_PIN, ULTRASONIC_UART_TX_PIN);
    UltrasonicSerial1.flush();
    UltrasonicSerial2.flush();
    Serial.println("[sensors] Ultrasonic UART mode enabled (JSN-SR04T)");
  } else {
    pinMode(ULTRASONIC_TANK1_TRIG_PIN, OUTPUT);
    pinMode(ULTRASONIC_TANK2_TRIG_PIN, OUTPUT);
    digitalWrite(ULTRASONIC_TANK1_TRIG_PIN, ULTRASONIC_TRIG_ACTIVE_HIGH ? LOW : HIGH);
    digitalWrite(ULTRASONIC_TANK2_TRIG_PIN, ULTRASONIC_TRIG_ACTIVE_HIGH ? LOW : HIGH);
    pinMode(ULTRASONIC_TANK1_ECHO_PIN, INPUT);
    pinMode(ULTRASONIC_TANK2_ECHO_PIN, INPUT);
  }

  heater1.smoothDuty = false;
  heater2.smoothDuty = false;

  motor1.begin();
  motor2.begin();
  light1.begin();
  light2.begin();
  heater1.begin();
  heater2.begin();

  calibrateCurrentZeroOffsets();
  initializeTemperatureSensors();
  diagnoseSensors();

  ensureWifiConnected();

  if (USE_INSECURE_TLS) {
    secureClient.setInsecure();
  }

  mqttClient.setServer(runtimeConfig.mqttHost.c_str(), runtimeConfig.mqttPort);
  // Telemetry JSON is large; increase MQTT client packet buffer from default (~256B).
  mqttClient.setBufferSize(12288);
  mqttClient.setCallback(mqttCallback);
  ensureMqttConnected();

  currentMinuteBucketStartMs = millis();
  resetEnergyGoalWindowState("startup", currentMinuteBucketStartMs, false);
  sceneStartMs = millis();

  // Publish online status
  StaticJsonDocument<512> status;
  status["timestamp"] = isoTimestampUtc();
  status["plant_id"] = PLANT_IDENTIFIER;
  status["status"] = "ONLINE";
  status["cmd_topic"] = topicCommand;
  status["telemetry_topic"] = topicTelemetry;
  status["prediction_topic"] = topicPrediction;
  status["prediction_long_topic"] = topicPredictionLong;
  status["prediction_long_lstm_topic"] = topicPredictionLongLstm;
  String statusPayload;
  serializeJson(status, statusPayload);
  mqttClient.publish(topicStatus.c_str(), statusPayload.c_str(), true);

  Serial.println("=== ESP32 Industrial Controller Started ===");
  Serial.printf("Broker: %s:%u\n", runtimeConfig.mqttHost.c_str(), runtimeConfig.mqttPort);
  Serial.printf("WiFi SSID: %s\n", runtimeConfig.wifiSsid.c_str());
  Serial.printf("WiFi Auth: %s\n", WIFI_USE_ENTERPRISE ? "WPA2-Enterprise" : "WPA/WPA2-PSK");
  Serial.printf("Topics: telemetry=%s cmd=%s prediction=%s prediction_long=%s prediction_long_lstm=%s\n",
                topicTelemetry.c_str(), topicCommand.c_str(), topicPrediction.c_str(),
                topicPredictionLong.c_str(), topicPredictionLongLstm.c_str());
}

void loop() {
  ensureWifiConnected();
  ensureOtaReady();
  ensureMqttConnected();
  mqttClient.loop();
  ArduinoOTA.handle();
  applyPendingPredictionIfDue();

  const unsigned long nowMs = millis();
  if (nowMs - lastSampleMs < sampleIntervalMs) return;
  unsigned long elapsedMs = (lastSampleMs == 0) ? sampleIntervalMs : (nowMs - lastSampleMs);
  lastSampleMs = nowMs;
  float elapsedSec = elapsedMs / 1000.0f;

  // Legacy season/mode profiles are deprecated.

  measureTankLevelsFromUltrasonic();
  updateTemperatureSensors();
  if (!emergencyStopActive && productionProcessEnabled) {
    applyProductionProcess(elapsedSec);
    applyAiProcessOverridesFromSuggestions();
  }
  if (productionProcessEnabled && predictorMode != "ONLINE" && processCycleCount >= PRODUCTION_GOAL_CYCLES) {
    productionProcessEnabled = false;
    processLockActive = false;
    productionState = PROCESS_IDLE;
  }
  // Keep legacy scene fields aligned with production process for dashboard compatibility.
  sceneEnabled = productionProcessEnabled;
  sceneLockActive = processLockActive;
  sceneName = "TANK_PRODUCTION_PROCESS";
  sceneDurationSec = 0.0f;
  if (sceneEnabled && !productionProcessEnabled) {
    if (!isnan(sceneTargetTempC)) ambientTempC = sceneTargetTempC;
    if (!isnan(sceneTargetHumidityPct)) ambientHumidity = clampf(sceneTargetHumidityPct, 0.0f, 100.0f);
  }
  loadBusVoltageRawV = readVoltageSensorV(VOLTAGE_SENSOR_1_PIN, VOLTAGE_SENSOR_1_RATIO);
  auxVoltageRawV = readVoltageSensorV(VOLTAGE_SENSOR_2_PIN, VOLTAGE_SENSOR_2_RATIO);
  loadBusVoltageV = applyInjectedVoltageScenario(loadBusVoltageRawV);
  auxVoltageV = auxVoltageRawV;
  updateUndervoltageProtectionState(nowMs);
  updateOvervoltageProtectionState(nowMs);

  if (emergencyStopActive) {
    productionProcessEnabled = false;
    processLockActive = false;
    productionState = PROCESS_IDLE;
    forceAllLoadsOff(true);
  } else {
    // Optional peak event behavior.
    if (peakEvent) {
      motor1.loadFactor = clampf(motor1.loadFactor + 0.15f, 0.5f, 1.6f);
      motor2.loadFactor = clampf(motor2.loadFactor + 0.15f, 0.5f, 1.6f);
      heater1.on = true;
      heater2.on = true;
    }
  }

  // Apply hardware outputs first, then read sensors
  for (size_t i = 0; i < LOAD_COUNT; ++i) {
    loads[i]->applyHardware(nowMs);
  }

  float totalPowerW = 0.0f;
  float totalCurrentA = 0.0f;
  for (size_t i = 0; i < LOAD_COUNT; ++i) {
    if (USE_INA219) {
      if (ina219Present[i]) {
        uint8_t ch = INA219_CHANNELS[i];
        float busV = readIna219BusVoltageV(ch);
        float rawCurrentA = readIna219CurrentRawA(ch);
        loads[i]->currentA = applyIna219CurrentCalibration(loads[i], rawCurrentA);
        loads[i]->voltageV = isnan(busV) ? loadBusVoltageV : busV;
        float powerW = fabs(readIna219PowerW(ch));
        if (isnan(powerW)) powerW = 0.0f;
        if (loads[i]->currentA <= INA219_CURRENT_DEADBAND_A) {
          powerW = 0.0f;
        }
        loads[i]->powerW = max(0.0f, powerW);
      } else {
        loads[i]->currentA = 0.0f;
        loads[i]->voltageV = 0.0f;
        loads[i]->powerW = 0.0f;
      }
    } else {
      loads[i]->updateElectricalTelemetry(loadBusVoltageV);
    }
    if (loads[i]->on && loads[i]->powerW > 0.05f) {
      loads[i]->lastActivePowerW = loads[i]->powerW;
      loads[i]->lastActiveDuty = max(0.01f, loads[i]->duty);
    }
    if (loads[i]->faultInjectA > 0.0f && loads[i]->on && !loads[i]->faultActive) {
      loads[i]->currentA = max(0.0f, loads[i]->currentA + loads[i]->faultInjectA);
      loads[i]->powerW = max(0.0f, loads[i]->currentA * loads[i]->voltageV);
    }
    updateOvercurrentFault(loads[i], nowMs);
    totalPowerW += loads[i]->powerW;
    totalCurrentA += loads[i]->currentA;
    if (lastOnState[i] != loads[i]->on) {
      loadToggleCount++;
      lastOnState[i] = loads[i]->on;
    }
  }

  updateEnergyWindows(totalPowerW, elapsedSec);

  float overshootW = max(0.0f, totalPowerW - MAX_TOTAL_POWER_W);
  maxOvershootW = max(maxOvershootW, overshootW);
  overshootEnergyWs += (overshootW * elapsedSec);
  if (overshootW > 0.0f && !wasOverloadedLastTick) overloadEventCount++;
  wasOverloadedLastTick = overshootW > 0.0f;

  if (predictorPeakRisk && !peakRiskActive) {
    peakRiskActive = true;
    peakRiskStartMs = nowMs;
  }
  if (peakRiskActive && !predictorPeakRisk && totalPowerW <= (MAX_TOTAL_POWER_W * RESTORE_POWER_RATIO)) {
    lastPeakSettlingSec = (nowMs - peakRiskStartMs) / 1000.0f;
    peakRiskActive = false;
  }

  if (!emergencyStopActive) {
    applyAutomaticControl(totalPowerW);
  }

  publishTelemetry(totalPowerW, totalCurrentA);
  printTick(totalPowerW, totalCurrentA);
}
